#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Account

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum Account.EExternalAccountType
// NumValues: 0x000B
enum class EExternalAccountType : uint8
{
	None                                     = 0,
	Facebook                                 = 1,
	Google                                   = 2,
	Epic_PSN                                 = 3,
	Epic_XBL                                 = 4,
	Epic_Erebus                              = 5,
	Epic_Facebook                            = 6,
	Epic_Google                              = 7,
	Epic_Portal                              = 8,
	Epic_Portal_Kairos                       = 9,
	EExternalAccountType_MAX                 = 10,
};

// Enum Account.ECreateAccountResult
// NumValues: 0x0008
enum class ECreateAccountResult : uint8
{
	NotStarted                               = 0,
	Pending                                  = 1,
	Success                                  = 2,
	Console_LoginFailed                      = 3,
	Console_DuplicateAuthAssociation         = 4,
	DuplicateAccount                         = 5,
	GenericError                             = 6,
	ECreateAccountResult_MAX                 = 7,
};

// Enum Account.ELoginResult
// NumValues: 0x002F
enum class ELoginResult : uint8
{
	NotStarted                               = 0,
	Pending                                  = 1,
	Success                                  = 2,
	Console_LoginFailed                      = 3,
	Console_AuthFailed                       = 4,
	Console_MissingAuthAssociation           = 5,
	Console_DuplicateAuthAssociation         = 6,
	Console_AddedAuthAssociation             = 7,
	Console_AuthAssociationFailure           = 8,
	Console_NotEntitled                      = 9,
	Console_EntitlementCheckFailed           = 10,
	Console_PrivilegeCheck                   = 11,
	Console_PatchOrUpdateRequired            = 12,
	AuthFailed                               = 13,
	AuthFailed_RefreshInvalid                = 14,
	AuthFailed_InvalidMFA                    = 15,
	AuthFailed_RequiresMFA                   = 16,
	AuthFailed_AgeVerificationIncomplete     = 17,
	AuthFailed_LoginLockout                  = 18,
	AuthFailed_InvalidCredentials            = 19,
	AuthParentalLock                         = 20,
	PlatformNotAllowed                       = 21,
	NotEntitled                              = 22,
	Banned                                   = 23,
	EULACheckFailed                          = 24,
	WaitingRoomFailed                        = 25,
	ServiceUnavailable                       = 26,
	GenericError                             = 27,
	RegisterSecondaryPlayerInPrimaryPartyFailed = 28,
	RejoinCheckFailure                       = 29,
	ConnectionFailed                         = 30,
	NetworkConnectionUnavailable             = 31,
	AlreadyLoggingIn                         = 32,
	ExternalAuth_AddedAuthAssociation        = 33,
	ExternalAuth_ConnectionTimeout           = 34,
	ExternalAuth_AuthFailure                 = 35,
	ExternalAuth_AssociationFailure          = 36,
	ExternalAuth_MissingAuthAssociation      = 37,
	ExternalAuth_Canceled                    = 38,
	FailedToCreateParty                      = 39,
	ProfileQueryFailed                       = 40,
	QueryKeychainFailed                      = 41,
	ClientSettingsDownloadFailed             = 42,
	PinGrantFailure                          = 43,
	PinGrantTimeout                          = 44,
	PinGrantCanceled                         = 45,
	ELoginResult_MAX                         = 46,
};

// Enum Account.EConsoleAuthLinkState
// NumValues: 0x0009
enum class EConsoleAuthLinkState : uint8
{
	NotOnConsole                             = 0,
	ConsoleNotLoggedIn                       = 1,
	EpicNotLoggedIn                          = 2,
	ThisEpicAccountLinked                    = 3,
	OtherEpicAccountLinked                   = 4,
	NoEpicAccountLinked                      = 5,
	PrimaryIdNotLinked                       = 6,
	SecondaryIdNotLinked                     = 7,
	EConsoleAuthLinkState_MAX                = 8,
};

// ScriptStruct Account.ExternalAccountServiceConfig
// 0x000C (0x000C - 0x0000)
struct FExternalAccountServiceConfig final
{
public:
	EExternalAccountType                          Type;                                              // 0x0000(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ExternalServiceName;                               // 0x0004(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FExternalAccountServiceConfig;

// ScriptStruct Account.WebEnvUrl
// 0x0030 (0x0030 - 0x0000)
struct FWebEnvUrl final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RedirectUrl;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Environment;                                       // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWebEnvUrl;

// ScriptStruct Account.GiftMessage
// 0x0030 (0x0030 - 0x0000)
struct FGiftMessage final
{
public:
	class FString                                 GiftCode;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SenderName;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGiftMessage;

// ScriptStruct Account.ExchangeAccessParams
// 0x0040 (0x0040 - 0x0000)
struct FExchangeAccessParams final
{
public:
	class FString                                 EntitlementId;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReceiptId;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VendorReceipt;                                     // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AppStore;                                          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FExchangeAccessParams;

// ScriptStruct Account.OnlineAccountTexts_FailedLoginConsole
// 0x0138 (0x0138 - 0x0000)
struct FOnlineAccountTexts_FailedLoginConsole final
{
public:
	class FText                                   AgeRestriction;                                    // 0x0000(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Generic;                                           // 0x0018(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   MissingAuthAssociation;                            // 0x0030(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NeedPremiumAccount;                                // 0x0048(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   OnlinePlayRestriction;                             // 0x0060(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PatchAvailable;                                    // 0x0078(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PleaseSignIn;                                      // 0x0090(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   SystemUpdateAvailable;                             // 0x00A8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UI;                                                // 0x00C0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToComplete;                                  // 0x00D8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToSignIn;                                    // 0x00F0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToStartPrivCheck;                            // 0x0108(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnexpectedError;                                   // 0x0120(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOnlineAccountTexts_FailedLoginConsole;

// ScriptStruct Account.OnlineAccountTexts
// 0x09D8 (0x09D8 - 0x0000)
struct FOnlineAccountTexts final
{
public:
	class FText                                   AllGiftCodesUsed;                                  // 0x0000(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   AssociateConsoleAuth;                              // 0x0018(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   AutoLoginFailed;                                   // 0x0030(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   AutoLoginFailedMobile;                             // 0x0048(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   BannedFromGame;                                    // 0x0060(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CheckEntitledToPlay;                               // 0x0078(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CheckingRejoin;                                    // 0x0090(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CheckServiceAvailability;                          // 0x00A8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ConsolePrivileges;                                 // 0x00C0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CreateAccountCompleted;                            // 0x00D8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CreateAccountFailure;                              // 0x00F0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CreateHeadless;                                    // 0x0108(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DoQosPingTests;                                    // 0x0120(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DowntimeMinutesWarningText;                        // 0x0138(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DowntimeSecondsWarningText;                        // 0x0150(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DuplicateAuthAssociaton;                           // 0x0168(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   EulaCheck;                                         // 0x0180(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExchangeConsoleGiftsForAccess;                     // 0x0198(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExchangeConsolePurchaseForAccess;                  // 0x01B0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedAccountCreate;                               // 0x01C8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedEulaCheck_EulaAcceptanceFailed;              // 0x01E0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedEulaCheck_MustAcceptEula;                    // 0x01F8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginCredentialsMsg;                         // 0x0210(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginAgeVerificationIncomplete;              // 0x0228(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginParentalLock;                           // 0x0240(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginNoRealId;                               // 0x0258(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginLockoutMsg;                             // 0x0270(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginRequiresMFA;                            // 0x0288(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginRequiresAuthAppMFA;                     // 0x02A0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedInvalidMFA;                                  // 0x02B8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginMsg;                                    // 0x02D0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginMsg_InvalidRefreshToken;                // 0x02E8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginTencent_UnableToSignIn;                 // 0x0300(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginTencent_NotSignedInToWeGame;            // 0x0318(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginTencent_FailedToInitializeWeGame;       // 0x0330(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedLoginTencent_WeGameSystemOffline;            // 0x0348(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Tencent_ExitByAntiAddiction;                       // 0x0360(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FailedStartLogin;                                  // 0x0378(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FounderChatExitedText;                             // 0x0390(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   FounderChatJoinedText;                             // 0x03A8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   GameDisplayName;                                   // 0x03C0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   GeneralLoginFailure;                               // 0x03D8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   GlobalChatExitedText;                              // 0x03F0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   GlobalChatJoinedText;                              // 0x0408(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   HeadlessAccountFailed;                             // 0x0420(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   InMatchShutdownTimeWarningText;                    // 0x0438(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   InvalidUser;                                       // 0x0450(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggedOutofMCP;                                    // 0x0468(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   DisconnectedFromMCP;                               // 0x0480(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggedOutReturnedToTitle;                          // 0x0498(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggedOutSwitchedProfile;                          // 0x04B0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggingIn;                                         // 0x04C8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggingInConsoleAuth;                              // 0x04E0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggingOut;                                        // 0x04F8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoginConsole;                                      // 0x0510(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoginFailure;                                      // 0x0528(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Logout_Unlink;                                     // 0x0540(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LogoutCompleted;                                   // 0x0558(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LostConnection;                                    // 0x0570(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   MCPTimeout;                                        // 0x0588(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LightswitchCheckNetworkFailureMsg;                 // 0x05A0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NetworkConnectionUnavailable;                      // 0x05B8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NoPlayEntitlement;                                 // 0x05D0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   NoServerAccess;                                    // 0x05E8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PlayAccessRevoked;                                 // 0x0600(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PremiumAccountName_Default;                        // 0x0618(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PremiumAccountName_PS4;                            // 0x0630(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PremiumAccountName_Sony;                           // 0x0648(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PremiumAccountName_Switch;                         // 0x0660(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   PremiumAccountName_XboxOne;                        // 0x0678(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   RedeemOfflinePurchases;                            // 0x0690(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ServiceDowntime;                                   // 0x06A8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   SignInCompleting;                                  // 0x06C0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   SignIntoConsoleServices;                           // 0x06D8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   TokenExpired;                                      // 0x06F0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToConnect;                                   // 0x0708(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToJoinWaitingRoomLoginQueue;                 // 0x0720(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnexpectedConsoleAuthFailure;                      // 0x0738(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnlinkConsoleFailed;                               // 0x0750(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UserLoginFailed;                                   // 0x0768(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WaitingRoom;                                       // 0x0780(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WaitingRoomError;                                  // 0x0798(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WaitingRoomFailure;                                // 0x07B0(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   WaitingRoomWaiting;                                // 0x07C8(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FOnlineAccountTexts_FailedLoginConsole FailedLoginConsole;                                // 0x07E0(0x0138)(Edit, NativeAccessSpecifierPublic)
	class FText                                   LoggingInExternalAuth;                             // 0x0918(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   CreateDeviceAuth;                                  // 0x0930(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthCanceled;                                   // 0x0948(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthFailure;                                    // 0x0960(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthAssociationFailure;                         // 0x0978(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthTimeout;                                    // 0x0990(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   ExtAuthMissingAuthAssociation;                     // 0x09A8(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   UnableToQueryReceipts;                             // 0x09C0(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOnlineAccountTexts;

SDK_NAMESPACE_END
