#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmbientAudio

#include "Basic.hpp"

#include "AmbientAudio_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// Class AmbientAudio.AmbientAudioDataAsset
// 0x0028 (0x0058 - 0x0030)
class UAmbientAudioDataAsset : public UDataAsset
{
public:
	TArray<struct FAmbientAudioLoop>              LoopingSounds;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAmbientAudioOneShot>           OneShotSounds;                                     // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TagCrossfadeTime;                                  // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmbientAudioDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmbientAudioDataAsset")
	}
	static class UAmbientAudioDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientAudioDataAsset>();
	}
};
DUMPER7_ASSERTS_UAmbientAudioDataAsset;

// Class AmbientAudio.AmbientAudioStatics
// 0x0000 (0x0028 - 0x0028)
class UAmbientAudioStatics final : public UBlueprintFunctionLibrary
{
public:
	static void AddAmbientEntry(class UObject* WorldContextObject, class FName AmbientName, class UAmbientAudioDataAsset* Asset, int32 Priority, float CrossfadeTime);
	static void AddAmbientGameplayTag(class UObject* WorldContextObject, const struct FGameplayTag& GameplayTag);
	static class UAudioComponent* CreateAudioComponent(class UObject* WorldContextObject, class USoundBase* Sound);
	static void PlaySoundAtLocation(class UObject* WorldContextObject, class USoundBase* Sound, const struct FVector& Location);
	static void RemoveAmbientEntry(class UObject* WorldContextObject, class FName AmbientName);
	static void RemoveAmbientGameplayTag(class UObject* WorldContextObject, const struct FGameplayTag& GameplayTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmbientAudioStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmbientAudioStatics")
	}
	static class UAmbientAudioStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientAudioStatics>();
	}
};
DUMPER7_ASSERTS_UAmbientAudioStatics;

// Class AmbientAudio.AmbientAudioSubsystem
// 0x01F0 (0x0220 - 0x0030)
class UAmbientAudioSubsystem final : public UWorldSubsystem
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayTag& GameplayTag, EAmbientAudioTagActionType ActionType)> OnTagChanged; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class FName AmbientName, EAmbientAudioEntryActionType ActionType)> OnEntryChanged; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class AAmbientVolume*>                 GlobalVolumes;                                     // 0x0050(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x1C0];                                     // 0x0060(0x01C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAmbientEntry(class FName AmbientName, class UAmbientAudioDataAsset* Asset, int32 Priority, float CrossfadeTime);
	void AddGameplayTag(const struct FGameplayTag& GameplayTag);
	void RemoveAmbientEntry(class FName AmbientName);
	void RemoveGameplayTag(const struct FGameplayTag& GameplayTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmbientAudioSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmbientAudioSubsystem")
	}
	static class UAmbientAudioSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientAudioSubsystem>();
	}
};
DUMPER7_ASSERTS_UAmbientAudioSubsystem;

// Class AmbientAudio.AmbientVolume
// 0x0018 (0x0270 - 0x0258)
class AAmbientVolume final : public AVolume
{
public:
	class UAmbientAudioDataAsset*                 AmbientAsset;                                      // 0x0258(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Priority;                                          // 0x0260(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CrossfadeTime;                                     // 0x0264(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bEnabled : 1;                                      // 0x0268(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bGlobal : 1;                                       // 0x0268(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_bEnabled();
	void SetAmbientAsset(class UAmbientAudioDataAsset* NewAmbientAsset);
	void SetCrossfadeTime(float NewCrossfadeTime);
	void SetEnabled(bool bNewEnabled);
	void SetPriority(int32 NewPriority);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmbientVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmbientVolume")
	}
	static class AAmbientVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAmbientVolume>();
	}
};
DUMPER7_ASSERTS_AAmbientVolume;

SDK_NAMESPACE_END
