#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AOE_Commando_KeepOutExplosion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.ExecuteUbergraph_AOE_Commando_KeepOutExplosion
// 0x0008 (0x0008 - 0x0000)
struct AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Radius;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AOE_Commando_KeepOutExplosion_C_ExecuteUbergraph_AOE_Commando_KeepOutExplosion;

// Function AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.Send_Info
// 0x0004 (0x0004 - 0x0000)
struct AOE_Commando_KeepOutExplosion_C_Send_Info final
{
public:
	float                                         Radius_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AOE_Commando_KeepOutExplosion_C_Send_Info;

// Function AOE_Commando_KeepOutExplosion.AOE_Commando_KeepOutExplosion_C.OnRep_Radius
// 0x05E0 (0x05E0 - 0x0000)
struct AOE_Commando_KeepOutExplosion_C_OnRep_Radius final
{
public:
	struct FSoundAttenuationSettings              CallFunc_BP_GetAttenuationSettingsToApply_OutAttenuationSettings; // 0x0000(0x02E8)()
	bool                                          CallFunc_BP_GetAttenuationSettingsToApply_ReturnValue; // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoundAttenuationSettings              K2Node_MakeStruct_SoundAttenuationSettings;        // 0x02F8(0x02E8)()
};
DUMPER7_ASSERTS_AOE_Commando_KeepOutExplosion_C_OnRep_Radius;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
