#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArenaPersonalView

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ArenaPersonalView.ArenaPersonalView_C.ExecuteUbergraph_ArenaPersonalView
// 0x01C0 (0x01C0 - 0x0000)
struct ArenaPersonalView_C_ExecuteUbergraph_ArenaPersonalView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTournamentDisplayInfo             K2Node_CustomEvent_Color_Info;                     // 0x0008(0x01A8)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ArenaPersonalView_C_ExecuteUbergraph_ArenaPersonalView;

// Function ArenaPersonalView.ArenaPersonalView_C.Colorize
// 0x01A8 (0x01A8 - 0x0000)
struct ArenaPersonalView_C_Colorize final
{
public:
	struct FFortTournamentDisplayInfo             Color_Info;                                        // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_ArenaPersonalView_C_Colorize;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
