#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArgonRuntime

#include "Basic.hpp"

#include "ArgonRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ArgonRuntime.FortAthenaMutator_Argon.GetProgressBarUIInfo
// 0x0030 (0x0030 - 0x0000)
struct FortAthenaMutator_Argon_GetProgressBarUIInfo final
{
public:
	float                                         OutMyPercent;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 OutSquadmatePcts;                                  // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         OutNumSquadTickets;                                // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FArgonTeamProgressBarInfo>      OutEnemyProgressInfos;                             // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_GetProgressBarUIInfo;

// Function ArgonRuntime.FortAthenaMutator_Argon.HandlePlayerTeleportComplete
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Argon_HandlePlayerTeleportComplete final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_HandlePlayerTeleportComplete;

// Function ArgonRuntime.FortAthenaMutator_Argon.OnEndTraversePointTouched
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Argon_OnEndTraversePointTouched final
{
public:
	class AAthenaTraversePoint*                   PointActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 TouchingPlayer;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_OnEndTraversePointTouched;

// Function ArgonRuntime.FortAthenaMutator_Argon.DidPlayerCrossFinishLine
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Argon_DidPlayerCrossFinishLine final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_DidPlayerCrossFinishLine;

// Function ArgonRuntime.FortAthenaMutator_Argon.GetEndTraversePoint
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Argon_GetEndTraversePoint final
{
public:
	class AArgonTraversePoint*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_GetEndTraversePoint;

// Function ArgonRuntime.FortAthenaMutator_Argon.GetNumberOfTicketsNeededToFinishRace
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Argon_GetNumberOfTicketsNeededToFinishRace final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_GetNumberOfTicketsNeededToFinishRace;

// Function ArgonRuntime.FortAthenaMutator_Argon.GetNumberOfTicketsTeamHasAcquired
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Argon_GetNumberOfTicketsTeamHasAcquired final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_GetNumberOfTicketsTeamHasAcquired;

// Function ArgonRuntime.FortAthenaMutator_Argon.GetPlayerTeamPlacement
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Argon_GetPlayerTeamPlacement final
{
public:
	class AFortPlayerStateAthena*                 Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_GetPlayerTeamPlacement;

// Function ArgonRuntime.FortAthenaMutator_Argon.GetRaceTimeElapsed
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Argon_GetRaceTimeElapsed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_GetRaceTimeElapsed;

// Function ArgonRuntime.FortAthenaMutator_Argon.GetRandomStartingLineEmotePlayRate
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMutator_Argon_GetRandomStartingLineEmotePlayRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_GetRandomStartingLineEmotePlayRate;

// Function ArgonRuntime.FortAthenaMutator_Argon.GetTicketItemDefinition
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaMutator_Argon_GetTicketItemDefinition final
{
public:
	class UFortWorldItemDefinition*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_GetTicketItemDefinition;

// Function ArgonRuntime.FortAthenaMutator_Argon.HasPlayerFinishedRace
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_Argon_HasPlayerFinishedRace final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_HasPlayerFinishedRace;

// Function ArgonRuntime.FortAthenaMutator_Argon.HasTeamFinishedRace
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMutator_Argon_HasTeamFinishedRace final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_HasTeamFinishedRace;

// Function ArgonRuntime.FortAthenaMutator_Argon.IsUsingRespawnAndSpectateSelectMutator
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_Argon_IsUsingRespawnAndSpectateSelectMutator final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_Argon_IsUsingRespawnAndSpectateSelectMutator;

// Function ArgonRuntime.ArgonPlayerComponent.OnRacePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct ArgonPlayerComponent_OnRacePhaseChanged final
{
public:
	EArgonRacePhase                               NewRacePhase;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArgonPlayerComponent_OnRacePhaseChanged;

// Function ArgonRuntime.ArgonTicketComponent.IsNearToPlayer
// 0x0001 (0x0001 - 0x0000)
struct ArgonTicketComponent_IsNearToPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArgonTicketComponent_IsNearToPlayer;

// Function ArgonRuntime.ArgonTraversePoint.ClientSpawnMarkerActor
// 0x0030 (0x0030 - 0x0000)
struct ArgonTraversePoint_ClientSpawnMarkerActor final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArgonTraversePoint_ClientSpawnMarkerActor;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
