#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArgonRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "SlateCore_structs.hpp"
#include "ArgonRuntime_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Class ArgonRuntime.FortAthenaMutator_Argon
// 0x0E78 (0x11F8 - 0x0380)
class AFortAthenaMutator_Argon final : public AFortAthenaMutator_GameModeBase
{
public:
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinInitialVehicleFuelPercent;                      // 0x0388(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxInitialVehicleFuelPercent;                      // 0x03A8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FArgonFinishedPlayerInfo& FinishedPlayerInfo)> OnArgonPlayerFinished; // 0x03C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AFortPlayerStateAthena* PlayerState, int32 NumTicketsAcquired)> OnArgonPlayerReachedEndWithoutEnoughTickets; // 0x03D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EArgonRacePhase NewRacePhase)> OnArgonRacePhaseChanged;            // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AArgonTraversePoint* EndTraversePoint)> OnArgonEndTraversePointSet; // 0x03F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(uint8 Team, class AFortPlayerStateAthena* PickedUpByPlayer, int32 NewTicketCount, bool bHasAllTickets)> OnTeamTicketCountChanged; // 0x0408(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_418[0x18];                                     // 0x0418(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(uint8 NumSupplyDropClustersSpawned)> OnSupplyDropClusterSpawned;   // 0x0430(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_440[0x20];                                     // 0x0440(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FArgonRoute>                    Routes;                                            // 0x0460(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortSquadStartSearchParamData         StartPOISquadStartSearchParam;                     // 0x0470(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bUseOverridingSpawnTransforms;                     // 0x0510(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FTransform>                     OverridingSpawnTransforms;                         // 0x0530(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   TeleportingPlayersText;                            // 0x0540(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PreCountdownTextDuration;                          // 0x0558(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FArgonVehicleOption>            VehicleOptionsList;                                // 0x0578(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EndRaceAfterNumFinishers;                          // 0x0588(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            EndLocationCompassBrush;                           // 0x05A8(0x0088)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            EndLocationLockedCompassBrush;                     // 0x0630(0x0088)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         EndLocationCompassBrush_YOffset;                   // 0x06B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndLocationCompassBrush_MinScale;                  // 0x06BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndLocationCompassBrush_MaxScale;                  // 0x06C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndLocationCompassBrush_DistanceForMinScale;       // 0x06C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EndLocationCompassBrush_DistanceForMaxScale;       // 0x06C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            EndLocationMapBrush;                               // 0x06D0(0x0088)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            EndLocationLockedMapBrush;                         // 0x0758(0x0088)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              EndLocationMapBrushScale;                          // 0x07E0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           RacePositionStatGameplayTag;                       // 0x07E8(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortWorldItemDefinition*               TicketItemDefinition;                              // 0x07F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumTicketsNeededToCompleteRace;                    // 0x07F8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         NumEnemiesTrackedOnProgressBarUI;                  // 0x0818(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumSquadmatesTrackedOnProgressBarUI;               // 0x081C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EntireSquadDeadRespawnViewPitch;                   // 0x0820(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         EntireSquadDeadRespawnTime;                        // 0x0840(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     EntireSquadDeadRespawnActorClass;                  // 0x0860(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnOffsetDistance;                             // 0x0868(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinRespawnHeightAboveGround;                       // 0x0888(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FArgonSupplyDropPointData              SupplyDropPointData;                               // 0x08A8(0x0228)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAreDropsAlwaysTriggeredByFirstPlacePlayer;        // 0x0AD0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCurveFloat*                            SupplyDropPercentCurve;                            // 0x0AF0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxConsecutiveDropsOnSameSideOfPath;               // 0x0AF8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinPathDropOffset;                                 // 0x0B18(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxPathDropOffset;                                 // 0x0B38(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinDropTriggerSpacing;                             // 0x0B58(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxDropTriggerSpacing;                             // 0x0B78(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinDropDistFromRaceEnd;                            // 0x0B98(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FirstDropTriggerDist;                              // 0x0BB8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumRepopulationsPerRacePathDrop;                   // 0x0BD8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DelayBeforeRepopulatingRacePathDrops;              // 0x0BF8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumDropsAroundEnd;                                 // 0x0C18(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DelayBetweenEndPointDrops;                         // 0x0C38(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinEndDropRadius;                                  // 0x0C58(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxEndDropRadius;                                  // 0x0C78(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumRepopulationsPerEndPointDrop;                   // 0x0C98(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DelayBeforeRepopulatingEndPointDrops;              // 0x0CB8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                StartingPoint;                                     // 0x0CD8(0x000C)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CE4[0x2C];                                     // 0x0CE4(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMontageItemDefinitionBase*         StartingLineEmote;                                 // 0x0D10(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxStartingLineEmoteDelay;                         // 0x0D18(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinStartingLineEmotePlayRate;                      // 0x0D38(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxStartingLineEmotePlayRate;                      // 0x0D58(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bPlayStartingLineEmoteBeforeCountdown;             // 0x0D78(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UFortMontageItemDefinitionBase*         FinishedRaceEmote;                                 // 0x0D98(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         FinishedRaceEmoteTime;                             // 0x0DA0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UNiagaraSystem*                         SquadmateVictoryVFXTemplate;                       // 0x0DC0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                        FinishedPlayerDespawnVFXTemplate;                  // 0x0DC8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxFloorCheckDist;                                 // 0x0DD0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumNearbyTicketsToShowOnCompass;                   // 0x0DF0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumNearbyTicketsToShowInWorld;                     // 0x0E10(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            TicketCompassBrush;                                // 0x0E30(0x0088)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         TicketCompassBrush_YOffset;                        // 0x0EB8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TicketCompassBrush_Scale;                          // 0x0EBC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         SortClientTicketComponentsTime;                    // 0x0EC0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            AcquiredAllTicketsMapBrush;                        // 0x0EE0(0x0088)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  TicketSpecialActorCategories;                      // 0x0F68(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class FName>                AnalyticsAttributeNameToStatNameMap;               // 0x0F88(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortGameplayAbility_JumpBoostPack> JumpBoostPackAbilityClass;                 // 0x0FD8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FArgonRaceStateInfo                    CurrentRaceState;                                  // 0x0FE0(0x0018)(Net, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FF8[0x28];                                     // 0x0FF8(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortSquadStart*>                SquadStarts;                                       // 0x1020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FArgonPlayerInfo>               RacingPlayersByPlace;                              // 0x1030(0x0010)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FArgonTeamProgressBarInfo>      LeaderProgressInfos;                               // 0x1040(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FArgonTeamTicketCount>          TeamTicketCounts;                                  // 0x1050(0x0010)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1060[0x10];                                    // 0x1060(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthenaHoldingArea*                     SquadStartHoldingArea;                             // 0x1070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AArgonTraversePoint*                    EndTraversePoint;                                  // 0x1078(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_SynchronizedTeleport* TeleportMutator;                                  // 0x1080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_GameStartCountdown*  GameStartCountdownMutator;                         // 0x1088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_RespawnAndSpectateSelect* RespawnAndSpectateSelectMutator;              // 0x1090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<uint8, class AActor*>                    EntireSquadDeadRespawnActors;                      // 0x1098(0x0050)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_10E8[0x11];                                    // 0x10E8(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         NumSupplyDropClustersSpawned;                      // 0x10F9(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10FA[0x2];                                     // 0x10FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RaceStartTime;                                     // 0x10FC(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AFortPlayerPawn>> FinishedPlayerPawns;                               // 0x1100(0x0010)(Net, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1110[0xE8];                                    // 0x1110(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetProgressBarUIInfo(float* OutMyPercent, TArray<float>* OutSquadmatePcts, uint8* OutNumSquadTickets, TArray<struct FArgonTeamProgressBarInfo>* OutEnemyProgressInfos);
	void HandleGameStartCountdownEnd();
	void HandleGroupTeleportComplete();
	void HandlePlayerTeleportComplete(class AFortPlayerStateAthena* PlayerState);
	void OnEndTraversePointTouched(class AAthenaTraversePoint* PointActor, class AFortPlayerStateAthena* TouchingPlayer);
	void OnRep_CurrentRaceState();
	void OnRep_EndTraversePoint();
	void OnRep_NumSupplyDropClustersSpawned();
	void OnRep_RacingPlayersByPlace();
	void OnRep_TeamTicketCounts();
	void SortClientTicketComponents();

	bool DidPlayerCrossFinishLine(const class AFortPlayerStateAthena* PlayerState) const;
	class AArgonTraversePoint* GetEndTraversePoint() const;
	int32 GetNumberOfTicketsNeededToFinishRace() const;
	int32 GetNumberOfTicketsTeamHasAcquired(uint8 Team) const;
	int32 GetPlayerTeamPlacement(class AFortPlayerStateAthena* Player) const;
	float GetRaceTimeElapsed() const;
	float GetRandomStartingLineEmotePlayRate() const;
	class UFortWorldItemDefinition* GetTicketItemDefinition() const;
	bool HasPlayerFinishedRace(const class AFortPlayerStateAthena* PlayerState) const;
	bool HasTeamFinishedRace(uint8 Team) const;
	bool IsUsingRespawnAndSpectateSelectMutator() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaMutator_Argon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaMutator_Argon")
	}
	static class AFortAthenaMutator_Argon* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Argon>();
	}
};
DUMPER7_ASSERTS_AFortAthenaMutator_Argon;

// Class ArgonRuntime.ArgonPlayerComponent
// 0x0018 (0x00C8 - 0x00B0)
class UArgonPlayerComponent final : public UFortControllerComponent
{
public:
	float                                         EntireSquadDiedServerTimeForRespawn;               // 0x00B0(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotatePawnToCamera;                               // 0x00B4(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMontageItemDefinitionBase*         CachedFinishedRaceEmote;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_Argon*               ArgonMutator;                                      // 0x00C0(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnRacePhaseChanged(EArgonRacePhase NewRacePhase);
	void OnRep_ArgonMutator();
	void OnRep_EntireSquadDiedServerTimeForRespawn();
	void OnRep_RotatePawnToCamera();
	void PlayFinishedRaceEmote();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArgonPlayerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArgonPlayerComponent")
	}
	static class UArgonPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArgonPlayerComponent>();
	}
};
DUMPER7_ASSERTS_UArgonPlayerComponent;

// Class ArgonRuntime.ArgonStartingPlatform
// 0x0028 (0x0248 - 0x0220)
class AArgonStartingPlatform final : public AActor
{
public:
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0220(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                          bIsEnabled;                                        // 0x0240(0x0001)(Edit, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_IsEnabled();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArgonStartingPlatform")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArgonStartingPlatform")
	}
	static class AArgonStartingPlatform* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArgonStartingPlatform>();
	}
};
DUMPER7_ASSERTS_AArgonStartingPlatform;

// Class ArgonRuntime.FortCheatManager_Argon
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_Argon final : public UFortCheatManager_Coupled
{
public:
	void ArgonTeleportToEndPoint();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCheatManager_Argon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCheatManager_Argon")
	}
	static class UFortCheatManager_Argon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Argon>();
	}
};
DUMPER7_ASSERTS_UFortCheatManager_Argon;

// Class ArgonRuntime.ArgonTicketComponent
// 0x0020 (0x00D0 - 0x00B0)
class UArgonTicketComponent final : public UActorComponent
{
public:
	class AFortAthenaMutator_Argon*               ArgonMutator;                                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsNearToPlayer)> OnIsNearToPlayerChanged;                    // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsNearToPlayer() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArgonTicketComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArgonTicketComponent")
	}
	static class UArgonTicketComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UArgonTicketComponent>();
	}
};
DUMPER7_ASSERTS_UArgonTicketComponent;

// Class ArgonRuntime.ArgonTraversePoint
// 0x0010 (0x0930 - 0x0920)
class AArgonTraversePoint final : public AAthenaLTMTraversePoint
{
public:
	class AFortPlayerMarkerBase*                  MarkerActor;                                       // 0x0920(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AFortPlayerMarkerBase>      MarkerClass;                                       // 0x0928(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ClientSpawnMarkerActor(const struct FTransform& Transform);
	void OnNewState_Active_Server_BP();
	void OnNewState_Hidden_Server_BP();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArgonTraversePoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArgonTraversePoint")
	}
	static class AArgonTraversePoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArgonTraversePoint>();
	}
};
DUMPER7_ASSERTS_AArgonTraversePoint;

// Class ArgonRuntime.ArgonVehicleSpawner
// 0x0018 (0x0238 - 0x0220)
class AArgonVehicleSpawner final : public AActor
{
public:
	TArray<struct FPrimaryAssetId>                OverrideVehicleAssetIds;                           // 0x0220(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpawnActorCollisionHandlingMethod            SpawnVehicleCollisionHandlingMethod;               // 0x0230(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ArgonVehicleSpawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ArgonVehicleSpawner")
	}
	static class AArgonVehicleSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AArgonVehicleSpawner>();
	}
};
DUMPER7_ASSERTS_AArgonVehicleSpawner;

SDK_NAMESPACE_END
