#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArgonUI

#include "Basic.hpp"

#include "ArgonRuntime_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ArgonUI.ArgonWidgetBase.GetTeamPlayerStates
// 0x0018 (0x0018 - 0x0000)
struct ArgonWidgetBase_GetTeamPlayerStates final
{
public:
	uint8                                         Team;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerStateAthena*>         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArgonWidgetBase_GetTeamPlayerStates;

// Function ArgonUI.ArgonWidgetBase.SetPlayerPortrait
// 0x0010 (0x0010 - 0x0000)
struct ArgonWidgetBase_SetPlayerPortrait final
{
public:
	class AFortPlayerStateAthena*                 Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortLazyImage*                         PortraitImage;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArgonWidgetBase_SetPlayerPortrait;

// Function ArgonUI.ArgonHUDAlertWidget.DisplayPlayerFinishedMessage
// 0x0060 (0x0060 - 0x0000)
struct ArgonHUDAlertWidget_DisplayPlayerFinishedMessage final
{
public:
	struct FArgonFinishedPlayerInfo               FinishedInfo;                                      // 0x0000(0x0060)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArgonHUDAlertWidget_DisplayPlayerFinishedMessage;

// Function ArgonUI.ArgonHUDAlertWidget.OnPlayerFinished
// 0x0060 (0x0060 - 0x0000)
struct ArgonHUDAlertWidget_OnPlayerFinished final
{
public:
	struct FArgonFinishedPlayerInfo               FinishedPlayerInfo;                                // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArgonHUDAlertWidget_OnPlayerFinished;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
