#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicCoreRuntime

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum ArsenicCoreRuntime.EArsenicCorePlayerStatus
// NumValues: 0x0006
enum class EArsenicCorePlayerStatus : uint8
{
	None                                     = 0,
	Human                                    = 1,
	Transforming_HumanToGhost                = 2,
	Ghost                                    = 3,
	EliminatedGhost                          = 4,
	MAX                                      = 5,
};

// Enum ArsenicCoreRuntime.EConsumePickupsDropOnDeathFilterRule_Definitive
// NumValues: 0x0003
enum class EConsumePickupsDropOnDeathFilterRule_Definitive : uint8
{
	DiscardNewestItem                        = 0,
	DiscardOldestItem                        = 1,
	EConsumePickupsDropOnDeathFilterRule_MAX = 2,
};

// Enum ArsenicCoreRuntime.EConsumePickupsDropOnDeathFilterRule
// NumValues: 0x0003
enum class EConsumePickupsDropOnDeathFilterRule : uint8
{
	DiscardLowestRarityItem                  = 0,
	DiscardHighestRarityItem                 = 1,
	EConsumePickupsDropOnDeathFilterRule_MAX = 2,
};

// ScriptStruct ArsenicCoreRuntime.ArsenicCoreSquadMemberPlayerStatus
// 0x0010 (0x0010 - 0x0000)
struct FArsenicCoreSquadMemberPlayerStatus final
{
public:
	class AFortPlayerStateAthena*                 SquadMemberPlayerState;                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      SquadMemberPlayerStatus;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FArsenicCoreSquadMemberPlayerStatus;

// ScriptStruct ArsenicCoreRuntime.ArsenicCorePopulationGridCellData
// 0x0004 (0x0004 - 0x0000)
struct FArsenicCorePopulationGridCellData final
{
public:
	uint8                                         NumGhostPlayers;                                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumGhostBots;                                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumHumanPlayers;                                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NumHumanBots;                                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArsenicCorePopulationGridCellData;

// ScriptStruct ArsenicCoreRuntime.ArsenicCoreHumanPawnData
// 0x0010 (0x0010 - 0x0000)
struct FArsenicCoreHumanPawnData final
{
public:
	class AFortPlayerPawnAthena*                  Pawn;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArsenicCoreHumanPawnData;

SDK_NAMESPACE_END
