#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicRuntime

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ArsenicRuntime_structs.hpp"


SDK_NAMESPACE_START

// Class ArsenicRuntime.FortCheatManager_Arsenic
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_Arsenic final : public UFortCheatManager_Coupled
{
public:
	void SetInfectedDamageToBuildingPercent(float DamagePercent);
	void SetInfectedDamageToStructuralBuildingPercent(float DamagePercent);
	void SetMatchTime(float NewTime);
	void ToggleDBNOEnabled();
	void ToggleGrowlEnabled();
	void ToggleHealOverTimeEnabled();
	void ToggleHeartbeatEnabled();
	void ToggleInfectedModifiedDamageEnabled();
	void ToggleWinConditionEnabled();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCheatManager_Arsenic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCheatManager_Arsenic")
	}
	static class UFortCheatManager_Arsenic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Arsenic>();
	}
};
DUMPER7_ASSERTS_UFortCheatManager_Arsenic;

// Class ArsenicRuntime.FortAthenaMutator_Arsenic
// 0x0400 (0x0780 - 0x0380)
class AFortAthenaMutator_Arsenic final : public AFortAthenaMutator_GameModeBase
{
public:
	uint8                                         Pad_380[0x8];                                      // 0x0380(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AFortPlayerStateAthena* PlayerState)> OnPlayerTeamRevealedDelegate; // 0x0388(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScalableFloat                         InitialInfectedPct;                                // 0x0398(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InfectedDamageToBuildingPercent;                   // 0x03B8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         InfectedDamageToStructuralBuildingPercent;         // 0x03D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FString                                 Winner;                                            // 0x03F8(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGameTimeExpired;                                  // 0x0408(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             HumanDeathSound;                                   // 0x0410(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EArsenicGameMsgId, struct FAthenaGameMessageData> GameMsgs_Infected;                        // 0x0418(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<EArsenicGameMsgId, struct FAthenaGameMessageData> GameMsgs_Human;                           // 0x0468(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinInitialVehicleFuelPercent;                      // 0x04C0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MaxInitialVehicleFuelPercent;                      // 0x04E0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         HumanTeam;                                         // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         InfectedTeam;                                      // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_502[0x6];                                      // 0x0502(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTagTeamInfoArray                      TagTeamInfo;                                       // 0x0508(0x0118)(Net, Transient, NativeAccessSpecifierPrivate)
	struct FArsenicPlayerDataArray                PlayerDataArray;                                   // 0x0620(0x0120)(Net, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_740[0x8];                                      // 0x0740(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bInfectedConsumePickups;                           // 0x0748(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortAthenaMutator_ConsumePickups*      ConsumePickupsMutator;                             // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortAthenaMutator_ArsenicInventoryOverride* CachedInventoryOverrideMutator;               // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_778[0x1];                                      // 0x0778(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCheatHeartbeatEnabled;                            // 0x0779(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_77A[0x6];                                      // 0x077A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EndGame(uint8 WinningTeam);
	int32 GetTeamPlayerCount(uint8 Team);
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContainerTags);
	void RefreshPlayerIndicators(class AFortPlayerStateAthena* PlayerState);

	float GetTimeRemaining() const;
	class FString GetWinner() const;
	bool IsGrowlEnabled() const;
	bool IsHealOverTimeEnabled() const;
	bool IsHeartbeatEnabled() const;
	bool IsPawnAnInfected(const class AFortPawn* Pawn) const;
	bool IsPlayerARevealedInfected(const class AFortPlayerController* PC) const;
	bool IsPlayerTeamRevealed(const class AFortPlayerStateAthena* PlayerState) const;
	bool IsPlaylistDBNOEnabled() const;
	void RequestGameMessageOnClient(EArsenicGameMsgId MsgId) const;
	void RequestGameMessageOnServer(EArsenicGameMsgId MsgId) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaMutator_Arsenic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaMutator_Arsenic")
	}
	static class AFortAthenaMutator_Arsenic* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Arsenic>();
	}
};
DUMPER7_ASSERTS_AFortAthenaMutator_Arsenic;

// Class ArsenicRuntime.FortAthenaMutator_ArsenicRespawn
// 0x0190 (0x0400 - 0x0270)
class AFortAthenaMutator_ArsenicRespawn final : public AFortAthenaMutator
{
public:
	bool                                          bRespawnAwayFromDeathLocation;                     // 0x0270(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDistanceFromDeath;                          // 0x0274(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaximumDistanceFromDeath;                          // 0x0278(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRespawnLogicData_Teams            RespawnSettings;                                   // 0x0280(0x0180)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaMutator_ArsenicRespawn")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaMutator_ArsenicRespawn")
	}
	static class AFortAthenaMutator_ArsenicRespawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_ArsenicRespawn>();
	}
};
DUMPER7_ASSERTS_AFortAthenaMutator_ArsenicRespawn;

// Class ArsenicRuntime.FortChargingSet_Arsenic_Hurl
// 0x00A0 (0x00E8 - 0x0048)
class UFortChargingSet_Arsenic_Hurl final : public UFortChargingSet_Base
{
public:
	struct FFortGameplayAttributeData             CurrentCharge;                                     // 0x0048(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             MaxCharge;                                         // 0x0070(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ChargeTime;                                        // 0x0098(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ServerTimeChargeIncrements;                        // 0x00C0(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_CurrentCharge(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortChargingSet_Arsenic_Hurl")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortChargingSet_Arsenic_Hurl")
	}
	static class UFortChargingSet_Arsenic_Hurl* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortChargingSet_Arsenic_Hurl>();
	}
};
DUMPER7_ASSERTS_UFortChargingSet_Arsenic_Hurl;

// Class ArsenicRuntime.FortChargingSet_Arsenic_Scream
// 0x00A0 (0x00E8 - 0x0048)
class UFortChargingSet_Arsenic_Scream final : public UFortChargingSet_Base
{
public:
	struct FFortGameplayAttributeData             CurrentCharge;                                     // 0x0048(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             MaxCharge;                                         // 0x0070(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ChargeTime;                                        // 0x0098(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ServerTimeChargeIncrements;                        // 0x00C0(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_CurrentCharge(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortChargingSet_Arsenic_Scream")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortChargingSet_Arsenic_Scream")
	}
	static class UFortChargingSet_Arsenic_Scream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortChargingSet_Arsenic_Scream>();
	}
};
DUMPER7_ASSERTS_UFortChargingSet_Arsenic_Scream;

// Class ArsenicRuntime.FortChargingSet_Arsenic_Sniff
// 0x00A0 (0x00E8 - 0x0048)
class UFortChargingSet_Arsenic_Sniff final : public UFortChargingSet_Base
{
public:
	struct FFortGameplayAttributeData             CurrentCharge;                                     // 0x0048(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             MaxCharge;                                         // 0x0070(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ChargeTime;                                        // 0x0098(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)
	struct FFortGameplayAttributeData             ServerTimeChargeIncrements;                        // 0x00C0(0x0028)(BlueprintVisible, BlueprintReadOnly, Net, Protected, NativeAccessSpecifierProtected)

public:
	void OnRep_CurrentCharge(const struct FFortGameplayAttributeData& OldValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortChargingSet_Arsenic_Sniff")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortChargingSet_Arsenic_Sniff")
	}
	static class UFortChargingSet_Arsenic_Sniff* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortChargingSet_Arsenic_Sniff>();
	}
};
DUMPER7_ASSERTS_UFortChargingSet_Arsenic_Sniff;

SDK_NAMESPACE_END
