#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// Enum ArsenicRuntime.EArsenicGameMsgId
// NumValues: 0x0005
enum class EArsenicGameMsgId : uint8
{
	None                                     = 0,
	InitialTeamRevealed                      = 1,
	BecameInfected                           = 2,
	OneHumanRemaining                        = 3,
	EArsenicGameMsgId_MAX                    = 4,
};

// ScriptStruct ArsenicRuntime.ArsenicPlayerDataEntry
// 0x0014 (0x0020 - 0x000C)
struct FArsenicPlayerDataEntry final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasRevealedTeam;                                  // 0x0018(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FArsenicPlayerDataEntry;

// ScriptStruct ArsenicRuntime.ArsenicPlayerDataArray
// 0x0018 (0x0120 - 0x0108)
struct FArsenicPlayerDataArray final : public FFastArraySerializer
{
public:
	TArray<struct FArsenicPlayerDataEntry>        Entries;                                           // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FArsenicPlayerDataArray;

SDK_NAMESPACE_END
