#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicCoreUI

#include "Basic.hpp"

#include "ArsenicCoreRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ArsenicCoreUI.ArsenicCoreActivatablePanelBase.OnPlayerStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ArsenicCoreActivatablePanelBase_OnPlayerStatusChanged;

// Function ArsenicCoreUI.ArsenicCoreWidgetBase.OnLocalGhostPlayerEnteredOrExitedVehicle
// 0x0001 (0x0001 - 0x0000)
struct ArsenicCoreWidgetBase_OnLocalGhostPlayerEnteredOrExitedVehicle final
{
public:
	bool                                          bIsInVehicle;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreWidgetBase_OnLocalGhostPlayerEnteredOrExitedVehicle;

// Function ArsenicCoreUI.ArsenicCoreWidgetBase.OnLocalPlayerGhostVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct ArsenicCoreWidgetBase_OnLocalPlayerGhostVisibilityChanged final
{
public:
	bool                                          bIsVisibile;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreWidgetBase_OnLocalPlayerGhostVisibilityChanged;

// Function ArsenicCoreUI.ArsenicCoreWidgetBase.OnPlayerStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCoreWidgetBase_OnPlayerStatusChanged final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ArsenicCoreWidgetBase_OnPlayerStatusChanged;

// Function ArsenicCoreUI.ArsenicCoreHUD.HandleGhostVisibilityChange_BP
// 0x0001 (0x0001 - 0x0000)
struct ArsenicCoreHUD_HandleGhostVisibilityChange_BP final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreHUD_HandleGhostVisibilityChange_BP;

// Function ArsenicCoreUI.ArsenicCoreHumansAndGhostsLeftBase.SetGhostsLeftText
// 0x0018 (0x0018 - 0x0000)
struct ArsenicCoreHumansAndGhostsLeftBase_SetGhostsLeftText final
{
public:
	class FText                                   GhostsText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreHumansAndGhostsLeftBase_SetGhostsLeftText;

// Function ArsenicCoreUI.ArsenicCoreHumansAndGhostsLeftBase.SetHumansLeftText
// 0x0018 (0x0018 - 0x0000)
struct ArsenicCoreHumansAndGhostsLeftBase_SetHumansLeftText final
{
public:
	class FText                                   HumansText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreHumansAndGhostsLeftBase_SetHumansLeftText;

// Function ArsenicCoreUI.ArsenicCoreInventoryReplacementScreen.OnOwningPlayerStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct ArsenicCoreInventoryReplacementScreen_OnOwningPlayerStatusChanged final
{
public:
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreInventoryReplacementScreen_OnOwningPlayerStatusChanged;

// Function ArsenicCoreUI.ArsenicCoreKillerInfoScreen.OnLocalPlayerDiedAsHuman
// 0x0080 (0x0080 - 0x0000)
struct ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman final
{
public:
	const class AFortPlayerStateAthena*           VictimPlayerState;                                 // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortPlayerDeathReport                 DeathReport;                                       // 0x0008(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreKillerInfoScreen_OnLocalPlayerDiedAsHuman;

// Function ArsenicCoreUI.ArsenicCoreSquadMemberStatusTrackingWidget.OnSquadMemberPlayerStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ArsenicCoreSquadMemberStatusTrackingWidget_OnSquadMemberPlayerStatusChanged;

// Function ArsenicCoreUI.ArsenicCoreSquadMemberGameplayMessageWidget.OnSquadMemberPlayerStatusChanged_BP
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      NewStatus;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ArsenicCoreSquadMemberGameplayMessageWidget_OnSquadMemberPlayerStatusChanged_BP;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
