#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArsenicCoreRuntime

#include "Basic.hpp"

#include "ArsenicCoreRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ArsenicCoreRuntime.ArsenicCoreGCNGhostAudioHelperComponent.SetLoopingAudioComponent
// 0x0008 (0x0008 - 0x0000)
struct ArsenicCoreGCNGhostAudioHelperComponent_SetLoopingAudioComponent final
{
public:
	class UAudioComponent*                        InLoopingAudioComponent;                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreGCNGhostAudioHelperComponent_SetLoopingAudioComponent;

// Function ArsenicCoreRuntime.ArsenicCoreGCNGhostAudioHelperComponent.SetTargetPawn
// 0x0008 (0x0008 - 0x0000)
struct ArsenicCoreGCNGhostAudioHelperComponent_SetTargetPawn final
{
public:
	class APawn*                                  InTargetPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreGCNGhostAudioHelperComponent_SetTargetPawn;

// Function ArsenicCoreRuntime.ArsenicCorePlayerComponent.OnRep_SquadMemberPlayerStatuses
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCorePlayerComponent_OnRep_SquadMemberPlayerStatuses final
{
public:
	TArray<struct FArsenicCoreSquadMemberPlayerStatus> OldValue;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCorePlayerComponent_OnRep_SquadMemberPlayerStatuses;

// Function ArsenicCoreRuntime.ArsenicCorePlayerComponent.SetSquadMemberArsenicCorePlayerStatus
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCorePlayerComponent_SetSquadMemberArsenicCorePlayerStatus final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      NewPlayerStatus;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ArsenicCorePlayerComponent_SetSquadMemberArsenicCorePlayerStatus;

// Function ArsenicCoreRuntime.ArsenicCorePlayerComponent.UpdateGhostVisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct ArsenicCorePlayerComponent_UpdateGhostVisibilityChange final
{
public:
	bool                                          bIsVisibile;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCorePlayerComponent_UpdateGhostVisibilityChange;

// Function ArsenicCoreRuntime.ArsenicCorePopulationTracker.OnGameMemberRemoved
// 0x0010 (0x0010 - 0x0000)
struct ArsenicCorePopulationTracker_OnGameMemberRemoved final
{
public:
	uint8                                         InSquadId;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         InTeamIndex;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 ChangedPS;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCorePopulationTracker_OnGameMemberRemoved;

// Function ArsenicCoreRuntime.ArsenicCoreRespawnDrone.BeginGhostTransitionSequence
// 0x0020 (0x0020 - 0x0000)
struct ArsenicCoreRespawnDrone_BeginGhostTransitionSequence final
{
public:
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArsenicCorePlayerComponent*            ArsenicCorePlayerComponent;                        // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                RespawnLocation;                                   // 0x0010(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ArsenicCoreRespawnDrone_BeginGhostTransitionSequence;

// Function ArsenicCoreRuntime.ArsenicCoreRespawnDrone.GetCamera
// 0x0008 (0x0008 - 0x0000)
struct ArsenicCoreRespawnDrone_GetCamera final
{
public:
	class ACameraActor*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ArsenicCoreRespawnDrone_GetCamera;

// Function ArsenicCoreRuntime.FortCheatManager_ArsenicInterface.ArsenicCoreSetPopulationGridRedValue
// 0x0004 (0x0004 - 0x0000)
struct FortCheatManager_ArsenicInterface_ArsenicCoreSetPopulationGridRedValue final
{
public:
	int32                                         RedValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_ArsenicInterface_ArsenicCoreSetPopulationGridRedValue;

// Function ArsenicCoreRuntime.FortCheatManager_ArsenicInterface.ArsenicCoreSpawnScriptedPawn
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_ArsenicInterface_ArsenicCoreSpawnScriptedPawn final
{
public:
	class FString                                 ProfileName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_ArsenicInterface_ArsenicCoreSpawnScriptedPawn;

// Function ArsenicCoreRuntime.ArsenicGameModeMutatorInterface.BroadcastArsenicOnPlayerStatusChange
// 0x0010 (0x0010 - 0x0000)
struct ArsenicGameModeMutatorInterface_BroadcastArsenicOnPlayerStatusChange final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      PlayerStatus;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ArsenicGameModeMutatorInterface_BroadcastArsenicOnPlayerStatusChange;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.CreateGhostBotStimuliFromScream
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_ArsenicCore_CreateGhostBotStimuliFromScream final
{
public:
	class AFortPlayerPawnAthena*                  ScreamerPawn;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerPawnAthena*>          RevealedHumans;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_CreateGhostBotStimuliFromScream;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.GetGhostHumanRatioInRadius
// 0x0014 (0x0014 - 0x0000)
struct FortAthenaMutator_ArsenicCore_GetGhostHumanRatioInRadius final
{
public:
	struct FVector                                CenterLocation;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_GetGhostHumanRatioInRadius;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.GetPopulationAndGhostHumanRatioInRadius
// 0x0018 (0x0018 - 0x0000)
struct FortAthenaMutator_ArsenicCore_GetPopulationAndGhostHumanRatioInRadius final
{
public:
	struct FVector                                CenterLocation;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutPopulation;                                     // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutGhostHumanRatio;                                // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_GetPopulationAndGhostHumanRatioInRadius;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.GetPopulationInRadius
// 0x0014 (0x0014 - 0x0000)
struct FortAthenaMutator_ArsenicCore_GetPopulationInRadius final
{
public:
	struct FVector                                CenterLocation;                                    // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_GetPopulationInRadius;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.UpdateAnalyticsDataOnPawnDied
// 0x0050 (0x0050 - 0x0000)
struct FortAthenaMutator_ArsenicCore_UpdateAnalyticsDataOnPawnDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_UpdateAnalyticsDataOnPawnDied;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.GetEliminatedPlayersTeamId
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_ArsenicCore_GetEliminatedPlayersTeamId final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_GetEliminatedPlayersTeamId;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.GetGhostTeam
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMutator_ArsenicCore_GetGhostTeam final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_GetGhostTeam;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.HasTheGhostTeamWon
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_ArsenicCore_HasTheGhostTeamWon final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_HasTheGhostTeamWon;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.IsALivingTeam
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMutator_ArsenicCore_IsALivingTeam final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_IsALivingTeam;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.IsGhostTeam
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMutator_ArsenicCore_IsGhostTeam final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_IsGhostTeam;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicCore.IsGhostThatPermaDiedTeam
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMutator_ArsenicCore_IsGhostThatPermaDiedTeam final
{
public:
	uint8                                         TeamId;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicCore_IsGhostThatPermaDiedTeam;

// Function ArsenicCoreRuntime.FortAthenaMutator_ArsenicInventoryOverride.OnGamePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMutator_ArsenicInventoryOverride_OnGamePhaseChanged final
{
public:
	EAthenaGamePhase                              NewPhase;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaMutator_ArsenicInventoryOverride_OnGamePhaseChanged;

// Function ArsenicCoreRuntime.FortAthenaMutator_ConsumePickups_ArsenicCore.OnPlayerStatusChanged
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMutator_ConsumePickups_ArsenicCore_OnPlayerStatusChanged final
{
public:
	const class AFortPlayerStateAthena*           PlayerState;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EArsenicCorePlayerStatus                      PlayerStatus;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaMutator_ConsumePickups_ArsenicCore_OnPlayerStatusChanged;

// Function ArsenicCoreRuntime.FortChargingSet_ArsenicCore_Dash.OnRep_CurrentCharge
// 0x0028 (0x0028 - 0x0000)
struct FortChargingSet_ArsenicCore_Dash_OnRep_CurrentCharge final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortChargingSet_ArsenicCore_Dash_OnRep_CurrentCharge;

// Function ArsenicCoreRuntime.FortChargingSet_ArsenicCore_Scream.OnRep_CurrentCharge
// 0x0028 (0x0028 - 0x0000)
struct FortChargingSet_ArsenicCore_Scream_OnRep_CurrentCharge final
{
public:
	struct FFortGameplayAttributeData             OldValue;                                          // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortChargingSet_ArsenicCore_Scream_OnRep_CurrentCharge;

// Function ArsenicCoreRuntime.FortControllerComponent_ConsumePickups.GetPickupBeingConsumed
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_ConsumePickups_GetPickupBeingConsumed final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_ConsumePickups_GetPickupBeingConsumed;

// Function ArsenicCoreRuntime.FortControllerComponent_ConsumePickups.GetPickupThatWasLastConsumed
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_ConsumePickups_GetPickupThatWasLastConsumed final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_ConsumePickups_GetPickupThatWasLastConsumed;

// Function ArsenicCoreRuntime.FortControllerComponent_ConsumePickups.OnItemConsumed
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_ConsumePickups_OnItemConsumed final
{
public:
	const class UFortWorldItem*                   ConsumedItem;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_ConsumePickups_OnItemConsumed;

// Function ArsenicCoreRuntime.FortControllerComponent_ConsumePickups.OnPlayerInteractLongUseChanged
// 0x0002 (0x0002 - 0x0000)
struct FortControllerComponent_ConsumePickups_OnPlayerInteractLongUseChanged final
{
public:
	bool                                          bPlayerHasStartedALongUseInteraction;              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLongUseInteractionCompleted;                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_ConsumePickups_OnPlayerInteractLongUseChanged;

// Function ArsenicCoreRuntime.FortControllerComponent_ConsumePickups.ServerSetPickupBeingConsumed
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_ConsumePickups_ServerSetPickupBeingConsumed final
{
public:
	class AActor*                                 InPickupActorBeingConsumed;                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_ConsumePickups_ServerSetPickupBeingConsumed;

// Function ArsenicCoreRuntime.FortControllerComponent_ConsumePickups.SetPickupBeingConsumed
// 0x0008 (0x0008 - 0x0000)
struct FortControllerComponent_ConsumePickups_SetPickupBeingConsumed final
{
public:
	class AActor*                                 InPickupActorBeingConsumed;                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortControllerComponent_ConsumePickups_SetPickupBeingConsumed;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
