#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobbyPlayerPanelActions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C
// 0x02C0 (0x04F8 - 0x0238)
class UAthenaLobbyPlayerPanelActions_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           BoxActions;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonAddFriend;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonInviteParty;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonManage;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonMute;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ViewProfileButton;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      HoveredActionButton;                               // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnGadgetsClicked;                                  // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x0288(0x0200)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnEmoteClicked;                                    // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   AddFriendText;                                     // 0x0498(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptInviteText;                                  // 0x04B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SentInviteText;                                    // 0x04C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptedInviteText;                                // 0x04E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaLobbyPlayerPanelActions(int32 EntryPoint);
	void BndEvt__ButtonMute_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonInviteParty_K2Node_ComponentBoundEvent_121_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonAddFriend_K2Node_ComponentBoundEvent_103_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__ButtonManage_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnButtonHovered(class UCommonButton* Button);
	void Initialize();
	void Refresh();
	void IsLocalPlayer(bool* bIsLocalPlayer);
	void IsMissionLocalPlayersOutpost(bool* isLocalPlayersOutpost);
	void CanFriendInviteOrAccept(bool* bCanFriend);
	void CanInviteToParty(bool* bCanInviteToParty);
	void IsInvitationPending(bool* bIsInvitationPending);
	void CanManage(bool* bCanManage);
	void GetFirstActiveActionButton(class UIconTextButton_C** IconTextButton);
	void HasValidActions(bool* bHasValidActions);
	void Focus();
	void InitializeContextEvents();
	void OnPartyInvitesCountChanged(int32 InvitesCount);
	void OnActiveFriendsCountUpdated(int32 ActiveFriendsCount);
	void SetTeamMemberInfo(const struct FFortTeamMemberInfo& TeamMemberInfo_0);
	bool IsTeamMemberLocalPlayer();
	void CanViewProfile(bool* CanView);
	void OnMutingChanged(const struct FUniqueNetIdRepl& NewParam, bool NewParam1);
	void RefreshAddFriendButton();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AthenaLobbyPlayerPanelActions_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaLobbyPlayerPanelActions_C")
	}
	static class UAthenaLobbyPlayerPanelActions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobbyPlayerPanelActions_C>();
	}
};
DUMPER7_ASSERTS_UAthenaLobbyPlayerPanelActions_C;

SDK_NAMESPACE_END
