#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChatWidget

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AthenaChatWidget.AthenaChatWidget_C.ExecuteUbergraph_AthenaChatWidget
// 0x0018 (0x0018 - 0x0000)
struct AthenaChatWidget_C_ExecuteUbergraph_AthenaChatWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFocus;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaChatWidgetModalWrapper_C*        K2Node_DynamicCast_AsAthena_Chat_Widget_Modal_Wrapper; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AthenaChatWidget_C_ExecuteUbergraph_AthenaChatWidget;

// Function AthenaChatWidget.AthenaChatWidget_C.FocusChat
// 0x0001 (0x0001 - 0x0000)
struct AthenaChatWidget_C_FocusChat final
{
public:
	bool                                          bFocus;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_AthenaChatWidget_C_FocusChat;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
