#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Assault_Stark_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_Assault_Generic_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_Assault_Stark_Athena.B_Assault_Stark_Athena_C
// 0x0040 (0x1298 - 0x1258)
class AB_Assault_Stark_Athena_C final : public AB_Assault_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Assault_Stark_Athena_C;           // 0x1258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsTargetting;                                      // 0x1260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1261[0x7];                                     // 0x1261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             TransformIntoADSAudio;                             // 0x1268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             TransformOutOfADSAudio;                            // 0x1270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ADSColor;                                          // 0x1278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HipfireColor;                                      // 0x1288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Assault_Stark_Athena(int32 EntryPoint);
	void K2_OnUnEquip();
	void OnSetTargeting(bool bNewIsTargeting);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Assault_Stark_Athena_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Assault_Stark_Athena_C")
	}
	static class AB_Assault_Stark_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Assault_Stark_Athena_C>();
	}
};
DUMPER7_ASSERTS_AB_Assault_Stark_Athena_C;

SDK_NAMESPACE_END
