#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CameraRainDrops_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_CameraRainDrops_02.B_CameraRainDrops_02_C
// 0x0020 (0x0410 - 0x03F0)
class AB_CameraRainDrops_02_C final : public AEmitterCameraLensEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Alpha_Alpha_DCEE07724A8E0C236CD3F49821233A51;      // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Alpha__Direction_DCEE07724A8E0C236CD3F49821233A51; // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FD[0x3];                                      // 0x03FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Alpha;                                             // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_CameraRainDrops_02(int32 EntryPoint);
	void Alpha__FinishedFunc();
	void Alpha__UpdateFunc();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_CameraRainDrops_02_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_CameraRainDrops_02_C")
	}
	static class AB_CameraRainDrops_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_CameraRainDrops_02_C>();
	}
};
DUMPER7_ASSERTS_AB_CameraRainDrops_02_C;

SDK_NAMESPACE_END
