#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Decal_Hightower_Tapas_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_Decal_Hightower_Tapas_2.B_Decal_Hightower_Tapas_2_C
// 0x0020 (0x0248 - 0x0228)
class AB_Decal_Hightower_Tapas_2_C final : public ADecalActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FadeIn_NewTrack_0_F1ED25BD4C25E483A7B19B89EF1D5B2F; // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeIn__Direction_F1ED25BD4C25E483A7B19B89EF1D5B2F; // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeIn;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Decal_MID;                                         // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Decal_Hightower_Tapas_2(int32 EntryPoint);
	void ReceiveBeginPlay();
	void FadeIn__UpdateFunc();
	void FadeIn__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Decal_Hightower_Tapas_2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Decal_Hightower_Tapas_2_C")
	}
	static class AB_Decal_Hightower_Tapas_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Decal_Hightower_Tapas_2_C>();
	}
};
DUMPER7_ASSERTS_AB_Decal_Hightower_Tapas_2_C;

SDK_NAMESPACE_END
