#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_EmotePreviewDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_EmotePreviewDisplay.B_EmotePreviewDisplay_C
// 0x0078 (0x02B0 - 0x0238)
class AB_EmotePreviewDisplay_C final : public AFortEmotePreviewActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAthenaEmojiItemDefinition*             EmojiItemDefinition;                               // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Animation;                                         // 0x0250(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UFortMontageItemDefinitionBase*         DanceOrEmojiItemDefinition;                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartSectionName;                                  // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnEmoteSetupFinished;                              // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAthenaShoutItemDefinition*             ShoutItemDefinition;                               // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAudioComponent*>                DynamicallySpawnedSounds;                          // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)

public:
	void CleanupDynamicSounds();
	void ApplyEmoteToPet(bool IsRemoval);
	void OnLoaded_638F148342254A777E929B88915A8958(class UObject* Loaded);
	void PreviewEmote(const class UFortMontageItemDefinitionBase* Emote);
	void PerformSpecialAction(class FName ActionName);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SpecialCaseShoutHandler();
	void ExecuteUbergraph_B_EmotePreviewDisplay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_EmotePreviewDisplay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_EmotePreviewDisplay_C")
	}
	static class AB_EmotePreviewDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_EmotePreviewDisplay_C>();
	}
};
DUMPER7_ASSERTS_AB_EmotePreviewDisplay_C;

SDK_NAMESPACE_END
