#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_FloppingRabbit_Weap_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_UtilityItem_Generic_Athena_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_FloppingRabbit_Weap_Athena.B_FloppingRabbit_Weap_Athena_C
// 0x0020 (0x0CE8 - 0x0CC8)
class AB_FloppingRabbit_Weap_Athena_C : public AB_UtilityItem_Generic_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_FloppingRabbit_Weap_Athena_C;     // 0x0CC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Projectile;                                        // 0x0CD0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Wire;                                              // 0x0CD8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideBobber;                                        // 0x0CE0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          OneHandGrip;                                       // 0x0CE1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_B_FloppingRabbit_Weap_Athena(int32 EntryPoint);
	void OnTetherDetached();
	void ForceKillFishing();
	void OnWeaponAttached();
	void K2_OnUnEquip();
	void ReceiveBeginPlay();
	void OnRep_HideBobber();
	void OnRep_OneHandGrip();
	class FName DetermineFishLootTierNameAndSetLootForSpawner(bool bIsExplosion);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_FloppingRabbit_Weap_Athena_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_FloppingRabbit_Weap_Athena_C")
	}
	static class AB_FloppingRabbit_Weap_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_FloppingRabbit_Weap_Athena_C>();
	}
};
DUMPER7_ASSERTS_AB_FloppingRabbit_Weap_Athena_C;

SDK_NAMESPACE_END
