#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HighTower_Date_ChainLightning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_HighTower_Date_ChainLightning.B_HighTower_Date_ChainLightning_C
// 0x0080 (0x1118 - 0x1098)
class AB_HighTower_Date_ChainLightning_C final : public AFortWeaponRangedDual
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystem*                        MuzzleParticleSystem;                              // 0x10A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPlayFXTime;                                    // 0x10A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinPlayFXTime;                                     // 0x10AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ReticleHUDElementTags;                             // 0x10B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	EDualWeaponHand                               LastHandFired;                                     // 0x10D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDate;                                            // 0x10D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D2[0x6];                                     // 0x10D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       Post_Process_MIDs;                                 // 0x10D8(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FWeightedBlendable>             BlendableMIDs;                                     // 0x10E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PostMID;                                           // 0x10F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HUD_Start_Offset;                                  // 0x1100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnSpeedMax;                                      // 0x1104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HomingDistanceThreshold;                           // 0x1108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeUntilMax;                                      // 0x110C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HUD_Scale;                                         // 0x1110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HUD_Playrate;                                      // 0x1114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_HighTower_Date_ChainLightning(int32 EntryPoint);
	void BindOnHandFired();
	void HandFired(EDualWeaponHand Hand, bool bPersistantFire);
	void ReceiveBeginPlay();
	void OnWeaponAttached();
	void K2_OnUnEquip();
	void OnStopWeaponFireFX();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void HideReticle();
	void ShowReticle();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_HighTower_Date_ChainLightning_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_HighTower_Date_ChainLightning_C")
	}
	static class AB_HighTower_Date_ChainLightning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HighTower_Date_ChainLightning_C>();
	}
};
DUMPER7_ASSERTS_AB_HighTower_Date_ChainLightning_C;

SDK_NAMESPACE_END
