#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Hightower_Wasabi_Claws

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "B_Mantis_Weapon_Parent_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_Hightower_Wasabi_Claws.B_Hightower_Wasabi_Claws_C
// 0x00E8 (0x0F40 - 0x0E58)
class AB_Hightower_Wasabi_Claws_C : public AB_Mantis_Weapon_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Hightower_Wasabi_Claws_C;         // 0x0E58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SwingFXNiagara_Offhand;                            // 0x0E60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponentBudgeted*         WeaponMesh_Offhand;                                // 0x0E68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SwingFXNiagara_Main;                               // 0x0E70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   OffhandSocketName;                                 // 0x0E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               WeaponRelativeRotation_Main;                       // 0x0E80(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               WeaponRelativeRotation_Offhand;                    // 0x0E8C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   MainhandSocketName;                                // 0x0E98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeaponRelativeOffset_Main;                         // 0x0EA0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WeaponRelativeOffset_Offhand;                      // 0x0EAC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SwingFXSocketName;                                 // 0x0EB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactLocation;                                    // 0x0EC0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ECC[0x4];                                      // 0x0ECC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ImpactDecal;                                       // 0x0ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ImpactDecalPositionSocketName;                     // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        MainHandDecalLocations;                            // 0x0EE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FVector>                        OffHandDecalLocations;                             // 0x0EF0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          MainHandFirstDecalLocationIsSet;                   // 0x0F00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OffHandFirstDecalLocationIsSet;                    // 0x0F01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MainHandDecalLocationsReady;                       // 0x0F02(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OffHandDecalLocationsReady;                        // 0x0F03(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ReadyToAddImpactDecal;                             // 0x0F04(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F05[0x3];                                      // 0x0F05(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecalOffset;                                       // 0x0F08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalScale;                                        // 0x0F0C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugDecals;                                       // 0x0F18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F19[0x3];                                      // 0x0F19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DualDecalGraceWindow;                              // 0x0F1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             UnequipSound;                                      // 0x0F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             EquipSound;                                        // 0x0F28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         MainHandDirectionalImpactFX;                       // 0x0F30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemAsset*                         OffhandDirectionalImpactFX;                        // 0x0F38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Hightower_Wasabi_Claws(int32 EntryPoint);
	void SetReadyToAddImpactDecalsFalse();
	void TrySpawnDecal();
	void OnPlayImpactFX(const struct FHitResult& HitResult, EPhysicalSurface ImpactPhysicalSurface, class UFXSystemComponent* SpawnedPSC);
	void Swing_Right_2();
	void Swing_Right_End();
	void Swing_Right();
	void Swing_Left_2();
	void Swing_Left_End();
	void Swing_Left();
	void K2_OnUnEquip();
	void OnWeaponDetached();
	void OnWeaponAttached();
	void Bind_Dual_Melee_Swing_Events();
	void Unbind_Dual_Melee_Swing_Events();

	void CalculateDecalRotationFrom2Locations(TArray<struct FVector>& DecalLocations, struct FRotator* DecalRotation) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Hightower_Wasabi_Claws_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Hightower_Wasabi_Claws_C")
	}
	static class AB_Hightower_Wasabi_Claws_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Hightower_Wasabi_Claws_C>();
	}
};
DUMPER7_ASSERTS_AB_Hightower_Wasabi_Claws_C;

SDK_NAMESPACE_END
