#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Junior_HoloTable_FX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_Junior_HoloTable_FX.B_Junior_HoloTable_FX_C
// 0x0048 (0x0268 - 0x0220)
class AB_Junior_HoloTable_FX_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Junior_HoloTable_RedTarget;                     // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Junior_HoloTable;                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_FadeIn_FadeCurve_417AADD54D277FC015E15190993BE4CF; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_FadeIn__Direction_417AADD54D277FC015E15190993BE4CF; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_FadeIn;                                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_FadeOut_FadeCurve_9CBC68BC4D309152970DB1AA11B5D4D7; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_FadeOut__Direction_9CBC68BC4D309152970DB1AA11B5D4D7; // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_FadeOut;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlyingProcess;                                     // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Junior_HoloTable_FX(int32 EntryPoint);
	void ResetFadeIn();
	void ResetFadeOut();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnEventActive_B5143F4D4BFC06EC5E4DBE9049BA0281(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventUpdated_B5143F4D4BFC06EC5E4DBE9049BA0281(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void OnEventEnded_B5143F4D4BFC06EC5E4DBE9049BA0281(const class FString& EventName, const struct FTimespan& TimeUntilEnd, const struct FTimespan& TimeSinceBegin, float TimespanRatio);
	void Timeline_FadeIn__UpdateFunc();
	void Timeline_FadeIn__FinishedFunc();
	void Timeline_FadeOut__UpdateFunc();
	void Timeline_FadeOut__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Junior_HoloTable_FX_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Junior_HoloTable_FX_C")
	}
	static class AB_Junior_HoloTable_FX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Junior_HoloTable_FX_C>();
	}
};
DUMPER7_ASSERTS_AB_Junior_HoloTable_FX_C;

SDK_NAMESPACE_END
