#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Pickups_Parent_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_Pickups_Default.B_Pickups_Default_C
// 0x0028 (0x04C0 - 0x0498)
class AB_Pickups_Default_C final : public AB_Pickups_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Pickups_Default_C;                // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   sm_rare_pickup;                                    // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Background;                                        // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     ParticleSystem;                                    // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Pickups_Default(int32 EntryPoint);
	void ReceiveBeginPlay();
	void HideBackgroundAndSpotlight();
	void OnPickedUp();
	void OnTossed();
	void UserConstructionScript();
	void Setup_Light();
	void Set_Initial_BKGD_Param(class UMaterialInstanceDynamic* Mid);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Pickups_Default_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Pickups_Default_C")
	}
	static class AB_Pickups_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pickups_Default_C>();
	}
};
DUMPER7_ASSERTS_AB_Pickups_Default_C;

SDK_NAMESPACE_END
