#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_PlayerSpawnedBall

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsBall_Master_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_PlayerSpawnedBall.B_PlayerSpawnedBall_C
// 0x0030 (0x08A8 - 0x0878)
class AB_PlayerSpawnedBall_C final : public APhysicsBall_Master_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_PlayerSpawnedBall_C;              // 0x0878(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ImpactFX_0;                                        // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CueToPlayWhenReused;                               // 0x0888(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CueToPlayWhenExpired;                              // 0x0890(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         BounceCount_0;                                     // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFrontEndPreview;                                // 0x089C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89D[0x3];                                      // 0x089D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        OwningPawn;                                        // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_PlayerSpawnedBall(int32 EntryPoint);
	void InitializeToyPreviewInFrontend();
	void InitializeToyInstance(class AFortPlayerController* OwningPC, int32 NumTimesSummoned);
	void StartToyFadeOutDueToNewPlacement();
	void NotifyToyInstanceOfReuse();
	void UserConstructionScript();
	void PlayCueCenteredOnMe(const struct FGameplayTag& GameplayCueToPlay, float Raw_Magnitude);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_PlayerSpawnedBall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_PlayerSpawnedBall_C")
	}
	static class AB_PlayerSpawnedBall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_PlayerSpawnedBall_C>();
	}
};
DUMPER7_ASSERTS_AB_PlayerSpawnedBall_C;

SDK_NAMESPACE_END
