#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_FragGrenade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "B_Prj_Athena_Grenade_Base_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_Prj_Athena_FragGrenade.B_Prj_Athena_FragGrenade_C
// 0x0028 (0x0968 - 0x0940)
class AB_Prj_Athena_FragGrenade_C final : public AB_Prj_Athena_Grenade_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Prj_Athena_FragGrenade_C;         // 0x0940(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_SurfaceTypeSoundComponent_C*        BP_SurfaceTypeSoundComponent;                      // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         PreExploWarning_PreExplo_E5859FFE443F57359EC2C0AB73DFA4CD; // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PreExploWarning__Direction_E5859FFE443F57359EC2C0AB73DFA4CD; // 0x0954(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_955[0x3];                                      // 0x0955(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PreExploWarning;                                   // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FeedbackCue;                                       // 0x0960(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Athena_FragGrenade(int32 EntryPoint);
	void Pre_Explo_Audio_Tell();
	void ReceiveBeginPlay();
	void OnBounce(const struct FHitResult& Hit);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void FuseEnded();
	void PreExploWarning__UpdateFunc();
	void PreExploWarning__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Prj_Athena_FragGrenade_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Prj_Athena_FragGrenade_C")
	}
	static class AB_Prj_Athena_FragGrenade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_FragGrenade_C>();
	}
};
DUMPER7_ASSERTS_AB_Prj_Athena_FragGrenade_C;

SDK_NAMESPACE_END
