#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_RocketLauncher_Generic_Athena_HighTier

#include "Basic.hpp"

#include "B_Ranged_Generic_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_RocketLauncher_Generic_Athena_HighTier.B_RocketLauncher_Generic_Athena_HighTier_C
// 0x00D8 (0x1330 - 0x1258)
class AB_RocketLauncher_Generic_Athena_HighTier_C final : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_RocketLauncher_Generic_Athena_HighTier_C; // 0x1258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        RearMuzzleLoc;                                     // 0x1260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FFortPortableSoftParticles             Rear_Muzzle_Flash;                                 // 0x1268(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFXSystemAsset*                         RearMuzzleFXSystem;                                // 0x12C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FFortPortableSoftParticles             Front_Muzzle_Flash;                                // 0x12C8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                RearMuzzleOffsetMultiplier;                        // 0x1320(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_RocketLauncher_Generic_Athena_HighTier(int32 EntryPoint);
	void Muzzle_Flash_FX(bool Persistent_Fire);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_RocketLauncher_Generic_Athena_HighTier_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_RocketLauncher_Generic_Athena_HighTier_C")
	}
	static class AB_RocketLauncher_Generic_Athena_HighTier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_RocketLauncher_Generic_Athena_HighTier_C>();
	}
};
DUMPER7_ASSERTS_AB_RocketLauncher_Generic_Athena_HighTier_C;

SDK_NAMESPACE_END
