#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Shotgun_Charge_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Shotgun_Generic_classes.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass B_Shotgun_Charge_Athena.B_Shotgun_Charge_Athena_C
// 0x0038 (0x1290 - 0x1258)
class AB_Shotgun_Charge_Athena_C final : public AB_Shotgun_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Shotgun_Charge_Athena_C;          // 0x1258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_PartialCharged_MF;                               // 0x1260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_FullyCharged_MF;                                 // 0x1268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ChargeState;                                       // 0x1270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MaxChargeForSwap;                                  // 0x1274(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1275[0x3];                                     // 0x1275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             MaxChargeSwapAudio;                                // 0x1278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AudioVisualizerEnabled;                            // 0x1280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1281[0x7];                                     // 0x1281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           AudioVisualizerTimer;                              // 0x1288(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Shotgun_Charge_Athena(int32 EntryPoint);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void ChargeAudioVisualizer();
	void OnEndCharge();
	void OnReachedMaxCharge();
	void OnStartCharge();
	void K2_OnUnEquip();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("B_Shotgun_Charge_Athena_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"B_Shotgun_Charge_Athena_C")
	}
	static class AB_Shotgun_Charge_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Shotgun_Charge_Athena_C>();
	}
};
DUMPER7_ASSERTS_AB_Shotgun_Charge_Athena_C;

SDK_NAMESPACE_END
