#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BadgerBangsLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass BadgerBangsLayerAnimBP.BadgerBangsLayerAnimBP_C
// 0x1310 (0x1690 - 0x0380)
class UBadgerBangsLayerAnimBP_C final : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0390(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x03C0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x0448(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x0478(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0500(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x0530(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x05B8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x0640(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0670(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x06F8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0728(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x07A0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x07D0(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0848(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0878(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x08F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0920(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0998(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x09C8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0A50(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0A80(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0B08(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0B38(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0BC0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0BF0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0C20(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x0C50(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x0C80(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x0CB0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x0CE0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x0D10(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x0D40(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x0D70(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0DA0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0DD0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x0E00(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0E88(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x0EB8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x0F40(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x0F70(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x0FF8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x1028(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x10B0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x10E0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1168(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1198(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1220(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1250(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x12D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1308(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1390(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x13C0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x1448(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1478(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1500(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1530(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x15B8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x15E8(0x0078)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1660(0x0030)()

public:
	void ExecuteUbergraph_BadgerBangsLayerAnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BadgerBangsLayerAnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BadgerBangsLayerAnimBP_C")
	}
	static class UBadgerBangsLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBadgerBangsLayerAnimBP_C>();
	}
};
DUMPER7_ASSERTS_UBadgerBangsLayerAnimBP_C;

SDK_NAMESPACE_END
