#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassItemTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass BattlePassItemTracker.BattlePassItemTracker_C
// 0x0030 (0x02C8 - 0x0298)
class UBattlePassItemTracker_C final : public UAthenaBattlePassItemTracker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       InitialState;                                      // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SetNumberVisible;                                  // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Increase;                                          // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSecondary;                                       // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BattlePassItemTracker(int32 EntryPoint);
	void OnInterpStarted();
	void OnInterpEnded(class UCommonNumericTextBlock* NumericTextBlock, const bool HadCompleted);
	void HandleIntro();
	void HandleIncrease();
	void HandleNumberVisible();
	void HandleInitialState();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BattlePassItemTracker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattlePassItemTracker_C")
	}
	static class UBattlePassItemTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassItemTracker_C>();
	}
};
DUMPER7_ASSERTS_UBattlePassItemTracker_C;

SDK_NAMESPACE_END
