#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_HeldWeapon_Parent

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.ExecuteUbergraph_BGA_HeldWeapon_Parent
// 0x0008 (0x0008 - 0x0000)
struct BGA_HeldWeapon_Parent_C_ExecuteUbergraph_BGA_HeldWeapon_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEquipped;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BGA_HeldWeapon_Parent_C_ExecuteUbergraph_BGA_HeldWeapon_Parent;

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.OnHeldWeaponEquipToggled
// 0x0001 (0x0001 - 0x0000)
struct BGA_HeldWeapon_Parent_C_OnHeldWeaponEquipToggled final
{
public:
	bool                                          bEquipped;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BGA_HeldWeapon_Parent_C_OnHeldWeaponEquipToggled;

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.HeldWeaponSetEquipped
// 0x0002 (0x0002 - 0x0000)
struct BGA_HeldWeapon_Parent_C_HeldWeaponSetEquipped final
{
public:
	bool                                          bEquipped;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BGA_HeldWeapon_Parent_C_HeldWeaponSetEquipped;

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.OnRep_bHeldWeaponEquipped
// 0x0002 (0x0002 - 0x0000)
struct BGA_HeldWeapon_Parent_C_OnRep_bHeldWeaponEquipped final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BGA_HeldWeapon_Parent_C_OnRep_bHeldWeaponEquipped;

// Function BGA_HeldWeapon_Parent.BGA_HeldWeapon_Parent_C.SetHeldWeaponVisualComponent
// 0x0008 (0x0008 - 0x0000)
struct BGA_HeldWeapon_Parent_C_SetHeldWeaponVisualComponent final
{
public:
	class USceneComponent*                        HeldWeaponVisualComponent_0;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BGA_HeldWeapon_Parent_C_SetHeldWeaponVisualComponent;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
