#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGA_HighTower_Date_BallLightning_FireMesh

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BGA_HighTower_Date_BallLightning_FireMesh.BGA_HighTower_Date_BallLightning_FireMesh_C.ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh
// 0x0004 (0x0004 - 0x0000)
struct BGA_HighTower_Date_BallLightning_FireMesh_C_ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BGA_HighTower_Date_BallLightning_FireMesh_C_ExecuteUbergraph_BGA_HighTower_Date_BallLightning_FireMesh;

// Function BGA_HighTower_Date_BallLightning_FireMesh.BGA_HighTower_Date_BallLightning_FireMesh_C.UserConstructionScript
// 0x0014 (0x0014 - 0x0000)
struct BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BGA_HighTower_Date_BallLightning_FireMesh_C_UserConstructionScript;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
