#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blueprint_Paper_VIM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass Blueprint_Paper_VIM.Blueprint_Paper_VIM_C
// 0x0510 (0x08B0 - 0x03A0)
class UBlueprint_Paper_VIM_C final : public UFortAnimInstance
{
public:
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_3;                        // 0x03B0(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_2;                        // 0x04D8(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x0600(0x0128)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x0728(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0850(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0870(0x0030)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x08A0(0x0010)()

public:
	void ExecuteUbergraph_Blueprint_Paper_VIM(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Blueprint_Paper_VIM_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Blueprint_Paper_VIM_C")
	}
	static class UBlueprint_Paper_VIM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprint_Paper_VIM_C>();
	}
};
DUMPER7_ASSERTS_UBlueprint_Paper_VIM_C;

SDK_NAMESPACE_END
