#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluidSim_FN

#include "Basic.hpp"

#include "FluidForceDynamic_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_FluidSim_01_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_FluidSim_FN.BP_FluidSim_FN_C
// 0x0108 (0x0558 - 0x0450)
class ABP_FluidSim_FN_C final : public ABP_FluidSim_01_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_FluidSim_FN_C;                   // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFluidForceDynamic                     BoatForceSettings;                                 // 0x0458(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FFluidForceDynamic                     PlayerForceSettings;                               // 0x04C8(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          NearPawns;                                         // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPawn*>                      RelevantFortPawns;                                 // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Use_FN_Pawn_Forces;                                // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_FluidSim_FN(int32 EntryPoint);
	void GetPlayerPawnForces();
	void GetLocalPawn(class APawn** Pawn);
	void GetFortnitePawnForces();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FluidSim_FN_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FluidSim_FN_C")
	}
	static class ABP_FluidSim_FN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FluidSim_FN_C>();
	}
};
DUMPER7_ASSERTS_ABP_FluidSim_FN_C;

SDK_NAMESPACE_END
