#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_EventLevel_NavObject_BattlePassScreen

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_Frontend_EventLevel_NavObject_BattlePassScreen.BP_Frontend_EventLevel_NavObject_BattlePassScreen_C.ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BattlePassScreen
// 0x0018 (0x0018 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_BattlePassScreen_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BattlePassScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasPurchasedSeasonBook_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_Frontend_EventLevel_NavObject_BattlePassScreen_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_BattlePassScreen;

// Function BP_Frontend_EventLevel_NavObject_BattlePassScreen.BP_Frontend_EventLevel_NavObject_BattlePassScreen_C.SetBattlePassVisualState
// 0x0010 (0x0010 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_BattlePassScreen_C_SetBattlePassVisualState final
{
public:
	bool                                          bIsPurchased;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Frontend_EventLevel_NavObject_BattlePassScreen_C_SetBattlePassVisualState;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
