#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileTrajectory_SnapToGrid_BirthdayBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ECardinalDirection_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_ProjectileTrajectory_Athena_SnapToGridArrow_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_ProjectileTrajectory_SnapToGrid_BirthdayBox.BP_ProjectileTrajectory_SnapToGrid_BirthdayBox_C
// 0x00D0 (0x0430 - 0x0360)
class ABP_ProjectileTrajectory_SnapToGrid_BirthdayBox_C final : public ABP_ProjectileTrajectory_Athena_SnapToGridArrow_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ProjectileTrajectory_SnapToGrid_BirthdayBox_C; // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Looping_Sound;                                     // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<ECardinalDirection, float>               OrientationYawOffsets;                             // 0x0370(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ECardinalDirection, struct FVector>      OrientationLocationOffsets;                        // 0x03C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        BGALocations_Traced;                               // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FRotator>                       BGARotations_Traced;                               // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ProjectileTrajectory_SnapToGrid_BirthdayBox(int32 EntryPoint);
	void ReceiveDestroyed();
	void HandleGridSnapUpdates(const struct FVector& NewLocation);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ProjectileTrajectory_SnapToGrid_BirthdayBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ProjectileTrajectory_SnapToGrid_BirthdayBox_C")
	}
	static class ABP_ProjectileTrajectory_SnapToGrid_BirthdayBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ProjectileTrajectory_SnapToGrid_BirthdayBox_C>();
	}
};
DUMPER7_ASSERTS_ABP_ProjectileTrajectory_SnapToGrid_BirthdayBox_C;

SDK_NAMESPACE_END
