#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplayPC_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_ReplayPC_Athena.BP_ReplayPC_Athena_C
// 0x00C0 (0x3920 - 0x3860)
class ABP_ReplayPC_Athena_C final : public AFortReplaySpectatorAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x3860(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x3868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUnderwaterAudioComponent_C*            UnderwaterAudioComponent;                          // 0x3870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<float, class USoundMix*>                 PlaybackRateMap;                                   // 0x3878(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CurrentPlayRate;                                   // 0x38C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFast;                                           // 0x38CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38CD[0x3];                                     // 0x38CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SpeedupLoop;                                       // 0x38D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SlowdownLoop;                                      // 0x38D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHudVisible;                                     // 0x38E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38E1[0x7];                                     // 0x38E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        ZoomOutLoop;                                       // 0x38E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ZoomInLoop;                                        // 0x38F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSkydivingAudioEnabled;                          // 0x38F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetParachuting;                              // 0x38F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsTargetSkydiving;                                // 0x38FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38FB[0x5];                                     // 0x38FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        SkydivingAudioLoop;                                // 0x3900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPaused;                                         // 0x3908(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3909[0x7];                                     // 0x3909(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CurrentSkydivingSound;                             // 0x3910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              PauseMIx;                                          // 0x3918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplayPC_Athena(int32 EntryPoint);
	void Update_Sound_Mix();
	void Looping_Audio_Update();
	void Handle_Parachute_Audio_State();
	void On_Pause_State_Changed(bool bPaused);
	void OnZoomInBegin();
	void OnZoomInEnd();
	void OnZoomOutBegin();
	void OnZoomOutEnd();
	void OnReplayHudVisibilityChanged(const EHudVisibilityState IsVisible);
	void _Speedup_Loops(float Playback_Multiplier);
	void OnNotifyNewPlaybackMultiplier(float NewMultiplier);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	class USoundBase* GetSkydivingSound();
	void SetSkydivingAudioEnabled(bool Enabled);
	void IsGameplayCamera(bool* IsGameplayCamera_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ReplayPC_Athena_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ReplayPC_Athena_C")
	}
	static class ABP_ReplayPC_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplayPC_Athena_C>();
	}
};
DUMPER7_ASSERTS_ABP_ReplayPC_Athena_C;

SDK_NAMESPACE_END
