#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurfaceTypeSoundComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_SurfaceTypeSoundComponent.BP_SurfaceTypeSoundComponent_C
// 0x0070 (0x0120 - 0x00B0)
class UBP_SurfaceTypeSoundComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EPhysicalSurface                              SurfaceType;                                       // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPhysicalSurface, class USoundBase*>     SoundMap;                                          // 0x00C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Location;                                          // 0x0110(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSurfaceTypeSet;                                  // 0x011C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_SurfaceTypeSoundComponent(int32 EntryPoint);
	void Test_Delay();
	void PlaySound(const struct FVector& Location_0);
	void SetSurfaceType(EPhysicalSurface SurfaceType_0, class AActor* Actor);
	void ActuallyPlaySound();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SurfaceTypeSoundComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SurfaceTypeSoundComponent_C")
	}
	static class UBP_SurfaceTypeSoundComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SurfaceTypeSoundComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_SurfaceTypeSoundComponent_C;

SDK_NAMESPACE_END
