#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_ScannerScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_UI_ScannerScreen.BP_UI_ScannerScreen_C
// 0x0038 (0x07F8 - 0x07C0)
class ABP_UI_ScannerScreen_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       ScreenWidget;                                      // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ErrorTimeline_Switch_EBBEA5504EC9CD2C274D38AA3BFC1EEF; // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ErrorTimeline__Direction_EBBEA5504EC9CD2C274D38AA3BFC1EEF; // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DD[0x3];                                      // 0x07DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ErrorTimeline;                                     // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_ScannerScreen_C*                    Widget_Screen;                                     // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimeoutHandle;                                     // 0x07F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UI_ScannerScreen(int32 EntryPoint);
	void ScreenEventTargetLost(const class FText& LostText);
	void ScreenEventDismiss();
	void ScreenEventScan();
	void ScreenEventFailure(const class FText& FailureText);
	void ScreenEventSuccess(const class FText& SuccessText);
	void ScreenEventError(bool Reverse);
	void ReceiveBeginPlay();
	void ErrorTimeline__UpdateFunc();
	void ErrorTimeline__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_UI_ScannerScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_UI_ScannerScreen_C")
	}
	static class ABP_UI_ScannerScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UI_ScannerScreen_C>();
	}
};
DUMPER7_ASSERTS_ABP_UI_ScannerScreen_C;

SDK_NAMESPACE_END
