#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BundleItemMiniCardWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass BundleItemMiniCardWidget.BundleItemMiniCardWidget_C
// 0x0028 (0x0298 - 0x0270)
class UBundleItemMiniCardWidget_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortCosmeticItemCard_C*                ItemCard;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SoundOnItemCardShow;                               // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              Fort_Item;                                         // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Play_Anim___Show();
	void Construct();
	void ExecuteUbergraph_BundleItemMiniCardWidget(int32 EntryPoint);

	class UObject* GetListItemObject() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BundleItemMiniCardWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BundleItemMiniCardWidget_C")
	}
	static class UBundleItemMiniCardWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBundleItemMiniCardWidget_C>();
	}
};
DUMPER7_ASSERTS_UBundleItemMiniCardWidget_C;

SDK_NAMESPACE_END
