#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CareerScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass CareerScreen.CareerScreen_C
// 0x0050 (0x0520 - 0x04D0)
class UCareerScreen_C final : public UAthenaCareerScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        FeatDisplaySwitcher;                               // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GradOvr;                                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   NoAchievementMessage;                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonHeadingTextLabel;                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Input_ReplayCinematic;                             // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UActivatableMovieWidget_C*              ActivatableMovieWidget;                            // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoPlayVideo;                                     // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CareerScreen(int32 EntryPoint);
	void OnInitialized();
	void BP_OnActivated();
	void ShowFeats(bool bHasCompletedFeats);
	void PlayCinematic();
	void ReplayCinematic(bool* PassThrough);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CareerScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CareerScreen_C")
	}
	static class UCareerScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCareerScreen_C>();
	}
};
DUMPER7_ASSERTS_UCareerScreen_C;

SDK_NAMESPACE_END
