#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CBGA_Blade_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass CBGA_Blade_Athena.CBGA_Blade_Athena_C
// 0x0040 (0x0808 - 0x07C8)
class ACBGA_Blade_Athena_C final : public ABuildingGameplayActorBlade
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_IBlade_Pull_SwordOnly;                           // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Sword;                                             // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientLooping;                                    // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        PickupBeam;                                        // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BeamFX;                                            // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CBGA_Blade_Athena(int32 EntryPoint);
	void OnPullAborted();
	void OnPullStart();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetDrawDistance();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn_0) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CBGA_Blade_Athena_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CBGA_Blade_Athena_C")
	}
	static class ACBGA_Blade_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACBGA_Blade_Athena_C>();
	}
};
DUMPER7_ASSERTS_ACBGA_Blade_Athena_C;

SDK_NAMESPACE_END
