#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass CCPM_Base.CCPM_Base_C
// 0x0070 (0x0400 - 0x0390)
class ACCPM_Base_C : public ACustomCharacterPartModifier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           StaticMeshComponents;                              // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       CascadeComponents;                                 // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Last_Pawn;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Disable_Particles_during_Skydive;                  // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disable_Particles_during_First_Person;             // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Disable_Particles_in_Vehicle;                      // 0x03CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsDriving;                                        // 0x03CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FLinearColor                           Event_Log_Color;                                   // 0x03CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Hidding_prefixes;                                  // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMeshComponent*                         Character_Part_Type;                               // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Debug_Printing;                             // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CCPM_Base(int32 EntryPoint);
	void Attachment();
	void OnPawnAndPartChanged();
	void isHiddingInProp(bool IsHidden);
	void PlayerMovementTick(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void ExitVehicle();
	void EnterVehicle();
	void Open();
	void ExitingHidingProp();
	void EnteringHidingProp();
	void OnTargetingOrFirstPersonCameraChanged();
	void Close();
	void OnEndSkydiving();
	void OnBeginSkydiving();
	void Reset_Enter_Vehicle();
	void Reset_Exit_Vehicle();
	void UserConstructionScript();
	void attachParticleSystem(class UParticleSystemComponent* Particle_System_Component, class FName Socket_Name);
	void overrideCharacterPartType(EFortCustomPartType Part_Type);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CCPM_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CCPM_Base_C")
	}
	static class ACCPM_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_Base_C>();
	}
};
DUMPER7_ASSERTS_ACCPM_Base_C;

SDK_NAMESPACE_END
