#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_EyeFlash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CCPM_Parent_WatchCosmeticStat_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass CCPM_EyeFlash.CCPM_EyeFlash_C
// 0x0038 (0x0488 - 0x0450)
class ACCPM_EyeFlash_C : public ACCPM_Parent_WatchCosmeticStat_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_EyeFlash_C;                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS;                                                // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EffectColor;                                       // 0x0460(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EffectPositionOffset;                              // 0x0470(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillCount;                                         // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FXgate;                                            // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CCPM_EyeFlash(int32 EntryPoint);
	void PreDestruction();
	void CE_FX_color_change(const struct FLinearColor& NewParam);
	void ReceiveDestroyed();
	void OnPawnAndPartChanged();
	void OnPostResIn();
	void CustomEvent(int32 StageNumBeingActivated);
	void UpdateBasedOnKills();
	void OnStatChanged_1F1873BA408CFFA47B9E30A71CDCAA22(class FName StatName, int32 StatValue);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CCPM_EyeFlash_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CCPM_EyeFlash_C")
	}
	static class ACCPM_EyeFlash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_EyeFlash_C>();
	}
};
DUMPER7_ASSERTS_ACCPM_EyeFlash_C;

SDK_NAMESPACE_END
