#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_HoneyDew_Swole_FaceAcc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CCPM_Parent_WatchCosmeticStat_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass CCPM_HoneyDew_Swole_FaceAcc.CCPM_HoneyDew_Swole_FaceAcc_C
// 0x0048 (0x0498 - 0x0450)
class ACCPM_HoneyDew_Swole_FaceAcc_C final : public ACCPM_Parent_WatchCosmeticStat_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_HoneyDew_Swole_FaceAcc_C;      // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           EffectColor;                                       // 0x0458(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          AnimInstance;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteIntroDuration;                                // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteOutroDuration;                                // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EffectPositionOffset;                              // 0x0478(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteTimeQuant;                                    // 0x0484(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoTick;                                            // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x3];                                      // 0x0489(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EmoteTimeStart;                                    // 0x048C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EmoteTimeEnd;                                      // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_HoneyDew_Swole_FaceAcc(int32 EntryPoint);
	void OnPawnStoppedEmote(class UFortItemDefinition* MontageItemDef, class AFortPawn* PawnEmoting);
	void OnPawnAndPartChanged();
	void ReceiveTick(float DeltaSeconds);
	void BindOrUnbindOnPlayerEmoteStopped(bool Bind, class AFortPawn* Pawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CCPM_HoneyDew_Swole_FaceAcc_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CCPM_HoneyDew_Swole_FaceAcc_C")
	}
	static class ACCPM_HoneyDew_Swole_FaceAcc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_HoneyDew_Swole_FaceAcc_C>();
	}
};
DUMPER7_ASSERTS_ACCPM_HoneyDew_Swole_FaceAcc_C;

SDK_NAMESPACE_END
