#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_HighTower_Tomato_Face

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CCPM_Base_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass CCPM_HighTower_Tomato_Face.CCPM_HighTower_Tomato_Face_C
// 0x0030 (0x0430 - 0x0400)
class ACCPM_HighTower_Tomato_Face_C final : public ACCPM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_HighTower_Tomato_Face_C;       // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               HairEmote_MID;                                     // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               GlassEmote_MID;                                    // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HairOpaque_MID;                                    // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               GlassOpaque_MID;                                   // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentVariant;                                    // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_HighTower_Tomato_Face(int32 EntryPoint);
	void AnimNotify_MaskToCasual();
	void AnimNotify_SuitToMask();
	void AnimNotify_MaskToSuit();
	void AnimNotify_CasualToMask();
	void OnPawnAndPartChanged();
	void UserConstructionScript();
	void CreateMIDs();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CCPM_HighTower_Tomato_Face_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CCPM_HighTower_Tomato_Face_C")
	}
	static class ACCPM_HighTower_Tomato_Face_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_HighTower_Tomato_Face_C>();
	}
};
DUMPER7_ASSERTS_ACCPM_HighTower_Tomato_Face_C;

SDK_NAMESPACE_END
