#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChargeWeaponLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ExecuteUbergraph_ChargeWeaponLayerAnimBP
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ExecuteUbergraph_ChargeWeaponLayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ExecuteUbergraph_ChargeWeaponLayerAnimBP;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_BlueprintUpdateAnimation;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_AnimGraph;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemPreIK
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemPreIK final
{
public:
	struct FPoseLink                              InPose_PreIK;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemPreIK_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemPreIK;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemFullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemFullBodyOverride final
{
public:
	struct FPoseLink                              InPoseFullBody;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemFullBodyOverride_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemFullBodyOverride;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemAimOffset
// 0x0040 (0x0040 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemAimOffset final
{
public:
	struct FPoseLink                              InPose_AimOffset;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         AimOffsetAlpha;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              InPose_UpperLowerPreMeleeAO;                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemAimOffset_0;                                   // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemAimOffset;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemSkeletalControl
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemSkeletalControl final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemSkeletalControl_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemSkeletalControl;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemSwimJumpSurfaceEnd
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemSwimJumpSurfaceEnd final
{
public:
	struct FPoseLink                              ItemSwimJumpSurfaceEnd_0;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemSwimJumpSurfaceEnd;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemSwimJumpSurfaceLoop
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemSwimJumpSurfaceLoop final
{
public:
	struct FPoseLink                              ItemSwimJumpSurfaceLoop_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemSwimJumpSurfaceLoop;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemSwimJumpFallLoop
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemSwimJumpFallLoop final
{
public:
	struct FPoseLink                              ItemSwimJumpFallLoop_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemSwimJumpFallLoop;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemSwimJumpStartLoop
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemSwimJumpStartLoop final
{
public:
	struct FPoseLink                              ItemSwimJumpStartLoop_0;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemSwimJumpStartLoop;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemSwimJumpStart
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemSwimJumpStart final
{
public:
	struct FPoseLink                              ItemSwimJumpStart_0;                               // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemSwimJumpStart;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemRelaxedEntry
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemRelaxedEntry final
{
public:
	struct FPoseLink                              InPoseRelaxedEntry;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemRelaxedEntry_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemRelaxedEntry;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemLowerBodyJogPostPivot
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemLowerBodyJogPostPivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPostPivot;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogPostPivot_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemLowerBodyJogPostPivot;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemLowerBodyJogPrePivot
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemLowerBodyJogPrePivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPrePivot;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogPrePivot_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemLowerBodyJogPrePivot;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemLowerBodyJogStop
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemLowerBodyJogStop final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStop;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogStop_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemLowerBodyJogStop;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemLowerBodyJogStart
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemLowerBodyJogStart final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStart;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogStart_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemLowerBodyJogStart;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemLowerBodyLeanAdditive
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemLowerBodyLeanAdditive final
{
public:
	struct FPoseLink                              InPoseLowerBodyLeanAdditive;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyLeanAdditive_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemLowerBodyLeanAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemLowerBodyMovement
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemLowerBodyMovement final
{
public:
	struct FPoseLink                              InPoseLowerBodyMovement;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyMovement_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemLowerBodyMovement;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemJogPostPivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemJogPostPivotAdditive final
{
public:
	struct FPoseLink                              InPosePostPivotAdditive;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPostPivotAdditive_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemJogPostPivotAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemJogPrePivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemJogPrePivotAdditive final
{
public:
	struct FPoseLink                              InPosePrePivotAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPrePivotAdditive_0;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemJogPrePivotAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemJogStopAdditive
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemJogStopAdditive final
{
public:
	struct FPoseLink                              InPoseJogStopAdditive;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStopAdditive_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemJogStopAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemJogStartAdditive
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemJogStartAdditive final
{
public:
	struct FPoseLink                              InPoseJogStartAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStartAdditive_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemJogStartAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemFlyModeLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemFlyModeLoopAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeLoopAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemFlyModeLoopAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemFlyModeStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemFlyModeStartAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemFlyModeStartAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemZipLineStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemZipLineStartAdditive final
{
public:
	struct FPoseLink                              ItemZipLineStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemZipLineStartAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemJetPackJumpAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemJetPackJumpAdditive final
{
public:
	struct FPoseLink                              ItemJetPackJumpAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemJetPackJumpAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemJetPackStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemJetPackStartAdditive final
{
public:
	struct FPoseLink                              ItemJetPackStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemJetPackStartAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemFallLandAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemFallLandAdditive final
{
public:
	struct FPoseLink                              ItemFallLandAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemFallLandAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemFallAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemFallAdditive final
{
public:
	struct FPoseLink                              ItemFallAdditive_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemFallAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemJumpLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemJumpLoopAdditive final
{
public:
	struct FPoseLink                              ItemJumpLoopAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemJumpLoopAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemJumpUpAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemJumpUpAdditive final
{
public:
	struct FPoseLink                              ItemJumpUpAdditive_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemJumpUpAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemSlopeSliding
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemSlopeSliding final
{
public:
	struct FPoseLink                              ItemSlopeSliding_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemSlopeSliding;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemCrouchTurningAdditive
// 0x0010 (0x0010 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemCrouchTurningAdditive final
{
public:
	struct FPoseLink                              ItemCrouchTurningAdditive_0;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemCrouchTurningAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemIdleAdditive
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemIdleAdditive final
{
public:
	struct FPoseLink                              InPoseIdleAdditive;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemIdleAdditive_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemIdleAdditive;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemFullBodySprint
// 0x0020 (0x0020 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemFullBodySprint final
{
public:
	struct FPoseLink                              InPoseSprint;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemFullBodySprint_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemFullBodySprint;

// Function ChargeWeaponLayerAnimBP.ChargeWeaponLayerAnimBP_C.ItemUpperBody
// 0x0260 (0x0260 - 0x0000)
struct ChargeWeaponLayerAnimBP_C_ItemUpperBody final
{
public:
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x0010(0x0240)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemUpperBody_0;                                   // 0x0250(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ChargeWeaponLayerAnimBP_C_ItemUpperBody;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
