#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChatMessageEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass ChatMessageEntry.ChatMessageEntry_C
// 0x0030 (0x03C8 - 0x0398)
class UChatMessageEntry_C final : public UFortChatMessageEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          MessageBackground;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MessageWrapper;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 DefaultStyle_0;                                    // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SelfStyle;                                         // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 OtherUserStyle;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChatMessageEntry(int32 EntryPoint);
	void OnFocusedChanged(bool bIsFocused);
	void BndEvt__Button_FocusTarget_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature();
	void OnEntryUpdated_1();
	void HandleSelectionStatusChanged(bool bIsSelected);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ChatMessageEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChatMessageEntry_C")
	}
	static class UChatMessageEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChatMessageEntry_C>();
	}
};
DUMPER7_ASSERTS_UChatMessageEntry_C;

SDK_NAMESPACE_END
