#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CMSImageSlideShow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass CMSImageSlideShow.CMSImageSlideShow_C
// 0x0028 (0x0288 - 0x0260)
class UCMSImageSlideShow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonWidgetCarousel*                  Images;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ScrollInterview;                                   // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 CurrentPageIndex)> CarouselIndexChanged;                     // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_CMSImageSlideShow(int32 EntryPoint);
	void BndEvt__Images_K2Node_ComponentBoundEvent_0_OnCurrentPageIndexChanged__DelegateSignature(class UCommonWidgetCarousel* CarouselWidget, int32 CurrentPageIndex);
	void SetMediaURLs(const TArray<class FString>& MediaURLs);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CMSImageSlideShow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CMSImageSlideShow_C")
	}
	static class UCMSImageSlideShow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCMSImageSlideShow_C>();
	}
};
DUMPER7_ASSERTS_UCMSImageSlideShow_C;

SDK_NAMESPACE_END
