#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ComicReader

#include "Basic.hpp"

#include "ComicReader_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ComicReader.FortComicReader.SetCurrentPage
// 0x0004 (0x0004 - 0x0000)
struct FortComicReader_SetCurrentPage final
{
public:
	int32                                         InPageIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicReader_SetCurrentPage;

// Function ComicReader.FortComicReader.GetCurrentPageIndex
// 0x0004 (0x0004 - 0x0000)
struct FortComicReader_GetCurrentPageIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicReader_GetCurrentPageIndex;

// Function ComicReader.FortComicReader.GetCurrentPageNumber
// 0x0004 (0x0004 - 0x0000)
struct FortComicReader_GetCurrentPageNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicReader_GetCurrentPageNumber;

// Function ComicReader.FortComicReader.GetCurrentPanelIndex
// 0x0004 (0x0004 - 0x0000)
struct FortComicReader_GetCurrentPanelIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicReader_GetCurrentPanelIndex;

// Function ComicReader.FortComicReader.GetNumPanelsOnPage
// 0x0008 (0x0008 - 0x0000)
struct FortComicReader_GetNumPanelsOnPage final
{
public:
	int32                                         InPageNum;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicReader_GetNumPanelsOnPage;

// Function ComicReader.FortComicReader.GetTotalPageNumber
// 0x0004 (0x0004 - 0x0000)
struct FortComicReader_GetTotalPageNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicReader_GetTotalPageNumber;

// Function ComicReader.FortComicReader.GetViewMode
// 0x0001 (0x0001 - 0x0000)
struct FortComicReader_GetViewMode final
{
public:
	EFortComicViewMode                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicReader_GetViewMode;

// Function ComicReader.FortComicScreen.HandlePreprocessorNavInput
// 0x0001 (0x0001 - 0x0000)
struct FortComicScreen_HandlePreprocessorNavInput final
{
public:
	EUINavigation                                 InNavDirection;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicScreen_HandlePreprocessorNavInput;

// Function ComicReader.FortComicScreen.OnPreProcessedNavInput
// 0x0001 (0x0001 - 0x0000)
struct FortComicScreen_OnPreProcessedNavInput final
{
public:
	EUINavigation                                 NavInput;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicScreen_OnPreProcessedNavInput;

// Function ComicReader.FortComicScreen.UpdateComicTitle
// 0x0010 (0x0010 - 0x0000)
struct FortComicScreen_UpdateComicTitle final
{
public:
	class FString                                 InComicTitle;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicScreen_UpdateComicTitle;

// Function ComicReader.FortComicScreen.UpdateShowContinueOnLastPage
// 0x0001 (0x0001 - 0x0000)
struct FortComicScreen_UpdateShowContinueOnLastPage final
{
public:
	bool                                          InShowContinue;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortComicScreen_UpdateShowContinueOnLastPage;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
