#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonDialogueRuntime

#include "Basic.hpp"

#include "CommonDialogueRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function CommonDialogueRuntime.ConversationNode.GetDebugParticipantColor
// 0x0018 (0x0018 - 0x0000)
struct ConversationNode_GetDebugParticipantColor final
{
public:
	struct FGameplayTag                           ParticipantID;                                     // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationNode_GetDebugParticipantColor;

// Function CommonDialogueRuntime.ConversationParticipantComponent.ClientExecuteTaskAndSideEffects
// 0x0010 (0x0010 - 0x0000)
struct ConversationParticipantComponent_ClientExecuteTaskAndSideEffects final
{
public:
	struct FConversationNodeHandle                Handle;                                            // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationParticipantComponent_ClientExecuteTaskAndSideEffects;

// Function CommonDialogueRuntime.ConversationParticipantComponent.ClientUpdateConversation
// 0x0068 (0x0068 - 0x0000)
struct ConversationParticipantComponent_ClientUpdateConversation final
{
public:
	struct FClientConversationMessagePayload      Message;                                           // 0x0000(0x0068)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationParticipantComponent_ClientUpdateConversation;

// Function CommonDialogueRuntime.ConversationParticipantComponent.DEBUG_ServerAdvanceConversation
// 0x0010 (0x0010 - 0x0000)
struct ConversationParticipantComponent_DEBUG_ServerAdvanceConversation final
{
public:
	struct FConversationNodeHandle                PickedOption;                                      // 0x0000(0x0010)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationParticipantComponent_DEBUG_ServerAdvanceConversation;

// Function CommonDialogueRuntime.ConversationParticipantComponent.GetParticipantDisplayName
// 0x0018 (0x0018 - 0x0000)
struct ConversationParticipantComponent_GetParticipantDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationParticipantComponent_GetParticipantDisplayName;

// Function CommonDialogueRuntime.ConversationChoiceNode.EvaluateChoice
// 0x0028 (0x0028 - 0x0000)
struct ConversationChoiceNode_EvaluateChoice final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   DisplayOption;                                     // 0x0010(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationChoiceNode_EvaluateChoice;

// Function CommonDialogueRuntime.ConversationContextHelpers.AdvanceConversation
// 0x0010 (0x0010 - 0x0000)
struct ConversationContextHelpers_AdvanceConversation final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationContextHelpers_AdvanceConversation;

// Function CommonDialogueRuntime.ConversationContextHelpers.AdvanceConversationWithChoice
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_AdvanceConversationWithChoice final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGuid                                  ChoiceID;                                          // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationContextHelpers_AdvanceConversationWithChoice;

// Function CommonDialogueRuntime.ConversationContextHelpers.DEBUG_ClientPrintConversation
// 0x0078 (0x0078 - 0x0000)
struct ConversationContextHelpers_DEBUG_ClientPrintConversation final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FClientConversationMessagePayload      Message;                                           // 0x0010(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationContextHelpers_DEBUG_ClientPrintConversation;

// Function CommonDialogueRuntime.ConversationContextHelpers.FindConversationComponent
// 0x0010 (0x0010 - 0x0000)
struct ConversationContextHelpers_FindConversationComponent final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConversationParticipantComponent*      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationContextHelpers_FindConversationComponent;

// Function CommonDialogueRuntime.ConversationContextHelpers.GetConversationInstance
// 0x0018 (0x0018 - 0x0000)
struct ConversationContextHelpers_GetConversationInstance final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UConversationInstance*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationContextHelpers_GetConversationInstance;

// Function CommonDialogueRuntime.ConversationContextHelpers.GetConversationParticipant
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_GetConversationParticipant final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantTag;                                    // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConversationParticipantComponent*      ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationContextHelpers_GetConversationParticipant;

// Function CommonDialogueRuntime.ConversationContextHelpers.GetConversationParticipantActor
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_GetConversationParticipantActor final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantTag;                                    // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationContextHelpers_GetConversationParticipantActor;

// Function CommonDialogueRuntime.ConversationContextHelpers.GetCurrentConversationNodeHandle
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_GetCurrentConversationNodeHandle final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FConversationNodeHandle                ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationContextHelpers_GetCurrentConversationNodeHandle;

// Function CommonDialogueRuntime.ConversationContextHelpers.MakeConversationParticipant
// 0x0020 (0x0020 - 0x0000)
struct ConversationContextHelpers_MakeConversationParticipant final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 ParticipantActor;                                  // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantTag;                                    // 0x0018(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationContextHelpers_MakeConversationParticipant;

// Function CommonDialogueRuntime.ConversationLibrary.GetConversationNode
// 0x0018 (0x0018 - 0x0000)
struct ConversationLibrary_GetConversationNode final
{
public:
	struct FConversationNodeHandle                NodeHandle;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UConversationNode*                ReturnValue;                                       // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationLibrary_GetConversationNode;

// Function CommonDialogueRuntime.ConversationLibrary.StartConversation
// 0x0030 (0x0030 - 0x0000)
struct ConversationLibrary_StartConversation final
{
public:
	struct FGameplayTag                           ConversationEntryTag;                              // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Instigator;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InstigatorTag;                                     // 0x0010(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Target;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           TargetTag;                                         // 0x0020(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConversationInstance*                  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationLibrary_StartConversation;

// Function CommonDialogueRuntime.ConversationRequirementNode.IsRequirementSatisfied
// 0x0018 (0x0018 - 0x0000)
struct ConversationRequirementNode_IsRequirementSatisfied final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EConversationRequirementResult                ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ConversationRequirementNode_IsRequirementSatisfied;

// Function CommonDialogueRuntime.ConversationSideEffectNode.ClientCauseSideEffect
// 0x0010 (0x0010 - 0x0000)
struct ConversationSideEffectNode_ClientCauseSideEffect final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationSideEffectNode_ClientCauseSideEffect;

// Function CommonDialogueRuntime.ConversationSideEffectNode.ServerCauseSideEffect
// 0x0010 (0x0010 - 0x0000)
struct ConversationSideEffectNode_ServerCauseSideEffect final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationSideEffectNode_ServerCauseSideEffect;

// Function CommonDialogueRuntime.ConversationTaskNode.ExecuteTaskNode
// 0x0018 (0x0018 - 0x0000)
struct ConversationTaskNode_ExecuteTaskNode final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EConversationTaskResult                       ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ConversationTaskNode_ExecuteTaskNode;

// Function CommonDialogueRuntime.ConversationTaskNode.GetChoiceList
// 0x0020 (0x0020 - 0x0000)
struct ConversationTaskNode_GetChoiceList final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FClientConversationOptionEntry> ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConversationTaskNode_GetChoiceList;

// Function CommonDialogueRuntime.ConversationTaskNode.GetNodeBodyColor
// 0x0014 (0x0014 - 0x0000)
struct ConversationTaskNode_GetNodeBodyColor final
{
public:
	struct FLinearColor                           BodyColor;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ConversationTaskNode_GetNodeBodyColor;

// Function CommonDialogueRuntime.ConversationTaskNode.IsRequirementSatisfied
// 0x0018 (0x0018 - 0x0000)
struct ConversationTaskNode_IsRequirementSatisfied final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	EConversationRequirementResult                ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ConversationTaskNode_IsRequirementSatisfied;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
