#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonDialogueRuntime

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonDialogueRuntime_structs.hpp"


SDK_NAMESPACE_START

// Class CommonDialogueRuntime.ConversationNode
// 0x0020 (0x0048 - 0x0028)
class UConversationNode : public UObject
{
public:
	class FString                                 NodeName;                                          // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EvalWorldContextObj;                               // 0x0038(0x0008)(BlueprintReadOnly, ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConversationNode*                      ParentNode;                                        // 0x0040(0x0008)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	struct FLinearColor GetDebugParticipantColor(const struct FGameplayTag& ParticipantID) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationNode")
	}
	static class UConversationNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationNode>();
	}
};
DUMPER7_ASSERTS_UConversationNode;

// Class CommonDialogueRuntime.ConversationParticipantComponent
// 0x00B8 (0x0168 - 0x00B0)
class UConversationParticipantComponent : public UActorComponent
{
public:
	uint8                                         Pad_B0[0xA0];                                      // 0x00B0(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UConversationInstance*                  Auth_CurrentConversation;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UConversationInstance*>          Auth_Conversations;                                // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClientConversationEnded();
	void ClientConversationStarted();
	void ClientExecuteTaskAndSideEffects(const struct FConversationNodeHandle& Handle);
	void ClientUpdateConversation(const struct FClientConversationMessagePayload& Message);
	void DEBUG_ServerAdvanceConversation(const struct FConversationNodeHandle& PickedOption);
	class FText GetParticipantDisplayName();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationParticipantComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationParticipantComponent")
	}
	static class UConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationParticipantComponent>();
	}
};
DUMPER7_ASSERTS_UConversationParticipantComponent;

// Class CommonDialogueRuntime.ConversationSubNode
// 0x0000 (0x0048 - 0x0048)
class UConversationSubNode : public UConversationNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationSubNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationSubNode")
	}
	static class UConversationSubNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSubNode>();
	}
};
DUMPER7_ASSERTS_UConversationSubNode;

// Class CommonDialogueRuntime.ConversationChoiceNode
// 0x0018 (0x0060 - 0x0048)
class UConversationChoiceNode final : public UConversationSubNode
{
public:
	class FText                                   DefaultChoiceDisplayText;                          // 0x0048(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

public:
	void EvaluateChoice(const struct FConversationContext& Context, class FText* DisplayOption) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationChoiceNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationChoiceNode")
	}
	static class UConversationChoiceNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationChoiceNode>();
	}
};
DUMPER7_ASSERTS_UConversationChoiceNode;

// Class CommonDialogueRuntime.ConversationContextHelpers
// 0x0000 (0x0028 - 0x0028)
class UConversationContextHelpers final : public UBlueprintFunctionLibrary
{
public:
	static void AdvanceConversation(const struct FConversationContext& Context);
	static void AdvanceConversationWithChoice(const struct FConversationContext& Context, const struct FGuid& ChoiceID);
	static void DEBUG_ClientPrintConversation(const struct FConversationContext& Context, const struct FClientConversationMessagePayload& Message);
	static class UConversationParticipantComponent* FindConversationComponent(class AActor* Actor);
	static class UConversationInstance* GetConversationInstance(const struct FConversationContext& Context);
	static class UConversationParticipantComponent* GetConversationParticipant(const struct FConversationContext& Context, const struct FGameplayTag& ParticipantTag);
	static class AActor* GetConversationParticipantActor(const struct FConversationContext& Context, const struct FGameplayTag& ParticipantTag);
	static struct FConversationNodeHandle GetCurrentConversationNodeHandle(const struct FConversationContext& Context);
	static void MakeConversationParticipant(const struct FConversationContext& Context, class AActor* ParticipantActor, const struct FGameplayTag& ParticipantTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationContextHelpers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationContextHelpers")
	}
	static class UConversationContextHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationContextHelpers>();
	}
};
DUMPER7_ASSERTS_UConversationContextHelpers;

// Class CommonDialogueRuntime.ConversationDatabase
// 0x00B0 (0x00E0 - 0x0030)
class UConversationDatabase final : public UPrimaryDataAsset
{
public:
	TMap<struct FGameplayTag, struct FConversationEntryList> EntryMap;                               // 0x0030(0x0050)(NativeAccessSpecifierPrivate)
	TMap<struct FGuid, class UConversationNode*>  ReachableNodeMap;                                  // 0x0080(0x0050)(NativeAccessSpecifierPrivate)
	TArray<struct FCommonDialogueBankParticipant> Speakers;                                          // 0x00D0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationDatabase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationDatabase")
	}
	static class UConversationDatabase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationDatabase>();
	}
};
DUMPER7_ASSERTS_UConversationDatabase;

// Class CommonDialogueRuntime.ConversationNodeWithLinks
// 0x0010 (0x0058 - 0x0048)
class UConversationNodeWithLinks : public UConversationNode
{
public:
	TArray<struct FGuid>                          OutputConnections;                                 // 0x0048(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationNodeWithLinks")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationNodeWithLinks")
	}
	static class UConversationNodeWithLinks* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationNodeWithLinks>();
	}
};
DUMPER7_ASSERTS_UConversationNodeWithLinks;

// Class CommonDialogueRuntime.ConversationEntryPointNode
// 0x0008 (0x0060 - 0x0058)
class UConversationEntryPointNode final : public UConversationNodeWithLinks
{
public:
	struct FGameplayTag                           EntryTag;                                          // 0x0058(0x0008)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationEntryPointNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationEntryPointNode")
	}
	static class UConversationEntryPointNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationEntryPointNode>();
	}
};
DUMPER7_ASSERTS_UConversationEntryPointNode;

// Class CommonDialogueRuntime.ConversationInstance
// 0x0038 (0x0060 - 0x0028)
class UConversationInstance final : public UObject
{
public:
	struct FConversationParticipants              Participants;                                      // 0x0028(0x0010)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationInstance")
	}
	static class UConversationInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationInstance>();
	}
};
DUMPER7_ASSERTS_UConversationInstance;

// Class CommonDialogueRuntime.ConversationLibrary
// 0x0000 (0x0028 - 0x0028)
class UConversationLibrary final : public UBlueprintFunctionLibrary
{
public:
	static const class UConversationNode* GetConversationNode(const struct FConversationNodeHandle& NodeHandle);
	static class UConversationInstance* StartConversation(const struct FGameplayTag& ConversationEntryTag, class AActor* Instigator, const struct FGameplayTag& InstigatorTag, class AActor* Target, const struct FGameplayTag& TargetTag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationLibrary")
	}
	static class UConversationLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationLibrary>();
	}
};
DUMPER7_ASSERTS_UConversationLibrary;

// Class CommonDialogueRuntime.ConversationRegistry
// 0x00B0 (0x00D8 - 0x0028)
class UConversationRegistry final : public UObject
{
public:
	TArray<class UConversationDatabase*>          HackBanks;                                         // 0x0028(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FConversationEntryList> EntryMap;                               // 0x0038(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, class UConversationNode*>  ReachableNodeMap;                                  // 0x0088(0x0050)(Transient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationRegistry")
	}
	static class UConversationRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationRegistry>();
	}
};
DUMPER7_ASSERTS_UConversationRegistry;

// Class CommonDialogueRuntime.ConversationRequirementNode
// 0x0000 (0x0048 - 0x0048)
class UConversationRequirementNode final : public UConversationSubNode
{
public:
	EConversationRequirementResult IsRequirementSatisfied(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationRequirementNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationRequirementNode")
	}
	static class UConversationRequirementNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationRequirementNode>();
	}
};
DUMPER7_ASSERTS_UConversationRequirementNode;

// Class CommonDialogueRuntime.ConversationSideEffectNode
// 0x0000 (0x0048 - 0x0048)
class UConversationSideEffectNode final : public UConversationSubNode
{
public:
	void ClientCauseSideEffect(const struct FConversationContext& Context) const;
	void ServerCauseSideEffect(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationSideEffectNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationSideEffectNode")
	}
	static class UConversationSideEffectNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationSideEffectNode>();
	}
};
DUMPER7_ASSERTS_UConversationSideEffectNode;

// Class CommonDialogueRuntime.ConversationTaskNode
// 0x0018 (0x0070 - 0x0058)
class UConversationTaskNode : public UConversationNodeWithLinks
{
public:
	TArray<class UConversationSubNode*>           SubNodes;                                          // 0x0058(0x0010)(BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasRequirements : 1;                              // 0x0068(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EConversationTaskResult ExecuteTaskNode(const struct FConversationContext& Context) const;
	TArray<struct FClientConversationOptionEntry> GetChoiceList(const struct FConversationContext& Context) const;
	bool GetNodeBodyColor(struct FLinearColor* BodyColor) const;
	EConversationRequirementResult IsRequirementSatisfied(const struct FConversationContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConversationTaskNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConversationTaskNode")
	}
	static class UConversationTaskNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConversationTaskNode>();
	}
};
DUMPER7_ASSERTS_UConversationTaskNode;

SDK_NAMESPACE_END
