#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonDialogueRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum CommonDialogueRuntime.EConversationRequirementResult
// NumValues: 0x0004
enum class EConversationRequirementResult : uint8
{
	Passed                                   = 0,
	FailedButVisible                         = 1,
	FailedAndHidden                          = 2,
	EConversationRequirementResult_MAX       = 3,
};

// Enum CommonDialogueRuntime.EConversationTaskResult
// NumValues: 0x0002
enum class EConversationTaskResult : uint8
{
	Success                                  = 0,
	EConversationTaskResult_MAX              = 1,
};

// ScriptStruct CommonDialogueRuntime.ConversationContext
// 0x0010 (0x0010 - 0x0000)
struct FConversationContext final
{
public:
	class UConversationInstance*                  ActiveConversation;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConversationNode*                      TaskBeingConsidered;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConversationContext;

// ScriptStruct CommonDialogueRuntime.CommonDialogueBankParticipant
// 0x0030 (0x0030 - 0x0000)
struct FCommonDialogueBankParticipant final
{
public:
	class FText                                   FallbackName;                                      // 0x0000(0x0018)(NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantName;                                   // 0x0018(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NodeTint;                                          // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCommonDialogueBankParticipant;

// ScriptStruct CommonDialogueRuntime.ConversationEntryList
// 0x0010 (0x0010 - 0x0000)
struct FConversationEntryList final
{
public:
	TArray<struct FGuid>                          DestinationList;                                   // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConversationEntryList;

// ScriptStruct CommonDialogueRuntime.ConversationNodeHandle
// 0x0010 (0x0010 - 0x0000)
struct FConversationNodeHandle final
{
public:
	struct FGuid                                  NodeGUID;                                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConversationNodeHandle;

// ScriptStruct CommonDialogueRuntime.ConversationParticipantEntry
// 0x0010 (0x0010 - 0x0000)
struct FConversationParticipantEntry final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ParticipantID;                                     // 0x0008(0x0008)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConversationParticipantEntry;

// ScriptStruct CommonDialogueRuntime.ConversationParticipants
// 0x0010 (0x0010 - 0x0000)
struct FConversationParticipants final
{
public:
	TArray<struct FConversationParticipantEntry>  List;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FConversationParticipants;

// ScriptStruct CommonDialogueRuntime.ClientConversationOptionEntry
// 0x0030 (0x0030 - 0x0000)
struct FClientConversationOptionEntry final
{
public:
	class FText                                   OptionText;                                        // 0x0000(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          IsOptionAvailable;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConversationNodeHandle                NodeReference;                                     // 0x001C(0x0010)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FClientConversationOptionEntry;

// ScriptStruct CommonDialogueRuntime.ClientConversationMessagePayload
// 0x0068 (0x0068 - 0x0000)
struct FClientConversationMessagePayload final
{
public:
	struct FConversationParticipants              Participants;                                      // 0x0000(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FConversationNodeHandle                CurrentNode;                                       // 0x0010(0x0010)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           SpeakerID;                                         // 0x0020(0x0008)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ParticipantDisplayName;                            // 0x0028(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   Message;                                           // 0x0040(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FClientConversationOptionEntry> Options;                                           // 0x0058(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FClientConversationMessagePayload;

SDK_NAMESPACE_END
