#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Creative_Enabled_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Creative_EnabledState_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "EEnabledState_structs.hpp"
#include "Creative_DeviceComponent_Parent_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass Creative_Enabled_Component.Creative_Enabled_Component_C
// 0x00B0 (0x0168 - 0x00B8)
class UCreative_Enabled_Component_C final : public UCreative_DeviceComponent_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Creative_Enabled_Component_C;       // 0x00B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FCreative_EnabledState                 EnabledState;                                      // 0x00C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Enabled)>  On_Enabled_State_Changed;                          // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          EnabledDuringPlayMode;                             // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          EnabledDuringEditMode;                             // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              On_Reset_Complete;                                 // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           Reset_Timer;                                       // 0x00F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<EFortMinigameState>                      IgnorePhases;                                      // 0x00F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ResetDelay;                                        // 0x0148(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Enabled_Index;                                     // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_be_Enabled_During_Edit_Mode;                   // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMinigameLogicComponent*            Logic_Component;                                   // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Switch_On_Phase_Change;                            // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Switch_On_Play_Change;                             // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CanBeEnabledDuringPreview;                         // 0x0162(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Creative_Enabled_Component(int32 EntryPoint);
	void Minigame_Play_Mode_Changed(class AFortMinigame* Minigame, bool bIsInPlayMode);
	void Minigame_State_Changed(class AFortMinigame* Minigame, EFortMinigameState MinigameState);
	void Bind_to_Minigame(class AFortMinigame* Minigame);
	void Initialize_Component(class UFortMinigameLogicComponent* Logic_Component_0, int32 Enabled_Index_0);
	void Set_Enabled_on_Phase(EFortMinigameState State, int32 EnabledIndex);
	void IsEnabled(bool* Enabled);
	void Set_Enabled(bool bEnabled);
	void Set_Enabled_on_Play_Mode(bool Play_Mode);
	void Reset_Delay_Complete();
	void Reset_Delay_Start(float Delay);
	void IsResetting(bool* TRUE_0, float* Remaining_Time);
	void OnRep_EIsEnabled();
	void Can_be_Enabled(bool* TRUE_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Creative_Enabled_Component_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Creative_Enabled_Component_C")
	}
	static class UCreative_Enabled_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreative_Enabled_Component_C>();
	}
};
DUMPER7_ASSERTS_UCreative_Enabled_Component_C;

SDK_NAMESPACE_END
