#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Curie

#include "Basic.hpp"

#include "Curie_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Curie.CurieComponent.HandleOwningActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct CurieComponent_HandleOwningActorDestroyed final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieComponent_HandleOwningActorDestroyed;

// Function Curie.CurieComponent.HasAnyElementAttached
// 0x0028 (0x0028 - 0x0000)
struct CurieComponent_HasAnyElementAttached final
{
public:
	struct FGameplayTagContainer                  ElementIdentifiers;                                // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CurieComponent_HasAnyElementAttached;

// Function Curie.CurieComponent.HasElementAttached
// 0x000C (0x000C - 0x0000)
struct CurieComponent_HasElementAttached final
{
public:
	struct FGameplayTag                           ElementIdentifier;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CurieComponent_HasElementAttached;

// Function Curie.CurieComponent.HasStateAttached
// 0x000C (0x000C - 0x0000)
struct CurieComponent_HasStateAttached final
{
public:
	struct FGameplayTag                           StateIdentifier;                                   // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CurieComponent_HasStateAttached;

// Function Curie.CurieComponent.IsInteractingWithElement
// 0x000C (0x000C - 0x0000)
struct CurieComponent_IsInteractingWithElement final
{
public:
	struct FGameplayTag                           Element;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CurieComponent_IsInteractingWithElement;

// Function Curie.CurieInterface.OnCurieContainerInitialized_BP
// 0x0004 (0x0004 - 0x0000)
struct CurieInterface_OnCurieContainerInitialized_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieContainerInitialized_BP;

// Function Curie.CurieInterface.OnCurieContainerShutdown_BP
// 0x0004 (0x0004 - 0x0000)
struct CurieInterface_OnCurieContainerShutdown_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieContainerShutdown_BP;

// Function Curie.CurieInterface.OnCurieElementAttached_BP
// 0x000C (0x000C - 0x0000)
struct CurieInterface_OnCurieElementAttached_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ElementTag;                                        // 0x0004(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieElementAttached_BP;

// Function Curie.CurieInterface.OnCurieElementDetached_BP
// 0x000C (0x000C - 0x0000)
struct CurieInterface_OnCurieElementDetached_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ElementTag;                                        // 0x0004(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieElementDetached_BP;

// Function Curie.CurieInterface.OnCurieElementInteract_BP
// 0x0020 (0x0020 - 0x0000)
struct CurieInterface_OnCurieElementInteract_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ElementTag;                                        // 0x0004(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractParamsHandle             InteractParamsHandle;                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieElementInteract_BP;

// Function Curie.CurieInterface.OnCurieElementInteractBegun_BP
// 0x0020 (0x0020 - 0x0000)
struct CurieInterface_OnCurieElementInteractBegun_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ElementTag;                                        // 0x0004(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractParamsHandle             InteractParamsHandle;                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieElementInteractBegun_BP;

// Function Curie.CurieInterface.OnCurieElementInteractEnded_BP
// 0x0020 (0x0020 - 0x0000)
struct CurieInterface_OnCurieElementInteractEnded_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ElementTag;                                        // 0x0004(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCurieInteractParamsHandle             InteractParamsHandle;                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieElementInteractEnded_BP;

// Function Curie.CurieInterface.OnCurieStateAttached_BP
// 0x000C (0x000C - 0x0000)
struct CurieInterface_OnCurieStateAttached_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StateTag;                                          // 0x0004(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieStateAttached_BP;

// Function Curie.CurieInterface.OnCurieStateConsumed_BP
// 0x000C (0x000C - 0x0000)
struct CurieInterface_OnCurieStateConsumed_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StateTag;                                          // 0x0004(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieStateConsumed_BP;

// Function Curie.CurieInterface.OnCurieStateDetached_BP
// 0x000C (0x000C - 0x0000)
struct CurieInterface_OnCurieStateDetached_BP final
{
public:
	struct FCurieContainerHandle                  CurieContainerHandle;                              // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StateTag;                                          // 0x0004(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieInterface_OnCurieStateDetached_BP;

// Function Curie.CurieManager.BindDelegateForCurieElementAttached
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_BindDelegateForCurieElementAttached final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_BindDelegateForCurieElementAttached;

// Function Curie.CurieManager.BindDelegateForCurieElementBeginInteract
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_BindDelegateForCurieElementBeginInteract final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_BindDelegateForCurieElementBeginInteract;

// Function Curie.CurieManager.BindDelegateForCurieElementDetached
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_BindDelegateForCurieElementDetached final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_BindDelegateForCurieElementDetached;

// Function Curie.CurieManager.BindDelegateForCurieElementEndInteract
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_BindDelegateForCurieElementEndInteract final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_BindDelegateForCurieElementEndInteract;

// Function Curie.CurieManager.BindDelegateForCurieElementInteract
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_BindDelegateForCurieElementInteract final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_BindDelegateForCurieElementInteract;

// Function Curie.CurieManager.BindDelegateForCurieStateAttached
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_BindDelegateForCurieStateAttached final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& StateIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_BindDelegateForCurieStateAttached;

// Function Curie.CurieManager.BindDelegateForCurieStateDetached
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_BindDelegateForCurieStateDetached final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& StateIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_BindDelegateForCurieStateDetached;

// Function Curie.CurieManager.UnbindDelegateForCurieElementAttached
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_UnbindDelegateForCurieElementAttached final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_UnbindDelegateForCurieElementAttached;

// Function Curie.CurieManager.UnbindDelegateForCurieElementBeginInteract
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_UnbindDelegateForCurieElementBeginInteract final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_UnbindDelegateForCurieElementBeginInteract;

// Function Curie.CurieManager.UnbindDelegateForCurieElementDetached
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_UnbindDelegateForCurieElementDetached final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_UnbindDelegateForCurieElementDetached;

// Function Curie.CurieManager.UnbindDelegateForCurieElementEndInteract
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_UnbindDelegateForCurieElementEndInteract final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_UnbindDelegateForCurieElementEndInteract;

// Function Curie.CurieManager.UnbindDelegateForCurieElementInteract
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_UnbindDelegateForCurieElementInteract final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& ElementIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_UnbindDelegateForCurieElementInteract;

// Function Curie.CurieManager.UnbindDelegateForCurieStateAttached
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_UnbindDelegateForCurieStateAttached final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& StateIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_UnbindDelegateForCurieStateAttached;

// Function Curie.CurieManager.UnbindDelegateForCurieStateDetached
// 0x0018 (0x0018 - 0x0000)
struct CurieManager_UnbindDelegateForCurieStateDetached final
{
public:
	class UObject*                                CurieOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Owner, const struct FCurieContainerHandle& ContainerHandle, const struct FGameplayTag& StateIdentifier)> Delegate; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CurieManager_UnbindDelegateForCurieStateDetached;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
