#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomLocomotionLayerInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function CustomLocomotionLayerInterface.CustomLocomotionLayerInterface_C.CustomLocomotionFullBodyLayer
// 0x0020 (0x0020 - 0x0000)
struct CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer final
{
public:
	struct FPoseLink                              PassThroughCustomFullBody;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CustomLocomotionFullBodyLayer_0;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyLayer;

// Function CustomLocomotionLayerInterface.CustomLocomotionLayerInterface_C.CustomLocomotionPreIKLayer
// 0x0020 (0x0020 - 0x0000)
struct CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer final
{
public:
	struct FPoseLink                              InPosePreIK;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CustomLocomotionPreIKLayer_0;                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_CustomLocomotionLayerInterface_C_CustomLocomotionPreIKLayer;

// Function CustomLocomotionLayerInterface.CustomLocomotionLayerInterface_C.CustomLocomotionFullBodyAdditive
// 0x0020 (0x0020 - 0x0000)
struct CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyAdditive final
{
public:
	struct FPoseLink                              InPoseFullBodyAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CustomLocomotionFullBodyAdditive_0;                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_CustomLocomotionLayerInterface_C_CustomLocomotionFullBodyAdditive;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
