#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_Butterfly

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function DA_Butterfly.DA_Butterfly_C.ExecuteUbergraph_DA_Butterfly
// 0x00D8 (0x00D8 - 0x0000)
struct DA_Butterfly_C_ExecuteUbergraph_DA_Butterfly final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDecoHelper*                        K2Node_Event_FortDecoHelper_2;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0018(0x00B0)()
	class AFortDecoHelper*                        K2Node_Event_FortDecoHelper_1;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDecoHelper*                        K2Node_Event_FortDecoHelper;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DA_Butterfly_C_ExecuteUbergraph_DA_Butterfly;

// Function DA_Butterfly.DA_Butterfly_C.BPReleaseSecondaryFire
// 0x0008 (0x0008 - 0x0000)
struct DA_Butterfly_C_BPReleaseSecondaryFire final
{
public:
	class AFortDecoHelper*                        FortDecoHelper;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DA_Butterfly_C_BPReleaseSecondaryFire;

// Function DA_Butterfly.DA_Butterfly_C.BPPressTrigger
// 0x0008 (0x0008 - 0x0000)
struct DA_Butterfly_C_BPPressTrigger final
{
public:
	class AFortDecoHelper*                        FortDecoHelper;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DA_Butterfly_C_BPPressTrigger;

// Function DA_Butterfly.DA_Butterfly_C.BPPressSecondaryFire
// 0x0008 (0x0008 - 0x0000)
struct DA_Butterfly_C_BPPressSecondaryFire final
{
public:
	class AFortDecoHelper*                        FortDecoHelper;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DA_Butterfly_C_BPPressSecondaryFire;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
