#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataAssetDirectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class DataAssetDirectory.DataAssetDirectoryManager
// 0x00D0 (0x00F8 - 0x0028)
class UDataAssetDirectoryManager : public UObject
{
public:
	uint8                                         Pad_28[0xB8];                                      // 0x0028(0x00B8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              LastUpdateCheck;                                   // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdateCheckPending;                               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        UpdateCheckLimitSeconds;                           // 0x00EC(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnabled;                                          // 0x00F0(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DataAssetDirectoryManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DataAssetDirectoryManager")
	}
	static class UDataAssetDirectoryManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDataAssetDirectoryManager>();
	}
};
DUMPER7_ASSERTS_UDataAssetDirectoryManager;

SDK_NAMESPACE_END
