#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Donut_ComicBubble

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass Donut_ComicBubble.Donut_ComicBubble_C
// 0x0058 (0x02B8 - 0x0260)
class UDonut_ComicBubble_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_ComicBubble;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Dialogue;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              TailRendTrans;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DialogueTime;                                      // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DialogueText;                                      // 0x0298(0x0018)(Edit, BlueprintVisible)
	bool                                          bUseAlternateImage;                                // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bUseDownArrow;                                     // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bWhiteBubble;                                      // 0x02B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DownArrowSelection;                                // 0x02B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Donut_ComicBubble(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void StartDialogueSequence();
	void OnDialogueFinished();
	void DialogueTimeOut();
	void Construct();
	void IntroFinished();
	void SetNewDialogue(const class FText& NewText, float DisplayTime);
	void StartExistingDialogue();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Donut_ComicBubble_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Donut_ComicBubble_C")
	}
	static class UDonut_ComicBubble_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDonut_ComicBubble_C>();
	}
};
DUMPER7_ASSERTS_UDonut_ComicBubble_C;

SDK_NAMESPACE_END
