#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EntityCore_classes.hpp"
#include "EntityActor_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Class EntityActor.EntityActorPlayerComponent
// 0x0078 (0x00D8 - 0x0060)
class UEntityActorPlayerComponent final : public UEntityDataBackedComponent
{
public:
	TSoftObjectPtr<class APlayerController>       PlayerControllerCache;                             // 0x0060(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class APlayerState>            PlayerStateCache;                                  // 0x0088(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FUniqueNetIdRepl                       PlayerId;                                          // 0x00B0(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorPlayerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorPlayerComponent")
	}
	static class UEntityActorPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorPlayerComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorPlayerComponent;

// Class EntityActor.ActorToEntityAdapterComponent
// 0x0020 (0x00D0 - 0x00B0)
class UActorToEntityAdapterComponent final : public UActorComponent
{
public:
	int32                                         EntityID;                                          // 0x00B0(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEntityComponent*>               SerializedComponents;                              // 0x00B8(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorToEntityAdapterComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorToEntityAdapterComponent")
	}
	static class UActorToEntityAdapterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorToEntityAdapterComponent>();
	}
};
DUMPER7_ASSERTS_UActorToEntityAdapterComponent;

// Class EntityActor.EntityActorRotationComponent
// 0x0018 (0x0078 - 0x0060)
class UEntityActorRotationComponent final : public UEntityRotationComponent
{
public:
	struct FRotator                               ShadowVar_Rotation;                                // 0x0060(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0xC];                                       // 0x006C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRootComponentChanged(class USceneComponent* InRootComponent, bool bIsRootComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorRotationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorRotationComponent")
	}
	static class UEntityActorRotationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorRotationComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorRotationComponent;

// Class EntityActor.EntityActorCollisionComponent
// 0x0078 (0x00F0 - 0x0078)
class UEntityActorCollisionComponent final : public UEntityEnableableComponent
{
public:
	uint8                                         Pad_78[0x48];                                      // 0x0078(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPrimitiveComponent>     PrimitiveComponentCache;                           // 0x00C0(0x0028)(ExportObject, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNativeComponentBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnNativeComponentEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnNativeComponentHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorCollisionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorCollisionComponent")
	}
	static class UEntityActorCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorCollisionComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorCollisionComponent;

// Class EntityActor.EntityActorCustomReplicationComponent
// 0x0008 (0x0060 - 0x0058)
class UEntityActorCustomReplicationComponent final : public UEntityComponent
{
public:
	EEntityActorReplicationOverrideType           ReplicationOverride;                               // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EEntityActorReplicationRelevancyBucketType    ReplicationRelevancyBucketType;                    // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomReplicationRelevancyRange;                   // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorCustomReplicationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorCustomReplicationComponent")
	}
	static class UEntityActorCustomReplicationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorCustomReplicationComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorCustomReplicationComponent;

// Class EntityActor.EntityActorScaleComponent
// 0x0018 (0x0078 - 0x0060)
class UEntityActorScaleComponent final : public UEntityScaleComponent
{
public:
	struct FVector                                ShadowVar_Scale;                                   // 0x0060(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0xC];                                       // 0x006C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRootComponentChanged(class USceneComponent* InRootComponent, bool bIsRootComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorScaleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorScaleComponent")
	}
	static class UEntityActorScaleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorScaleComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorScaleComponent;

// Class EntityActor.EntityActorLocalInputComponent
// 0x0008 (0x0060 - 0x0058)
class UEntityActorLocalInputComponent final : public UEntityComponent
{
public:
	EAutoReceiveInput                             AutoReceiveControllerInput;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorLocalInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorLocalInputComponent")
	}
	static class UEntityActorLocalInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorLocalInputComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorLocalInputComponent;

// Class EntityActor.EntityActorPositionComponent
// 0x0018 (0x0078 - 0x0060)
class UEntityActorPositionComponent final : public UEntityPositionComponent
{
public:
	struct FVector                                ShadowVar_Location;                                // 0x0060(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6C[0xC];                                       // 0x006C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRootComponentChanged(class USceneComponent* InRootComponent, bool bIsRootComponent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorPositionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorPositionComponent")
	}
	static class UEntityActorPositionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorPositionComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorPositionComponent;

// Class EntityActor.EntityActorSkeletalMeshRenderComponent
// 0x0020 (0x0078 - 0x0058)
class UEntityActorSkeletalMeshRenderComponent final : public UEntityComponent
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          ShadowVar_SkeletalMesh;                            // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECollisionEnabled                             ShadowVar_EnableCollision;                         // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorSkeletalMeshRenderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorSkeletalMeshRenderComponent")
	}
	static class UEntityActorSkeletalMeshRenderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorSkeletalMeshRenderComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorSkeletalMeshRenderComponent;

// Class EntityActor.EntityActorStaticMeshRenderComponent
// 0x0030 (0x00A8 - 0x0078)
class UEntityActorStaticMeshRenderComponent final : public UEntityEnableableComponent
{
public:
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            ShadowVar_StaticMesh;                              // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMaterialInterface*>             ShadowVar_MeshMaterials;                           // 0x0090(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECollisionEnabled                             ShadowVar_EnableCollision;                         // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         TargetMeshIndex;                                   // 0x00A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         ShadowVar_Visible : 1;                             // 0x00A2(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShadowVar_MaxDrawDistance;                         // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorStaticMeshRenderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorStaticMeshRenderComponent")
	}
	static class UEntityActorStaticMeshRenderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorStaticMeshRenderComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorStaticMeshRenderComponent;

// Class EntityActor.EntityActorSubsystem
// 0x0020 (0x0050 - 0x0030)
class UEntityActorSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorSubsystem")
	}
	static class UEntityActorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorSubsystem>();
	}
};
DUMPER7_ASSERTS_UEntityActorSubsystem;

// Class EntityActor.EntityActorTextDisplayComponent
// 0x0028 (0x0080 - 0x0058)
class UEntityActorTextDisplayComponent final : public UEntityComponent
{
public:
	class FText                                   DisplayText;                                       // 0x0058(0x0018)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EHorizTextAligment GetHorizontalAlignment();
	struct FVector GetRelativeLocation();
	EVerticalTextAligment GetVerticalAlignment();
	void SetHorizontalAlignment(EHorizTextAligment Value);
	void SetRelativeLocation(const struct FVector& RelativeLocation);
	void SetRelativeRotation(const struct FRotator& RelativeRotation);
	void SetRelativeScale(const struct FVector& RelativeScale);
	void SetText(const class FText& Text);
	void SetTextRenderColor(const struct FColor& Value);
	void SetVerticalAlignment(EVerticalTextAligment Value);
	void SetWorldSize(float Value);

	class FText GetText() const;
	struct FColor GetTextRenderColor() const;
	float GetWorldSize() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityActorTextDisplayComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityActorTextDisplayComponent")
	}
	static class UEntityActorTextDisplayComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityActorTextDisplayComponent>();
	}
};
DUMPER7_ASSERTS_UEntityActorTextDisplayComponent;

// Class EntityActor.EntityDynamicActivationComponent
// 0x0038 (0x00B0 - 0x0078)
class UEntityDynamicActivationComponent final : public UEntityEnableableComponent
{
public:
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransitionTargetTime;                              // 0x0080(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTargetState;                                      // 0x0084(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEntityComponent*>               LinkedComponents;                                  // 0x0088(0x0010)(Net, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x18];                                      // 0x0098(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnabledChanged(bool bIsEnabled);
	void OnRep_TransitionTarget();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityDynamicActivationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityDynamicActivationComponent")
	}
	static class UEntityDynamicActivationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityDynamicActivationComponent>();
	}
};
DUMPER7_ASSERTS_UEntityDynamicActivationComponent;

// Class EntityActor.EntityToActorAdapterComponent
// 0x0008 (0x0060 - 0x0058)
class UEntityToActorAdapterComponent final : public UEntityComponent
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0058(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EntityToActorAdapterComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EntityToActorAdapterComponent")
	}
	static class UEntityToActorAdapterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEntityToActorAdapterComponent>();
	}
};
DUMPER7_ASSERTS_UEntityToActorAdapterComponent;

// Class EntityActor.SimObject
// 0x0000 (0x0220 - 0x0220)
class ASimObject final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimObject")
	}
	static class ASimObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASimObject>();
	}
};
DUMPER7_ASSERTS_ASimObject;

SDK_NAMESPACE_END
