#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EntityActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function EntityActor.EntityActorRotationComponent.OnRootComponentChanged
// 0x0010 (0x0010 - 0x0000)
struct EntityActorRotationComponent_OnRootComponentChanged final
{
public:
	class USceneComponent*                        InRootComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRootComponent;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EntityActorRotationComponent_OnRootComponentChanged;

// Function EntityActor.EntityActorCollisionComponent.OnNativeComponentBeginOverlap
// 0x00B0 (0x00B0 - 0x0000)
struct EntityActorCollisionComponent_OnNativeComponentBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EntityActorCollisionComponent_OnNativeComponentBeginOverlap;

// Function EntityActor.EntityActorCollisionComponent.OnNativeComponentEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct EntityActorCollisionComponent_OnNativeComponentEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EntityActorCollisionComponent_OnNativeComponentEndOverlap;

// Function EntityActor.EntityActorCollisionComponent.OnNativeComponentHit
// 0x00B0 (0x00B0 - 0x0000)
struct EntityActorCollisionComponent_OnNativeComponentHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0024(0x008C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorCollisionComponent_OnNativeComponentHit;

// Function EntityActor.EntityActorScaleComponent.OnRootComponentChanged
// 0x0010 (0x0010 - 0x0000)
struct EntityActorScaleComponent_OnRootComponentChanged final
{
public:
	class USceneComponent*                        InRootComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRootComponent;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EntityActorScaleComponent_OnRootComponentChanged;

// Function EntityActor.EntityActorPositionComponent.OnRootComponentChanged
// 0x0010 (0x0010 - 0x0000)
struct EntityActorPositionComponent_OnRootComponentChanged final
{
public:
	class USceneComponent*                        InRootComponent;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsRootComponent;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EntityActorPositionComponent_OnRootComponentChanged;

// Function EntityActor.EntityActorTextDisplayComponent.GetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct EntityActorTextDisplayComponent_GetHorizontalAlignment final
{
public:
	EHorizTextAligment                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_GetHorizontalAlignment;

// Function EntityActor.EntityActorTextDisplayComponent.GetRelativeLocation
// 0x000C (0x000C - 0x0000)
struct EntityActorTextDisplayComponent_GetRelativeLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_GetRelativeLocation;

// Function EntityActor.EntityActorTextDisplayComponent.GetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct EntityActorTextDisplayComponent_GetVerticalAlignment final
{
public:
	EVerticalTextAligment                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_GetVerticalAlignment;

// Function EntityActor.EntityActorTextDisplayComponent.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct EntityActorTextDisplayComponent_SetHorizontalAlignment final
{
public:
	EHorizTextAligment                            Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_SetHorizontalAlignment;

// Function EntityActor.EntityActorTextDisplayComponent.SetRelativeLocation
// 0x000C (0x000C - 0x0000)
struct EntityActorTextDisplayComponent_SetRelativeLocation final
{
public:
	struct FVector                                RelativeLocation;                                  // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_SetRelativeLocation;

// Function EntityActor.EntityActorTextDisplayComponent.SetRelativeRotation
// 0x000C (0x000C - 0x0000)
struct EntityActorTextDisplayComponent_SetRelativeRotation final
{
public:
	struct FRotator                               RelativeRotation;                                  // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_SetRelativeRotation;

// Function EntityActor.EntityActorTextDisplayComponent.SetRelativeScale
// 0x000C (0x000C - 0x0000)
struct EntityActorTextDisplayComponent_SetRelativeScale final
{
public:
	struct FVector                                RelativeScale;                                     // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_SetRelativeScale;

// Function EntityActor.EntityActorTextDisplayComponent.SetText
// 0x0018 (0x0018 - 0x0000)
struct EntityActorTextDisplayComponent_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_SetText;

// Function EntityActor.EntityActorTextDisplayComponent.SetTextRenderColor
// 0x0004 (0x0004 - 0x0000)
struct EntityActorTextDisplayComponent_SetTextRenderColor final
{
public:
	struct FColor                                 Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_SetTextRenderColor;

// Function EntityActor.EntityActorTextDisplayComponent.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct EntityActorTextDisplayComponent_SetVerticalAlignment final
{
public:
	EVerticalTextAligment                         Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_SetVerticalAlignment;

// Function EntityActor.EntityActorTextDisplayComponent.SetWorldSize
// 0x0004 (0x0004 - 0x0000)
struct EntityActorTextDisplayComponent_SetWorldSize final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_SetWorldSize;

// Function EntityActor.EntityActorTextDisplayComponent.GetText
// 0x0018 (0x0018 - 0x0000)
struct EntityActorTextDisplayComponent_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_GetText;

// Function EntityActor.EntityActorTextDisplayComponent.GetTextRenderColor
// 0x0004 (0x0004 - 0x0000)
struct EntityActorTextDisplayComponent_GetTextRenderColor final
{
public:
	struct FColor                                 ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_GetTextRenderColor;

// Function EntityActor.EntityActorTextDisplayComponent.GetWorldSize
// 0x0004 (0x0004 - 0x0000)
struct EntityActorTextDisplayComponent_GetWorldSize final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityActorTextDisplayComponent_GetWorldSize;

// Function EntityActor.EntityDynamicActivationComponent.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct EntityDynamicActivationComponent_OnEnabledChanged final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EntityDynamicActivationComponent_OnEnabledChanged;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
