#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicCMS

#include "Basic.hpp"


SDK_NAMESPACE_START

// ScriptStruct EpicCMS.DownloadCacheEntry
// 0x0028 (0x0028 - 0x0000)
struct FDownloadCacheEntry final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceUrl;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        LastAccessTime;                                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDownloadCacheEntry;

// ScriptStruct EpicCMS.DownloadCache
// 0x0058 (0x0058 - 0x0000)
struct FDownloadCache final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Version;                                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FString, struct FDownloadCacheEntry> Cache;                                           // 0x0008(0x0050)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FDownloadCache;

SDK_NAMESPACE_END
