#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EsportsCameraClient

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CommonUI_classes.hpp"


SDK_NAMESPACE_START

// Class EsportsCameraClient.EsportsCameraClient
// 0x0040 (0x0370 - 0x0330)
class AEsportsCameraClient final : public AActor
{
public:
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AWebCamReader*                          WebCamReader;                                      // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AWebCamViewer*                          WebCamViewer;                                      // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AM3U8MovieViewer*                       M3U8MovieViewer;                                   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_358[0x18];                                     // 0x0358(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasDynamicMaterial();
	bool IsPlatformEnabled();
	bool IsPlayingWebMovie();
	void SetDynamicMaterial(class UMaterialInstanceDynamic* MaterialInstanceDynamic);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EsportsCameraClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EsportsCameraClient")
	}
	static class AEsportsCameraClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEsportsCameraClient>();
	}
};
DUMPER7_ASSERTS_AEsportsCameraClient;

// Class EsportsCameraClient.EsportsCameraStatusBase
// 0x0000 (0x0238 - 0x0238)
class UEsportsCameraStatusBase final : public UCommonUserWidget
{
public:
	void FollowedPlayerChanged(class AEsportsCameraClient* InEsportsCameraClient);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EsportsCameraStatusBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EsportsCameraStatusBase")
	}
	static class UEsportsCameraStatusBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEsportsCameraStatusBase>();
	}
};
DUMPER7_ASSERTS_UEsportsCameraStatusBase;

// Class EsportsCameraClient.WebCamBase
// 0x0048 (0x0378 - 0x0330)
class AWebCamBase : public AActor
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             DynamicTexture;                                    // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 DynamicColors;                                     // 0x0348(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_358[0x20];                                     // 0x0358(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WebCamBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WebCamBase")
	}
	static class AWebCamBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWebCamBase>();
	}
};
DUMPER7_ASSERTS_AWebCamBase;

// Class EsportsCameraClient.M3U8MovieViewer
// 0x0040 (0x03B8 - 0x0378)
class AM3U8MovieViewer final : public AWebCamBase
{
public:
	uint8                                         Pad_378[0x28];                                     // 0x0378(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AudioComponent;                                    // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMySoundWave*                           MySoundWave;                                       // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B0[0x8];                                      // 0x03B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("M3U8MovieViewer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"M3U8MovieViewer")
	}
	static class AM3U8MovieViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AM3U8MovieViewer>();
	}
};
DUMPER7_ASSERTS_AM3U8MovieViewer;

// Class EsportsCameraClient.MySoundWave
// 0x0010 (0x02A0 - 0x0290)
class UMySoundWave final : public USoundWaveProcedural
{
public:
	uint8                                         Pad_290[0x10];                                     // 0x0290(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MySoundWave")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MySoundWave")
	}
	static class UMySoundWave* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMySoundWave>();
	}
};
DUMPER7_ASSERTS_UMySoundWave;

// Class EsportsCameraClient.WebCamReader
// 0x0000 (0x0378 - 0x0378)
class AWebCamReader final : public AWebCamBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WebCamReader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WebCamReader")
	}
	static class AWebCamReader* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWebCamReader>();
	}
};
DUMPER7_ASSERTS_AWebCamReader;

// Class EsportsCameraClient.WebCamViewer
// 0x0008 (0x0380 - 0x0378)
class AWebCamViewer final : public AWebCamBase
{
public:
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WebCamViewer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WebCamViewer")
	}
	static class AWebCamViewer* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWebCamViewer>();
	}
};
DUMPER7_ASSERTS_AWebCamViewer;

SDK_NAMESPACE_END
