#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventRewardToken

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass EventRewardToken.EventRewardToken_C
// 0x0028 (0x05E0 - 0x05B8)
class UEventRewardToken_C final : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEventRewardTokenUnlockedEventInfo_C*   EventRewardTokenUnlockedEventInfo;                 // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownPin_C*                         ShowdownPin;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Description;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Header;                                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_EventRewardToken(int32 EntryPoint);
	void RefreshDataBP();
	void SetEventTokenRewarded(const class FString& EventToken);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("EventRewardToken_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EventRewardToken_C")
	}
	static class UEventRewardToken_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventRewardToken_C>();
	}
};
DUMPER7_ASSERTS_UEventRewardToken_C;

SDK_NAMESPACE_END
