#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventModeUI

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function EventModeUI.FocusButton.HandleCanUseEventModeFocusChanged
// 0x0001 (0x0001 - 0x0000)
struct FocusButton_HandleCanUseEventModeFocusChanged final
{
public:
	bool                                          bCanUseEventModeFocus;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FocusButton_HandleCanUseEventModeFocusChanged;

// Function EventModeUI.FocusButton.HandleEventModeFocusingChanged
// 0x0001 (0x0001 - 0x0000)
struct FocusButton_HandleEventModeFocusingChanged final
{
public:
	bool                                          bIsEventModeFocusing;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FocusButton_HandleEventModeFocusingChanged;

// Function EventModeUI.FortEventModeEmotesWidget.OnFocusAvailableChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEventModeEmotesWidget_OnFocusAvailableChanged final
{
public:
	bool                                          bIsFocusAvailable;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEventModeEmotesWidget_OnFocusAvailableChanged;

// Function EventModeUI.FortEventModeEmotesWidget.OnFocusStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortEventModeEmotesWidget_OnFocusStateChanged final
{
public:
	bool                                          bIsFocusing;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortEventModeEmotesWidget_OnFocusStateChanged;

// Function EventModeUI.FortMobileActionButtonBehavior_Focus.HandleCanUseEventModeFocusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortMobileActionButtonBehavior_Focus_HandleCanUseEventModeFocusChanged final
{
public:
	bool                                          bCanUseEventModeFocus;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMobileActionButtonBehavior_Focus_HandleCanUseEventModeFocusChanged;

// Function EventModeUI.FortMobileActionButtonBehavior_Focus.HandleEventModeFocusingChanged
// 0x0001 (0x0001 - 0x0000)
struct FortMobileActionButtonBehavior_Focus_HandleEventModeFocusingChanged final
{
public:
	bool                                          bIsEventModeFocusing;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMobileActionButtonBehavior_Focus_HandleEventModeFocusingChanged;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
