#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass F_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP.F_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP_C
// 0x1938 (0x1BA0 - 0x0268)
class UF_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1F4BA0D147CE9E97E7E47A9CA160C150; // 0x0278(0x0020)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_73297F254DCA29F7D7E7848BDA744A01; // 0x0298(0x0048)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_BF5713A24EFD0260177F3F9DC7C0A6E8; // 0x02E0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_BBD97A1F413E756610269793FCFA4A4B; // 0x05F0(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6B9B8D1C47CEAB28BC6A9E97D0EBE17F; // 0x0900(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4297175F4B336DBE441B3ABF3F951550; // 0x0C10(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_FC8223E94A3124815785459278BC15BC; // 0x0F20(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_55AEE8AE467781F7673AB780CF6021D0; // 0x1230(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3C7395974B52ED1987E8478BC87BD394; // 0x1540(0x0310)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5569A6794DBFADE620E1D0860CCB8702; // 0x1850(0x0310)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_DCF2BA6446920D16AAF7DCB72A58B3BF; // 0x1B60(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2D8FAC7546DBB98E3E6B8583BCAA628A; // 0x1B80(0x0020)()

public:
	void ExecuteUbergraph_F_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("F_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"F_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP_C")
	}
	static class UF_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_UF_MED_ASN_DarkNinja_Head_01_Dyn_AnimBP_C;

SDK_NAMESPACE_END
