#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FeaturedCreativeContent

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function FeaturedCreativeContent.FeaturedCreativeContent_C.ExecuteUbergraph_FeaturedCreativeContent
// 0x0030 (0x0030 - 0x0000)
struct FeaturedCreativeContent_C_ExecuteUbergraph_FeaturedCreativeContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_Event_MediaURLs;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FCreativeAdData>                K2Node_Event_AdMetadata;                           // 0x0018(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_CurrentPageIndex;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FeaturedCreativeContent_C_ExecuteUbergraph_FeaturedCreativeContent;

// Function FeaturedCreativeContent.FeaturedCreativeContent_C.BndEvt__CMSImageSlideShow_K2Node_ComponentBoundEvent_0_CarouselIndexChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FeaturedCreativeContent_C_BndEvt__CMSImageSlideShow_K2Node_ComponentBoundEvent_0_CarouselIndexChanged__DelegateSignature final
{
public:
	int32                                         CurrentPageIndex;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FeaturedCreativeContent_C_BndEvt__CMSImageSlideShow_K2Node_ComponentBoundEvent_0_CarouselIndexChanged__DelegateSignature;

// Function FeaturedCreativeContent.FeaturedCreativeContent_C.OnSetupAds
// 0x0020 (0x0020 - 0x0000)
struct FeaturedCreativeContent_C_OnSetupAds final
{
public:
	TArray<class FString>                         MediaURLs;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	TArray<struct FCreativeAdData>                AdMetadata;                                        // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FeaturedCreativeContent_C_OnSetupAds;

// Function FeaturedCreativeContent.FeaturedCreativeContent_C.SetFeaturedContentDetails
// 0x00C0 (0x00C0 - 0x0000)
struct FeaturedCreativeContent_C_SetFeaturedContentDetails final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCreativeAdData                        CurrentAd;                                         // 0x0008(0x0068)(Edit, BlueprintVisible)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00A0(0x0018)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FeaturedCreativeContent_C_SetFeaturedContentDetails;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
