#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FloatingInteraction_Indicator_BattlePass

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function FloatingInteraction_Indicator_BattlePass.FloatingInteraction_Indicator_BattlePass_C.ExecuteUbergraph_FloatingInteraction_Indicator_BattlePass
// 0x0030 (0x0030 - 0x0000)
struct FloatingInteraction_Indicator_BattlePass_C_ExecuteUbergraph_FloatingInteraction_Indicator_BattlePass final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FloatingInteraction_Indicator_BattlePass_C_ExecuteUbergraph_FloatingInteraction_Indicator_BattlePass;

// Function FloatingInteraction_Indicator_BattlePass.FloatingInteraction_Indicator_BattlePass_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FloatingInteraction_Indicator_BattlePass_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FloatingInteraction_Indicator_BattlePass_C_PreConstruct;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
