#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Flopper_Gadget_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass Flopper_Gadget_AnimBP.Flopper_Gadget_AnimBP_C
// 0x0560 (0x0820 - 0x02C0)
class UFlopper_Gadget_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x02D0(0x0018)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02E8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0308(0x0020)()
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Trail                        AnimGraphNode_Trail_1;                             // 0x0330(0x0260)()
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x0590(0x0260)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x07F0(0x0030)()

public:
	void ExecuteUbergraph_Flopper_Gadget_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Flopper_Gadget_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Flopper_Gadget_AnimBP_C")
	}
	static class UFlopper_Gadget_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlopper_Gadget_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_UFlopper_Gadget_AnimBP_C;

SDK_NAMESPACE_END
