#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FloppingRabbitLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ExecuteUbergraph_FloppingRabbitLayerAnimBP
// 0x0030 (0x0030 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ExecuteUbergraph_FloppingRabbitLayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_FloppingRabbit_Weap_Athena_C*        K2Node_DynamicCast_AsB_Flopping_Rabbit_Weap_Athena; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ExecuteUbergraph_FloppingRabbitLayerAnimBP;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_BlueprintUpdateAnimation;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_AnimGraph;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemSwimJumpStart
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemSwimJumpStart final
{
public:
	struct FPoseLink                              ItemSwimJumpStart_0;                               // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemSwimJumpStart;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemRelaxedEntry
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemRelaxedEntry final
{
public:
	struct FPoseLink                              InPoseRelaxedEntry;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemRelaxedEntry_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemRelaxedEntry;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemLowerBodyJogPostPivot
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemLowerBodyJogPostPivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPostPivot;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogPostPivot_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemLowerBodyJogPostPivot;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemLowerBodyJogPrePivot
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemLowerBodyJogPrePivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPrePivot;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogPrePivot_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemLowerBodyJogPrePivot;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemLowerBodyJogStop
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemLowerBodyJogStop final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStop;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogStop_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemLowerBodyJogStop;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemLowerBodyJogStart
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemLowerBodyJogStart final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStart;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogStart_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemLowerBodyJogStart;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemLowerBodyLeanAdditive
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemLowerBodyLeanAdditive final
{
public:
	struct FPoseLink                              InPoseLowerBodyLeanAdditive;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyLeanAdditive_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemLowerBodyLeanAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemLowerBodyMovement
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemLowerBodyMovement final
{
public:
	struct FPoseLink                              InPoseLowerBodyMovement;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyMovement_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemLowerBodyMovement;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemJogPostPivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemJogPostPivotAdditive final
{
public:
	struct FPoseLink                              InPosePostPivotAdditive;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPostPivotAdditive_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemJogPostPivotAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemJogPrePivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemJogPrePivotAdditive final
{
public:
	struct FPoseLink                              InPosePrePivotAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPrePivotAdditive_0;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemJogPrePivotAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemJogStopAdditive
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemJogStopAdditive final
{
public:
	struct FPoseLink                              InPoseJogStopAdditive;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStopAdditive_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemJogStopAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemJogStartAdditive
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemJogStartAdditive final
{
public:
	struct FPoseLink                              InPoseJogStartAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStartAdditive_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemJogStartAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemFlyModeLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemFlyModeLoopAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeLoopAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemFlyModeLoopAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemFlyModeStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemFlyModeStartAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemFlyModeStartAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemZipLineStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemZipLineStartAdditive final
{
public:
	struct FPoseLink                              ItemZipLineStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemZipLineStartAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemJetPackJumpAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemJetPackJumpAdditive final
{
public:
	struct FPoseLink                              ItemJetPackJumpAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemJetPackJumpAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemJetPackStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemJetPackStartAdditive final
{
public:
	struct FPoseLink                              ItemJetPackStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemJetPackStartAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemFallLandAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemFallLandAdditive final
{
public:
	struct FPoseLink                              ItemFallLandAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemFallLandAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemFallAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemFallAdditive final
{
public:
	struct FPoseLink                              ItemFallAdditive_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemFallAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemJumpLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemJumpLoopAdditive final
{
public:
	struct FPoseLink                              ItemJumpLoopAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemJumpLoopAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemJumpUpAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemJumpUpAdditive final
{
public:
	struct FPoseLink                              ItemJumpUpAdditive_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemJumpUpAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemSlopeSliding
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemSlopeSliding final
{
public:
	struct FPoseLink                              ItemSlopeSliding_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemSlopeSliding;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemCrouchTurningAdditive
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemCrouchTurningAdditive final
{
public:
	struct FPoseLink                              ItemCrouchTurningAdditive_0;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemCrouchTurningAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemIdleAdditive
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemIdleAdditive final
{
public:
	struct FPoseLink                              InPoseIdleAdditive;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemIdleAdditive_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemIdleAdditive;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemFullBodySprint
// 0x0020 (0x0020 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemFullBodySprint final
{
public:
	struct FPoseLink                              InPoseSprint;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemFullBodySprint_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemFullBodySprint;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemUpperBody
// 0x0260 (0x0260 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemUpperBody final
{
public:
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_AdjustedAim             InputParam;                                        // 0x0010(0x0240)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemUpperBody_0;                                   // 0x0250(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemUpperBody;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemSwimJumpStartLoop
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemSwimJumpStartLoop final
{
public:
	struct FPoseLink                              ItemSwimJumpStartLoop_0;                           // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemSwimJumpStartLoop;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemSwimJumpFallLoop
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemSwimJumpFallLoop final
{
public:
	struct FPoseLink                              ItemSwimJumpFallLoop_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemSwimJumpFallLoop;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemSwimJumpSurfaceLoop
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemSwimJumpSurfaceLoop final
{
public:
	struct FPoseLink                              ItemSwimJumpSurfaceLoop_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemSwimJumpSurfaceLoop;

// Function FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C.ItemSwimJumpSurfaceEnd
// 0x0010 (0x0010 - 0x0000)
struct FloppingRabbitLayerAnimBP_C_ItemSwimJumpSurfaceEnd final
{
public:
	struct FPoseLink                              ItemSwimJumpSurfaceEnd_0;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_FloppingRabbitLayerAnimBP_C_ItemSwimJumpSurfaceEnd;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
