#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "Party_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "MediaUtils_structs.hpp"
#include "CommonUI_structs.hpp"
#include "SocialUMG_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function FortniteUI.FortActivatablePanel.RestoreCenterWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreCenterWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanel_RestoreCenterWidget;

// Function FortniteUI.FortActivatablePanel.RestoreScrollWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreScrollWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanel_RestoreScrollWidget;

// Function FortniteUI.AthenaLeaderboardScreenBase.OnActiveLeaderboardTabChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged final
{
public:
	int32                                         ActiveWidgetIndex;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaLeaderboardScreenBase_OnActiveLeaderboardTabChanged;

// Function FortniteUI.AthenaLeaderboardScreenBase.OnFriendsFilterChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardScreenBase_OnFriendsFilterChanged final
{
public:
	int32                                         FriendsFilterIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaLeaderboardScreenBase_OnFriendsFilterChanged;

// Function FortniteUI.AthenaLeaderboardScreenBase.OnMatchTypeChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardScreenBase_OnMatchTypeChanged final
{
public:
	int32                                         MatchTypeIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaLeaderboardScreenBase_OnMatchTypeChanged;

// Function FortniteUI.AthenaLeaderboardScreenBase.OnPlaylistChanged
// 0x000C (0x000C - 0x0000)
struct AthenaLeaderboardScreenBase_OnPlaylistChanged final
{
public:
	class FName                                   NewPlaylistName;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonInputType                              NewInputType;                                      // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaLeaderboardScreenBase_OnPlaylistChanged;

// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateLeaderboardListUI
// 0x0028 (0x0028 - 0x0000)
struct AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardRowProxyInstance*       LocalUserRow;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   QueryErrorStr;                                     // 0x0010(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaLeaderboardScreenBase_OnUpdateLeaderboardListUI;

// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateListHeader
// 0x0050 (0x0050 - 0x0000)
struct AthenaLeaderboardScreenBase_OnUpdateListHeader final
{
public:
	struct FAthenaPlaylistLeaderboardData         PlaylistTabData;                                   // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaLeaderboardScreenBase_OnUpdateListHeader;

// Function FortniteUI.AthenaLeaderboardScreenBase.OnUpdateTabButtonText
// 0x0058 (0x0058 - 0x0000)
struct AthenaLeaderboardScreenBase_OnUpdateTabButtonText final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAthenaPlaylistLeaderboardData         PlaylistTabData;                                   // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaLeaderboardScreenBase_OnUpdateTabButtonText;

// Function FortniteUI.AthenaLeaderboardScreenBase.CanShowFriendsOnlyLeaderboard
// 0x0001 (0x0001 - 0x0000)
struct AthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaLeaderboardScreenBase_CanShowFriendsOnlyLeaderboard;

// Function FortniteUI.FortUserWidget.AddGrantCheatMenu
// 0x0020 (0x0020 - 0x0000)
struct FortUserWidget_AddGrantCheatMenu final
{
public:
	class FString                                 TemplateId;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstanceId;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUserWidget_AddGrantCheatMenu;

// Function FortniteUI.FortMovieWidget.MediaDimensionsUpdated
// 0x0008 (0x0008 - 0x0000)
struct FortMovieWidget_MediaDimensionsUpdated final
{
public:
	float                                         NewWidth;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewHeight;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMovieWidget_MediaDimensionsUpdated;

// Function FortniteUI.FortMovieWidget.RequestPlayMovie
// 0x0001 (0x0001 - 0x0000)
struct FortMovieWidget_RequestPlayMovie final
{
public:
	bool                                          bShouldRewind;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMovieWidget_RequestPlayMovie;

// Function FortniteUI.FortMovieWidget.SetMediaSource
// 0x0040 (0x0040 - 0x0000)
struct FortMovieWidget_SetMediaSource final
{
public:
	class UMediaSource*                           InMediaSource;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMediaPlayerOptions                    PlayerOptions;                                     // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bPlayOnOpen;                                       // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLooping;                                          // 0x0039(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x003A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortMovieWidget_SetMediaSource;

// Function FortniteUI.FortMovieWidget.GetMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct FortMovieWidget_GetMediaPlayer final
{
public:
	class UMediaPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMovieWidget_GetMediaPlayer;

// Function FortniteUI.FortMovieWidget.GetMediaSoundComponent
// 0x0008 (0x0008 - 0x0000)
struct FortMovieWidget_GetMediaSoundComponent final
{
public:
	class UMediaSoundComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMovieWidget_GetMediaSoundComponent;

// Function FortniteUI.FortMovieWidget.GetMediaTexture
// 0x0008 (0x0008 - 0x0000)
struct FortMovieWidget_GetMediaTexture final
{
public:
	class UMediaTexture*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortMovieWidget_GetMediaTexture;

// Function FortniteUI.FortMovieWidget.HasPlayerForSource
// 0x0010 (0x0010 - 0x0000)
struct FortMovieWidget_HasPlayerForSource final
{
public:
	class UMediaSource*                           InMediaSource;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortMovieWidget_HasPlayerForSource;

// Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetBattleBookPurchaseLimit final
{
public:
	int32                                         MaxNumLevelsPossibleToPurchase;                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAccountContext_GetBattleBookPurchaseLimit;

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonDefinition
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonDefinition final
{
public:
	class UAthenaSeasonItemDefinition*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAccountContext_GetCurrentSeasonDefinition;

// Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase
// 0x000C (0x000C - 0x0000)
struct AthenaAccountContext_SimulateBattleBookPurchase final
{
public:
	int32                                         NumLevelsToPurchase;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverLimit;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaAccountContext_SimulateBattleBookPurchase;

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonName
// 0x0018 (0x0018 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAccountContext_GetCurrentSeasonName;

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumber
// 0x0004 (0x0004 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAccountContext_GetCurrentSeasonNumber;

// Function FortniteUI.AthenaAccountContext.IsAtMaxBattlePassTier
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccountContext_IsAtMaxBattlePassTier final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAccountContext_IsAtMaxBattlePassTier;

// Function FortniteUI.AthenaAccountContext.ShouldReplaceBattleStarsWithAlternateReward
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward;

// Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowConfirmationDialog_NUI
// 0x00F0 (0x00F0 - 0x0000)
struct FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Icon;                                              // 0x0008(0x0088)(Parm, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0090(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   MESSAGE;                                           // 0x00A8(0x0018)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FConfirmationDialogAction>      ConfirmButtonInputActions;                         // 0x00C0(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   DeclineButtonInputAction;                          // 0x00D0(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                AdditionalContent;                                 // 0x00D8(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                LeftAdditionalContent;                             // 0x00E0(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_ShowConfirmation_NUI*  ReturnValue;                                       // 0x00E8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAsyncAction_ShowConfirmation_NUI_ShowConfirmationDialog_NUI;

// Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowSimpleConfirmationDialog_CustomInput
// 0x00E8 (0x00E8 - 0x0000)
struct FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Icon;                                              // 0x0008(0x0088)(Parm, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0090(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   MESSAGE;                                           // 0x00A8(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FName                                   ConfirmAction;                                     // 0x00C0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DeclineAction;                                     // 0x00C8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                AdditionalContent;                                 // 0x00D0(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                LeftAdditionalContent;                             // 0x00D8(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_ShowConfirmation_NUI*  ReturnValue;                                       // 0x00E0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_CustomInput;

// Function FortniteUI.FortAsyncAction_ShowConfirmation_NUI.ShowSimpleConfirmationDialog_NUI
// 0x00E0 (0x00E0 - 0x0000)
struct FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Icon;                                              // 0x0008(0x0088)(Parm, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0090(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   MESSAGE;                                           // 0x00A8(0x0018)(Parm, NativeAccessSpecifierPublic)
	bool                                          bShowConfirm;                                      // 0x00C0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDecline;                                      // 0x00C1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                AdditionalContent;                                 // 0x00C8(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                LeftAdditionalContent;                             // 0x00D0(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_ShowConfirmation_NUI*  ReturnValue;                                       // 0x00D8(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAsyncAction_ShowConfirmation_NUI_ShowSimpleConfirmationDialog_NUI;

// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortHUDElementWidget_HandleOnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHUDElementWidget_HandleOnHUDElementVisibilityChanged;

// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
// 0x0001 (0x0001 - 0x0000)
struct FortHUDElementWidget_OnVisibilitySetEvent final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHUDElementWidget_OnVisibilitySetEvent;

// Function FortniteUI.FortGridPickerTile.SetData
// 0x0008 (0x0008 - 0x0000)
struct FortGridPickerTile_SetData final
{
public:
	class UObject*                                InData;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridPickerTile_SetData;

// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerController
// 0x0008 (0x0008 - 0x0000)
struct AthenaAIKillsBase_SetKillsSourcePlayerController final
{
public:
	class AFortPlayerControllerAthena*            InPlayerController;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAIKillsBase_SetKillsSourcePlayerController;

// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerState
// 0x0008 (0x0008 - 0x0000)
struct AthenaAIKillsBase_SetKillsSourcePlayerState final
{
public:
	class AFortPlayerStateAthena*                 InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAIKillsBase_SetKillsSourcePlayerState;

// Function FortniteUI.FortAsyncAction_CheckForStwMfaReward.CheckForStwMfaReward
// 0x0010 (0x0010 - 0x0000)
struct FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward final
{
public:
	class AFortPlayerController*                  PlayerController_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortAsyncAction_CheckForStwMfaReward*  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAsyncAction_CheckForStwMfaReward_CheckForStwMfaReward;

// Function FortniteUI.AthenaAwardAlertBase.OnAwardGranted
// 0x0008 (0x0008 - 0x0000)
struct AthenaAwardAlertBase_OnAwardGranted final
{
public:
	class UFortAwardItemDefinition*               AwardDefinition;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAwardAlertBase_OnAwardGranted;

// Function FortniteUI.AthenaAwardAlertBase.SetDataSource
// 0x0008 (0x0008 - 0x0000)
struct AthenaAwardAlertBase_SetDataSource final
{
public:
	class UAthenaPlayerViewModel*                 PlayerViewModel;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAwardAlertBase_SetDataSource;

// Function FortniteUI.FortGridWidgetBase.GetTileForObject
// 0x0010 (0x0010 - 0x0000)
struct FortGridWidgetBase_GetTileForObject final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortGridPickerTile*                    ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_GetTileForObject;

// Function FortniteUI.FortGridWidgetBase.GetTiles
// 0x0010 (0x0010 - 0x0000)
struct FortGridWidgetBase_GetTiles final
{
public:
	TArray<class UFortGridPickerTile*>            ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_GetTiles;

// Function FortniteUI.FortGridWidgetBase.SetClearWidgetType
// 0x0008 (0x0008 - 0x0000)
struct FortGridWidgetBase_SetClearWidgetType final
{
public:
	TSubclassOf<class UFortGridPickerTile>        InClearWidgetType;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_SetClearWidgetType;

// Function FortniteUI.FortGridWidgetBase.SetDataProvider
// 0x0010 (0x0010 - 0x0000)
struct FortGridWidgetBase_SetDataProvider final
{
public:
	TArray<class UObject*>                        Data;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_SetDataProvider;

// Function FortniteUI.FortGridWidgetBase.SetPeekOverflowTilePercentage
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetPeekOverflowTilePercentage final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_SetPeekOverflowTilePercentage;

// Function FortniteUI.FortGridWidgetBase.SetTileHeight
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetTileHeight final
{
public:
	float                                         Height;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_SetTileHeight;

// Function FortniteUI.FortGridWidgetBase.SetTilePadding
// 0x0010 (0x0010 - 0x0000)
struct FortGridWidgetBase_SetTilePadding final
{
public:
	struct FMargin                                Padding;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_SetTilePadding;

// Function FortniteUI.FortGridWidgetBase.SetTilesAcross
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetTilesAcross final
{
public:
	int32                                         Across;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_SetTilesAcross;

// Function FortniteUI.FortGridWidgetBase.SetTilesDown
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetTilesDown final
{
public:
	int32                                         Down;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_SetTilesDown;

// Function FortniteUI.FortGridWidgetBase.SetTileWidth
// 0x0004 (0x0004 - 0x0000)
struct FortGridWidgetBase_SetTileWidth final
{
public:
	float                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridWidgetBase_SetTileWidth;

// Function FortniteUI.FortGridPickerButton.SetIsOpen
// 0x0001 (0x0001 - 0x0000)
struct FortGridPickerButton_SetIsOpen final
{
public:
	bool                                          ShouldBeOpen;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortGridPickerButton_SetIsOpen;

// Function FortniteUI.MassiveGadgetEquippedWidget.HandleMassiveTagChanged
// 0x000C (0x000C - 0x0000)
struct MassiveGadgetEquippedWidget_HandleMassiveTagChanged final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MassiveGadgetEquippedWidget_HandleMassiveTagChanged;

// Function FortniteUI.FortActivatablePanelWithItemPreview.GetWidgetForFramingViewedItem
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_GetWidgetForFramingViewedItem;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_0
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_0;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_1
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_1;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_2
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_2;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_3
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_3;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_4
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_4;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_5
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_5;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_6
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_6;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnCosmeticSpecialActionPressed_7
// 0x0001 (0x0001 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7 final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnCosmeticSpecialActionPressed_7;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnItemPreviewChanged
// 0x0010 (0x0010 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnItemPreviewChanged final
{
public:
	class AActor*                                 NewPrefab;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                              NewItem;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnItemPreviewChanged;

// Function FortniteUI.FortActivatablePanelWithItemPreview.OnVaultItemsViewed
// 0x0010 (0x0010 - 0x0000)
struct FortActivatablePanelWithItemPreview_OnVaultItemsViewed final
{
public:
	TArray<class UFortItem*>                      Items;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanelWithItemPreview_OnVaultItemsViewed;

// Function FortniteUI.AthenaItemSelectorScreenBase.HandleSelectedTabChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemSelectorScreenBase_HandleSelectedTabChanged final
{
public:
	class FName                                   SelectedTabID;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaItemSelectorScreenBase_HandleSelectedTabChanged;

// Function FortniteUI.AthenaItemSelectorScreenBase.OnCurrentItemChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemSelectorScreenBase_OnCurrentItemChanged final
{
public:
	class UFortItem*                              SelectedItem;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaItemSelectorScreenBase_OnCurrentItemChanged;

// Function FortniteUI.AthenaItemSelectorScreenBase.OnFinsihedItemSetup
// 0x0038 (0x0038 - 0x0000)
struct AthenaItemSelectorScreenBase_OnFinsihedItemSetup final
{
public:
	class FText                                   CategoryDisplayName;                               // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ItemDisplayTypeName;                               // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EAthenaCustomizationCategory                  SelectedCategory;                                  // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaItemSelectorScreenBase_OnFinsihedItemSetup;

// Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectedChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemSelectorScreenBase_OnItemSelectedChanged final
{
public:
	class UFortItem*                              SelectedItem;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaItemSelectorScreenBase_OnItemSelectedChanged;

// Function FortniteUI.AthenaItemSelectorScreenBase.OnItemSelectionCommited
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemSelectorScreenBase_OnItemSelectionCommited final
{
public:
	class UFortItem*                              SelectedItem;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaItemSelectorScreenBase_OnItemSelectionCommited;

// Function FortniteUI.AthenaItemSelectorScreenBase.OnTabSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemSelectorScreenBase_OnTabSelectionChanged final
{
public:
	bool                                          bShowingVariants;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaItemSelectorScreenBase_OnTabSelectionChanged;

// Function FortniteUI.AthenaItemSelectorScreenBase.OnVariantSelectionChanged
// 0x0038 (0x0038 - 0x0000)
struct AthenaItemSelectorScreenBase_OnVariantSelectionChanged final
{
public:
	struct FMcpVariantChannelInfo                 InVariant;                                         // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaItemSelectorScreenBase_OnVariantSelectionChanged;

// Function FortniteUI.AthenaItemSelectorScreenBase.StartItemCustomization
// 0x0038 (0x0038 - 0x0000)
struct AthenaItemSelectorScreenBase_StartItemCustomization final
{
public:
	EAthenaCustomizationCategory                  InCategory;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InSubslotIndex;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CategoryDisplayName;                               // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ItemDisplayTypeName;                               // 0x0020(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaItemSelectorScreenBase_StartItemCustomization;

// Function FortniteUI.AthenaItemSelectorScreenBase.GetCurrentItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemSelectorScreenBase_GetCurrentItem final
{
public:
	class UFortItem*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaItemSelectorScreenBase_GetCurrentItem;

// Function FortniteUI.AthenaTimeWidgetBase.HandleGamePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaTimeWidgetBase_HandleGamePhaseChanged final
{
public:
	EAthenaGamePhase                              GamePhase;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaTimeWidgetBase_HandleGamePhaseChanged;

// Function FortniteUI.AthenaTimeWidgetBase.OnGamePhaseStepChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaTimeWidgetBase_OnGamePhaseStepChanged final
{
public:
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaTimeWidgetBase_OnGamePhaseStepChanged;

// Function FortniteUI.FortUIStateWidget_NUI.DynamicHandleLoadingScreenVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct FortUIStateWidget_NUI_DynamicHandleLoadingScreenVisibilityChanged final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_DynamicHandleLoadingScreenVisibilityChanged;

// Function FortniteUI.FortUIStateWidget_NUI.OnEnterState
// 0x0001 (0x0001 - 0x0000)
struct FortUIStateWidget_NUI_OnEnterState final
{
public:
	EFortUIState                                  PreviousUIState;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_OnEnterState;

// Function FortniteUI.FortUIStateWidget_NUI.OnExitState
// 0x0001 (0x0001 - 0x0000)
struct FortUIStateWidget_NUI_OnExitState final
{
public:
	EFortUIState                                  NextUIState;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_OnExitState;

// Function FortniteUI.FortUIStateWidget_NUI.OnFrontEndVisibilityUpdated
// 0x0003 (0x0003 - 0x0000)
struct FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated final
{
public:
	bool                                          bHideHeader;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFooter;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideChatWidget;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated;

// Function FortniteUI.FortUIStateWidget_NUI.OnHUDScaleChanged
// 0x0004 (0x0004 - 0x0000)
struct FortUIStateWidget_NUI_OnHUDScaleChanged final
{
public:
	float                                         HUDScale;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_OnHUDScaleChanged;

// Function FortniteUI.FortUIStateWidget_NUI.OnLoadingScreenVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct FortUIStateWidget_NUI_OnLoadingScreenVisibilityChanged final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_OnLoadingScreenVisibilityChanged;

// Function FortniteUI.FortUIStateWidget_NUI.PopContentWidget
// 0x0008 (0x0008 - 0x0000)
struct FortUIStateWidget_NUI_PopContentWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_PopContentWidget;

// Function FortniteUI.FortUIStateWidget_NUI.PopContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct FortUIStateWidget_NUI_PopContentWidgetInternal final
{
public:
	struct FContentPushState                      State;                                             // 0x0000(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_PopContentWidgetInternal;

// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidget
// 0x0008 (0x0008 - 0x0000)
struct FortUIStateWidget_NUI_PushContentWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_PushContentWidget;

// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidgetAdvanced
// 0x0010 (0x0010 - 0x0000)
struct FortUIStateWidget_NUI_PushContentWidgetAdvanced final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideHeader;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFooter;                                       // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideChatWidget;                                   // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_PushContentWidgetAdvanced;

// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct FortUIStateWidget_NUI_PushContentWidgetInternal final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FContentPushState                      State;                                             // 0x0008(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_PushContentWidgetInternal;

// Function FortniteUI.FortUIStateWidget_NUI.SetFrontEndVisibility
// 0x0003 (0x0003 - 0x0000)
struct FortUIStateWidget_NUI_SetFrontEndVisibility final
{
public:
	bool                                          bHideHeader;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFooter;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideChatWidget;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortUIStateWidget_NUI_SetFrontEndVisibility;

// Function FortniteUI.AthenaHUDBase.HandleCursorModeChanging
// 0x0001 (0x0001 - 0x0000)
struct AthenaHUDBase_HandleCursorModeChanging final
{
public:
	bool                                          bCursorModeEnabled;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_HandleCursorModeChanging;

// Function FortniteUI.AthenaHUDBase.HandleEnteredVolume
// 0x0010 (0x0010 - 0x0000)
struct AthenaHUDBase_HandleEnteredVolume final
{
public:
	class APlayerState*                           ClientState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                            Volume;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_HandleEnteredVolume;

// Function FortniteUI.AthenaHUDBase.HandleExitVolume
// 0x0010 (0x0010 - 0x0000)
struct AthenaHUDBase_HandleExitVolume final
{
public:
	class APlayerState*                           ClientState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                            Volume;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_HandleExitVolume;

// Function FortniteUI.AthenaHUDBase.HandleVolumeLoaded
// 0x0010 (0x0010 - 0x0000)
struct AthenaHUDBase_HandleVolumeLoaded final
{
public:
	class APlayerState*                           ClientState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                            Volume;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_HandleVolumeLoaded;

// Function FortniteUI.AthenaHUDBase.HandleVolumeStateChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaHUDBase_HandleVolumeStateChanged final
{
public:
	EVolumeState                                  NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortVolume*                            Volume;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_HandleVolumeStateChanged;

// Function FortniteUI.AthenaHUDBase.HandleVolumeUnloaded
// 0x0010 (0x0010 - 0x0000)
struct AthenaHUDBase_HandleVolumeUnloaded final
{
public:
	class APlayerState*                           ClientState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortVolume*                            Volume;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_HandleVolumeUnloaded;

// Function FortniteUI.AthenaHUDBase.OnPlaylistExtensionWidgetCreated
// 0x0010 (0x0010 - 0x0000)
struct AthenaHUDBase_OnPlaylistExtensionWidgetCreated final
{
public:
	EPlaylistUIExtensionSlot                      ExtensionSlot;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_OnPlaylistExtensionWidgetCreated;

// Function FortniteUI.AthenaHUDBase.SetFullScreenMapVisibility
// 0x0001 (0x0001 - 0x0000)
struct AthenaHUDBase_SetFullScreenMapVisibility final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_SetFullScreenMapVisibility;

// Function FortniteUI.AthenaHUDBase.SetQuickBarNative
// 0x0001 (0x0001 - 0x0000)
struct AthenaHUDBase_SetQuickBarNative final
{
public:
	bool                                          bShouldDoQuickBarNative;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_SetQuickBarNative;

// Function FortniteUI.AthenaHUDBase.ViewModelChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaHUDBase_ViewModelChanged final
{
public:
	class UAthenaPlayerViewModel*                 ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaHUDBase_ViewModelChanged;

// Function FortniteUI.BacchusHUDElement.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct BacchusHUDElement_HandleInputMethodChanged final
{
public:
	ECommonInputType                              CurrentInputType;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BacchusHUDElement_HandleInputMethodChanged;

// Function FortniteUI.BacchusHUDElement.OnHUDStateUpdate
// 0x0014 (0x0014 - 0x0000)
struct BacchusHUDElement_OnHUDStateUpdate final
{
public:
	struct FFortHUDState                          NewState;                                          // 0x0000(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BacchusHUDElement_OnHUDStateUpdate;

// Function FortniteUI.BacchusHUDElement.BP_GetMobileVisualType
// 0x0008 (0x0008 - 0x0000)
struct BacchusHUDElement_BP_GetMobileVisualType final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BacchusHUDElement_BP_GetMobileVisualType;

// Function FortniteUI.BacchusSignalQualityWidget.OnNewSignalQuality
// 0x0004 (0x0004 - 0x0000)
struct BacchusSignalQualityWidget_OnNewSignalQuality final
{
public:
	float                                         NewRawQuality;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BacchusSignalQualityWidget_OnNewSignalQuality;

// Function FortniteUI.BacchusSignalQualityWidget.SetNewSignalQuality
// 0x0001 (0x0001 - 0x0000)
struct BacchusSignalQualityWidget_SetNewSignalQuality final
{
public:
