#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "BlueprintContext_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Party_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "InputCore_structs.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "McpProfileSys_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "Slate_structs.hpp"
#include "LauncherSocialTypes_structs.hpp"


SDK_NAMESPACE_START

// Class FortniteUI.FortActivatablePanel
// 0x0028 (0x0348 - 0x0320)
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x0320(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x0321(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x0322(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClosableByPlayerInput;                          // 0x0323(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324[0x24];                                     // 0x0324(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivatablePanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivatablePanel")
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
DUMPER7_ASSERTS_UFortActivatablePanel;

// Class FortniteUI.AthenaLeaderboardScreenBase
// 0x0100 (0x0448 - 0x0348)
class UAthenaLeaderboardScreenBase : public UFortActivatablePanel
{
public:
	class UFortTabListWidgetBase*                 LeaderboardTabList;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         MatchRotator;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         LeaderboardTypeRotator;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       RefreshTimeText;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       NoDataMessageText;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                          BorderLocalUserFocus;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             LeaderboardDisplayData;                            // 0x0378(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, class UCommonButton*>       ActiveTabButtons;                                  // 0x0380(0x0050)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortLeaderboardRowProxyInstance*> RowProxies;                                      // 0x03D0(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UFortLeaderboardRowProxyInstance*       LocalUserRowProxy;                                 // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLeaderboardFilter                     CurrentLeaderboardFilter;                          // 0x03E8(0x0028)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_410[0x38];                                     // 0x0410(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActiveLeaderboardTabChanged(int32 ActiveWidgetIndex);
	void OnFriendsFilterChanged(int32 FriendsFilterIndex);
	void OnMatchTypeChanged(int32 MatchTypeIndex);
	void OnPlaylistChanged(const class FName NewPlaylistName, const ECommonInputType NewInputType);
	void OnQueryFinished();
	void OnQueryStarted();
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, class UFortLeaderboardRowProxyInstance* LocalUserRow, const class FText& QueryErrorStr);
	void OnUpdateListHeader(const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateTabButtonText(class UCommonButton* Button, const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);

	bool CanShowFriendsOnlyLeaderboard() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaLeaderboardScreenBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaLeaderboardScreenBase")
	}
	static class UAthenaLeaderboardScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLeaderboardScreenBase>();
	}
};
DUMPER7_ASSERTS_UAthenaLeaderboardScreenBase;

// Class FortniteUI.FortUserWidget
// 0x0010 (0x0240 - 0x0230)
class UFortUserWidget : public UUserWidget
{
public:
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bConsumePointerInput;                              // 0x0238(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddGrantCheatMenu(const class FString& TemplateId, const class FString& InstanceId);
	void AddStoreCheatMenu();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortUserWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortUserWidget")
	}
	static class UFortUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUserWidget>();
	}
};
DUMPER7_ASSERTS_UFortUserWidget;

// Class FortniteUI.FortMovieWidget
// 0x0028 (0x0268 - 0x0240)
class UFortMovieWidget : public UFortUserWidget
{
public:
	UMulticastDelegateProperty_                   OnMediaOpened;                                     // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaTexture*                          MediaTexture;                                      // 0x0258(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSoundComponent*                   SoundComponent;                                    // 0x0260(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void MediaDimensionsUpdated(float NewWidth, float NewHeight);
	void RequestPlayMovie(bool bShouldRewind);
	void RequestStopMovie();
	bool SetMediaSource(class UMediaSource* InMediaSource, const struct FMediaPlayerOptions& PlayerOptions, bool bPlayOnOpen, bool bLooping);

	class UMediaPlayer* GetMediaPlayer() const;
	class UMediaSoundComponent* GetMediaSoundComponent() const;
	class UMediaTexture* GetMediaTexture() const;
	bool HasPlayerForSource(class UMediaSource* InMediaSource) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMovieWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMovieWidget")
	}
	static class UFortMovieWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMovieWidget>();
	}
};
DUMPER7_ASSERTS_UFortMovieWidget;

// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0028 - 0x0028)
class UAthenaAccountContext final : public UBlueprintContextBase
{
public:
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);

	class FText GetCurrentSeasonName() const;
	int32 GetCurrentSeasonNumber() const;
	bool IsAtMaxBattlePassTier() const;
	bool ShouldReplaceBattleStarsWithAlternateReward() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaAccountContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaAccountContext")
	}
	static class UAthenaAccountContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccountContext>();
	}
};
DUMPER7_ASSERTS_UAthenaAccountContext;

// Class FortniteUI.FortAsyncAction_ShowConfirmation_NUI
// 0x0140 (0x0170 - 0x0030)
class UFortAsyncAction_ShowConfirmation_NUI final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   DialogResult;                                      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription_NUI             Description;                                       // 0x0048(0x0120)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UFortAsyncAction_ShowConfirmation_NUI* ShowConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, const class FText& Title, const class FText& MESSAGE, const TArray<struct FConfirmationDialogAction>& ConfirmButtonInputActions, const class FName& DeclineButtonInputAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);
	static class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_CustomInput(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, const class FText& Title, const class FText& MESSAGE, class FName ConfirmAction, class FName DeclineAction, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);
	static class UFortAsyncAction_ShowConfirmation_NUI* ShowSimpleConfirmationDialog_NUI(class UObject* InWorldContextObject, const struct FSlateBrush& Icon, const class FText& Title, const class FText& MESSAGE, bool bShowConfirm, bool bShowDecline, class UWidget* AdditionalContent, class UWidget* LeftAdditionalContent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAsyncAction_ShowConfirmation_NUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAsyncAction_ShowConfirmation_NUI")
	}
	static class UFortAsyncAction_ShowConfirmation_NUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_ShowConfirmation_NUI>();
	}
};
DUMPER7_ASSERTS_UFortAsyncAction_ShowConfirmation_NUI;

// Class FortniteUI.FortHUDElementWidget
// 0x0030 (0x0268 - 0x0238)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTag                           ElementTag;                                        // 0x0238(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0240(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_260[0x8];                                      // 0x0260(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleOnHUDResetToDefaults();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortHUDElementWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortHUDElementWidget")
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};
DUMPER7_ASSERTS_UFortHUDElementWidget;

// Class FortniteUI.FortGridPickerTile
// 0x0010 (0x0250 - 0x0240)
class UFortGridPickerTile final : public UFortUserWidget
{
public:
	class UObject*                                Data;                                              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortGridWidgetBase*                    Owner;                                             // 0x0248(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ForwardClicked();
	void OnClicked();
	void SetData(class UObject* InData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGridPickerTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGridPickerTile")
	}
	static class UFortGridPickerTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridPickerTile>();
	}
};
DUMPER7_ASSERTS_UFortGridPickerTile;

// Class FortniteUI.AthenaAIKillsBase
// 0x0018 (0x0280 - 0x0268)
class UAthenaAIKillsBase final : public UFortHUDElementWidget
{
public:
	class UTextBlock*                             KillsText;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                KillsSource;                                       // 0x0270(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCustomKillSource;                                 // 0x0278(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaAIKillsBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaAIKillsBase")
	}
	static class UAthenaAIKillsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAIKillsBase>();
	}
};
DUMPER7_ASSERTS_UAthenaAIKillsBase;

// Class FortniteUI.FortAsyncAction_CheckForStwMfaReward
// 0x0028 (0x0058 - 0x0030)
class UFortAsyncAction_CheckForStwMfaReward final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnCompleted;                                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AFortPlayerController*                  PlayerController;                                  // 0x0050(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_CheckForStwMfaReward* CheckForStwMfaReward(class AFortPlayerController* PlayerController_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAsyncAction_CheckForStwMfaReward")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAsyncAction_CheckForStwMfaReward")
	}
	static class UFortAsyncAction_CheckForStwMfaReward* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_CheckForStwMfaReward>();
	}
};
DUMPER7_ASSERTS_UFortAsyncAction_CheckForStwMfaReward;

// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0238 - 0x0230)
class UAthenaAwardAlertBase final : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                 PlayerVM;                                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaAwardAlertBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaAwardAlertBase")
	}
	static class UAthenaAwardAlertBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAwardAlertBase>();
	}
};
DUMPER7_ASSERTS_UAthenaAwardAlertBase;

// Class FortniteUI.FortGridWidgetBase
// 0x0148 (0x0268 - 0x0120)
class UFortGridWidgetBase : public UContentWidget
{
public:
	TSubclassOf<class UFortGridPickerTile>        ClearWidgetType;                                   // 0x0120(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileWidth;                                         // 0x0128(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileHeight;                                        // 0x012C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TilesAcross;                                       // 0x0130(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TilesDown;                                         // 0x0134(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShrinkToFit;                                      // 0x0138(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PeekOverflowTilePercentage;                        // 0x013C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                TilePadding;                                       // 0x0140(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSlateBrush                            GridBackground;                                    // 0x0150(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FMargin                                GridBackgroundPadding;                             // 0x01D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        DataProvider;                                      // 0x01E8(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                   OnTileGenerated;                                   // 0x01F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTileClicked;                                     // 0x0208(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMouseEnterTile;                                  // 0x0218(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnMouseLeaveTile;                                  // 0x0228(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortGridPickerTile>        TileWidgetType;                                    // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGridSortKind                                 SortKind;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReversed;                                         // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Data)>          GetSortKeyFor;                                     // 0x0244(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_254[0x14];                                     // 0x0254(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortGridPickerTile* GetTileForObject(const class UObject* Object);
	TArray<class UFortGridPickerTile*> GetTiles();
	void SetClearWidgetType(TSubclassOf<class UFortGridPickerTile> InClearWidgetType);
	void SetDataProvider(const TArray<class UObject*>& Data);
	void SetPeekOverflowTilePercentage(float Percent);
	void SetTileHeight(float Height);
	void SetTilePadding(const struct FMargin& Padding);
	void SetTilesAcross(int32 Across);
	void SetTilesDown(int32 Down);
	void SetTileWidth(float Width);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGridWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGridWidgetBase")
	}
	static class UFortGridWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridWidgetBase>();
	}
};
DUMPER7_ASSERTS_UFortGridWidgetBase;

// Class FortniteUI.FortGridPickerButton
// 0x0048 (0x02B0 - 0x0268)
class UFortGridPickerButton final : public UFortGridWidgetBase
{
public:
	EMenuPlacement                                GridPlacement;                                     // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGridPickerGrid*                    GridWidget;                                        // 0x0270(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCloseOnTileClicked;                               // 0x0278(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             GridWidgetDelegate;                                // 0x027C(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnGridPickerOpenChanged;                           // 0x0290(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A0[0x10];                                     // 0x02A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnButtonClicked();
	void SetIsOpen(const bool ShouldBeOpen);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGridPickerButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGridPickerButton")
	}
	static class UFortGridPickerButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGridPickerButton>();
	}
};
DUMPER7_ASSERTS_UFortGridPickerButton;

// Class FortniteUI.MassiveGadgetEquippedWidget
// 0x0000 (0x0238 - 0x0238)
class UMassiveGadgetEquippedWidget final : public UCommonUserWidget
{
public:
	void HandleMassiveTagChanged(const struct FGameplayTag& Tag, int32 Count);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MassiveGadgetEquippedWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MassiveGadgetEquippedWidget")
	}
	static class UMassiveGadgetEquippedWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassiveGadgetEquippedWidget>();
	}
};
DUMPER7_ASSERTS_UMassiveGadgetEquippedWidget;

// Class FortniteUI.FortActivatablePanelWithItemPreview
// 0x00F8 (0x0440 - 0x0348)
class UFortActivatablePanelWithItemPreview : public UFortActivatablePanel
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemView*                          ItemViewObject;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewUnifiedSupportsCameraControlInputAction;   // 0x0358(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewUnifiedZoomInputAction;                    // 0x0368(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewZoomOutInputAction;                        // 0x0378(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewZoomInInputAction;                         // 0x0388(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ItemViewRotateInputAction;                         // 0x0398(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3A8[0x88];                                     // 0x03A8(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AllowItemRotation;                                 // 0x0430(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AllowItemZooming;                                  // 0x0431(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          AutomaticallyRegisterCameraView;                   // 0x0432(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_433[0x5];                                      // 0x0433(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             ActionDataTable;                                   // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWidget* GetWidgetForFramingViewedItem();
	void OnCosmeticSpecialActionPressed_0(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_1(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_2(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_3(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_4(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_5(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_6(bool* bPassThrough);
	void OnCosmeticSpecialActionPressed_7(bool* bPassThrough);
	void OnItemPreviewChanged(class AActor* NewPrefab, class UFortItem* NewItem);
	void OnVaultItemsViewed(const TArray<class UFortItem*>& Items);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivatablePanelWithItemPreview")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivatablePanelWithItemPreview")
	}
	static class UFortActivatablePanelWithItemPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanelWithItemPreview>();
	}
};
DUMPER7_ASSERTS_UFortActivatablePanelWithItemPreview;

// Class FortniteUI.AthenaItemSelectorScreenBase
// 0x0178 (0x05B8 - 0x0440)
class UAthenaItemSelectorScreenBase : public UFortActivatablePanelWithItemPreview
{
public:
	TSubclassOf<class UCommonButton>              TabButtonType;                                     // 0x0440(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EAthenaCustomizationCategory, struct FFortTabButtonLabelInfo> ItemCategoryButtonLabelInfo;  // 0x0448(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FFortTabButtonLabelInfo                VariantButtonLabelInfo;                            // 0x0498(0x00A0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_ConfirmSelection;                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_EditStyle;                                  // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_ConfirmStyle;                               // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCustomizationPicker*             Picker_ItemSelector;                               // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UVerticalBox*                           ItemInfo;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemBaseWidget*                    Item_HeaderInfo;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItem*                              CurrentPreviewItem;                                // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaCosmeticItemDefinition*          CurrentPreviewItemDef;                             // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMcpVariantChannelInfo>         CurrentPreviewVariantChannels;                     // 0x0578(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UFortVariantPicker*                     Picker_VariantSelector;                            // 0x0588(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_590[0x20];                                     // 0x0590(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	EAthenaCustomizationCategory                  CustomizeCategory;                                 // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotIndex;                                      // 0x05B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void EnterEditStyle();
	void ExitEditStyle();
	void HandleSelectedTabChanged(class FName SelectedTabID);
	void OnCurrentItemChanged(class UFortItem* SelectedItem);
	void OnFinsihedItemSave();
	void OnFinsihedItemSetup(const class FText& CategoryDisplayName, const class FText& ItemDisplayTypeName, EAthenaCustomizationCategory SelectedCategory);
	void OnItemSelectedChanged(class UFortItem* SelectedItem);
	void OnItemSelectionCommited(class UFortItem* SelectedItem);
	void OnSavingItemStarted();
	void OnTabSelectionChanged(bool bShowingVariants);
	void OnVariantSelectionChanged(const struct FMcpVariantChannelInfo& InVariant);
	void SaveAndExit();
	void StartItemCustomization(EAthenaCustomizationCategory InCategory, int32 InSubslotIndex, const class FText& CategoryDisplayName, const class FText& ItemDisplayTypeName);

	class UFortItem* GetCurrentItem() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaItemSelectorScreenBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaItemSelectorScreenBase")
	}
	static class UAthenaItemSelectorScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaItemSelectorScreenBase>();
	}
};
DUMPER7_ASSERTS_UAthenaItemSelectorScreenBase;

// Class FortniteUI.AthenaTimeWidgetBase
// 0x0018 (0x0280 - 0x0268)
class UAthenaTimeWidgetBase final : public UFortHUDElementWidget
{
public:
	bool                                          bIsDisplaying;                                     // 0x0268(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CachedFinalCountdownTime;                          // 0x026C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           UpdateTimerHandle;                                 // 0x0270(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             TimeText;                                          // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleGamePhaseChanged(EAthenaGamePhase GamePhase);
	void OnGamePhaseStepChanged(EAthenaGamePhaseStep GamePhaseStep);
	void OnStartTimeDisplay();
	void OnStopTimeDisplay();
	void StartTimeDisplay();
	void StopTimeDisplay();
	void UpdateTimeText();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaTimeWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaTimeWidgetBase")
	}
	static class UAthenaTimeWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTimeWidgetBase>();
	}
};
DUMPER7_ASSERTS_UAthenaTimeWidgetBase;

// Class FortniteUI.FortUIStateWidget_NUI
// 0x0018 (0x0360 - 0x0348)
class UFortUIStateWidget_NUI : public UFortActivatablePanel
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContentPushState>              StackStates;                                       // 0x0350(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void DynamicHandleLoadingScreenVisibilityChanged(bool IsVisible_0);
	void OnEnterState(EFortUIState PreviousUIState);
	void OnExitState(EFortUIState NextUIState);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void OnHUDScaleChanged(float HUDScale);
	void OnLoadingScreenVisibilityChanged(bool IsVisible_0);
	void PopAllContentWidgets();
	class UWidget* PopContentWidget();
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void PushContentWidget(class UWidget* Widget);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void RequestOpenSocialMenu();
	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortUIStateWidget_NUI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortUIStateWidget_NUI")
	}
	static class UFortUIStateWidget_NUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_NUI>();
	}
};
DUMPER7_ASSERTS_UFortUIStateWidget_NUI;

// Class FortniteUI.FortItemListEntryWidgetInterface
// 0x0000 (0x0000 - 0x0000)
class IFortItemListEntryWidgetInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortItemListEntryWidgetInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortItemListEntryWidgetInterface")
	}
	static class IFortItemListEntryWidgetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortItemListEntryWidgetInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFortItemListEntryWidgetInterface;

// Class FortniteUI.AthenaHUDBase
// 0x0028 (0x0388 - 0x0360)
class UAthenaHUDBase : public UFortUIStateWidget_NUI
{
public:
	uint8                                         Pad_360[0x10];                                     // 0x0360(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPlayerViewModel*                 PlayerViewModel;                                   // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_378[0x10];                                     // 0x0378(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleCursorModeChanging(bool bCursorModeEnabled);
	void HandleEnteredVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeLoaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeStateChanged(EVolumeState NewState, class AFortVolume* Volume);
	void HandleVolumeUnloaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void OnPlaylistExtensionWidgetCreated(EPlaylistUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void SetFullScreenMapVisibility(bool bIsVisible);
	void SetQuickBarNative(bool bShouldDoQuickBarNative);
	void ViewModelChanged(class UAthenaPlayerViewModel* ViewModel);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaHUDBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaHUDBase")
	}
	static class UAthenaHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDBase>();
	}
};
DUMPER7_ASSERTS_UAthenaHUDBase;

// Class FortniteUI.BacchusHUDElement
// 0x0128 (0x0390 - 0x0268)
class UBacchusHUDElement : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsInLayoutMode;                                   // 0x0270(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           VisualType;                                        // 0x0274(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   WidgetName;                                        // 0x0280(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bHideWhenNotUsingTouch;                            // 0x0298(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAlwaysShow;                                       // 0x0299(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInBuildMode;                                     // 0x029A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInCombatMode;                                    // 0x029B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInEditMode;                                      // 0x029C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInCreativeMode;                                  // 0x029D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          IsFreeFalling;                                     // 0x029E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          IsGliding;                                         // 0x029F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          CanOpenChute;                                      // 0x02A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          InLockedBus;                                       // 0x02A1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          InUnlockedBus;                                     // 0x02A2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnTargeting;                                       // 0x02A3(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnUsingScopeTargeting;                             // 0x02A4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanTarget;                                       // 0x02A5(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanUseScopeTargeting;                            // 0x02A6(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCrouching;                                       // 0x02A7(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnCanUseSecondaryAbility;                          // 0x02A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnDBNO;                                            // 0x02A9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnControllingRCPawn;                               // 0x02AA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnInVehicle;                                       // 0x02AB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EBacchusHUDStateType                          OnDrivingVehicle;                                  // 0x02AC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHUDLayoutDataEntry                    DefaultEntry;                                      // 0x02B0(0x00E0)(Transient, NativeAccessSpecifierPrivate)

public:
	void HandleInputMethodChanged(ECommonInputType CurrentInputType);
	void OnHUDStateUpdate(const struct FFortHUDState& NewState);

	struct FGameplayTag BP_GetMobileVisualType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BacchusHUDElement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BacchusHUDElement")
	}
	static class UBacchusHUDElement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusHUDElement>();
	}
};
DUMPER7_ASSERTS_UBacchusHUDElement;

// Class FortniteUI.BacchusSignalQualityWidget
// 0x0008 (0x0398 - 0x0390)
class UBacchusSignalQualityWidget final : public UBacchusHUDElement
{
public:
	uint8                                         Pad_390[0x8];                                      // 0x0390(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNewSignalQuality(float NewRawQuality);
	void SetNewSignalQuality(EBacchusSignalQuality NewSignalQuality);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BacchusSignalQualityWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BacchusSignalQualityWidget")
	}
	static class UBacchusSignalQualityWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBacchusSignalQualityWidget>();
	}
};
DUMPER7_ASSERTS_UBacchusSignalQualityWidget;

// Class FortniteUI.AthenaSpectatorHUDBase
// 0x0008 (0x0390 - 0x0388)
class UAthenaSpectatorHUDBase : public UAthenaHUDBase
{
public:
	class UAthenaSpectatorNameplateLayerBase*     NameplateLayer;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void OnIndicatorModeChanged(bool bIndicatorsEnabled);
	void OnNameplatesEnabledChanged(bool bInNameplatesEnabled);
	void OnPlayerTargetingChanged(bool bIsTargeting);
	void OnSpectatorViewTargetChanged();
	void OnUnableToPerformAction(const struct FGameplayTagContainer& FailedReason, const class FText& FailureText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaSpectatorHUDBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaSpectatorHUDBase")
	}
	static class UAthenaSpectatorHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectatorHUDBase>();
	}
};
DUMPER7_ASSERTS_UAthenaSpectatorHUDBase;

// Class FortniteUI.AthenaBroadcastHUDBase
// 0x0088 (0x0418 - 0x0390)
class UAthenaBroadcastHUDBase final : public UAthenaSpectatorHUDBase
{
public:
	class UWidgetSwitcher*                        KillFeedSwitcher;                                  // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaSpectatorHUDControlsBase*        BroadcastHUDControls;                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaBroadcastMatchStatusWidget*      MatchStatusWidget;                                 // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaBroadcastSquadStatusWidget*      SquadStatusWidget;                                 // 0x03A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                  EventMatchInfoSwitcher;                            // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleMatchStatusActionRowHandle;                  // 0x03B8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleSquadStatusActionRowHandle;                  // 0x03C8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleActiveGridScreenActionRowHandle;             // 0x03D8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleEliminatedGridScreenActionRowHandle;         // 0x03E8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleMatchStatusScreenActionRowHandle;            // 0x03F8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    ToggleScoreboardScreenActionRowHandle;             // 0x0408(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void OnToggleActiveGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleEliminatedGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusScreenActionExecuted(bool* bPassThrough);
	void OnToggleScoreboardScreenActionExecuted(bool* bPassThrough);
	void OnToggleSquadStatusActionExecuted(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaBroadcastHUDBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaBroadcastHUDBase")
	}
	static class UAthenaBroadcastHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBroadcastHUDBase>();
	}
};
DUMPER7_ASSERTS_UAthenaBroadcastHUDBase;

// Class FortniteUI.AthenaWinnersList
// 0x0000 (0x0238 - 0x0238)
class UAthenaWinnersList final : public UCommonUserWidget
{
public:
	void OnWinnersAnnounced(const struct FAthenaWinnerInfo& WinnerInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaWinnersList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaWinnersList")
	}
	static class UAthenaWinnersList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaWinnersList>();
	}
};
DUMPER7_ASSERTS_UAthenaWinnersList;

// Class FortniteUI.ItemReceivedHeaderBase
// 0x0018 (0x0248 - 0x0230)
class UItemReceivedHeaderBase final : public UUserWidget
{
public:
	class UFortGiftBoxItem*                       GiftBoxItem;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 FromUsername;                                      // 0x0238(0x0010)(BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void InitFromGiftBoxItem();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ItemReceivedHeaderBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemReceivedHeaderBase")
	}
	static class UItemReceivedHeaderBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemReceivedHeaderBase>();
	}
};
DUMPER7_ASSERTS_UItemReceivedHeaderBase;

// Class FortniteUI.FortActorIndicatorWidget
// 0x0038 (0x02A0 - 0x0268)
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 IndicatedActor;                                    // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
