#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CommonInput_structs.hpp"
#include "CommonInput_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BlueprintContext_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hotfix_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "SocialUMG_structs.hpp"
#include "SocialUMG_classes.hpp"
#include "InputCore_structs.hpp"
#include "McpProfileSys_structs.hpp"
#include "Party_structs.hpp"
#include "LauncherSocialTypes_structs.hpp"
#include "Slate_structs.hpp"


SDK_NAMESPACE_START

// Class FortniteUI.FortStoreFrontTileWidgetBase
// 0x0008 (0x0BA8 - 0x0BA0)
class UFortStoreFrontTileWidgetBase : public UCommonButton
{
public:
	uint8                                         Pad_BA0[0x8];                                      // 0x0BA0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortStoreFrontTileWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortStoreFrontTileWidgetBase")
	}
	static class UFortStoreFrontTileWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortStoreFrontTileWidgetBase>();
	}
};
DUMPER7_ASSERTS_UFortStoreFrontTileWidgetBase;

// Class FortniteUI.FortActivatablePanel
// 0x0038 (0x0490 - 0x0458)
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x0460(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x0461(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x0462(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClosableByPlayerInput;                          // 0x0463(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPrimaryContentSetup                   PrimaryContentSetup;                               // 0x0464(0x0001)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_465[0x2B];                                     // 0x0465(0x002B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AsyncPlaySound2D(const class UObject* WorldContextObject, TSoftObjectPtr<class USoundBase> SoundToLoad, float VolumeMultiplier, float PitchMultiplier, float StartTime);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActivatablePanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActivatablePanel")
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
DUMPER7_ASSERTS_UFortActivatablePanel;

// Class FortniteUI.AthenaReplayBrowserScreenBase
// 0x0090 (0x0520 - 0x0490)
class UAthenaReplayBrowserScreenBase final : public UFortActivatablePanel
{
public:
	TSubclassOf<class UAthenaViewStreamingReplayModalBase> ViewStreamingReplayModalClass;            // 0x0490(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    RefreshActionRowHandle;                            // 0x0498(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    BackActionRowHandle;                               // 0x04A8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FDataTableRowHandle                    ViewStreamingReplayActionRowHandle;                // 0x04B8(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	class UCommonListView*                        ListView_Replay;                                   // 0x04C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortReplayBrowserRenameDialog*         RenameDialog;                                      // 0x04D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_OpenReplayFolder;                           // 0x04D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_PlayReplay;                                 // 0x04E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_DeleteReplay;                               // 0x04E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_RenameReplay;                               // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UAthenaReplayBrowserRowProxyInstance*> RowProxies;                                  // 0x04F8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_508[0x18];                                     // 0x0508(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActionStateChanged(bool bHasAction);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaReplayBrowserScreenBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaReplayBrowserScreenBase")
	}
	static class UAthenaReplayBrowserScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaReplayBrowserScreenBase>();
	}
};
DUMPER7_ASSERTS_UAthenaReplayBrowserScreenBase;

// Class FortniteUI.AthenaSpatialScreen
// 0x0098 (0x03B8 - 0x0320)
class UAthenaSpatialScreen : public UCommonActivatableWidget
{
public:
	bool                                          bEnableSpatialInputPreprocessing;                  // 0x0320(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableAnalytics;                                  // 0x0321(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_322[0x2];                                      // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           OverrideScreenTag;                                 // 0x0324(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          Button_Back;                                       // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ScreenTag;                                         // 0x0338(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_CloseMobile;                                // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bNeedsBottomBar;                                   // 0x0348(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_349[0x6F];                                     // 0x0349(0x006F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddSpatialScreenSessionCounter(const class FString& Entry, int32 Count);
	void FireSpatialScreenAnalytic(const class FString& Interaction);
	void OnInputSuspensionChanged();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaSpatialScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaSpatialScreen")
	}
	static class UAthenaSpatialScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpatialScreen>();
	}
};
DUMPER7_ASSERTS_UAthenaSpatialScreen;

// Class FortniteUI.FortServerTileBase
// 0x0048 (0x0BE8 - 0x0BA0)
class UFortServerTileBase : public UCommonButton
{
public:
	uint8                                         Pad_BA0[0x38];                                     // 0x0BA0(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_ServerWarning;                                // 0x0BD8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Launch;                                     // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnLaunchButtonEnableChanged(bool bEnableValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortServerTileBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortServerTileBase")
	}
	static class UFortServerTileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortServerTileBase>();
	}
};
DUMPER7_ASSERTS_UFortServerTileBase;

// Class FortniteUI.FortServerActionTile
// 0x0000 (0x0BE8 - 0x0BE8)
class UFortServerActionTile : public UFortServerTileBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortServerActionTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortServerActionTile")
	}
	static class UFortServerActionTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortServerActionTile>();
	}
};
DUMPER7_ASSERTS_UFortServerActionTile;

// Class FortniteUI.FortNamedServerActionTile
// 0x0018 (0x0C00 - 0x0BE8)
class UFortNamedServerActionTile : public UFortServerActionTile
{
public:
	class UCommonTextBlock*                       Text_ActionTitle;                                  // 0x0BE8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_ActionDescription;                            // 0x0BF0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UImage*                                 Image_Background;                                  // 0x0BF8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortNamedServerActionTile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortNamedServerActionTile")
	}
	static class UFortNamedServerActionTile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortNamedServerActionTile>();
	}
};
DUMPER7_ASSERTS_UFortNamedServerActionTile;

// Class FortniteUI.AthenaCollectionPlayerProgress
// 0x0020 (0x02A8 - 0x0288)
class UAthenaCollectionPlayerProgress final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_PlayerName;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_Progress;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortSocialAvatarIcon*                  AvatarIcon;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnPlayerProgressInitialized(bool bIsLocalPlayer, int32 NumCollected, int32 NumToCollect);
	void BP_OnShowPlayerInfoSet(bool bShowPlayerInfo);

	int32 GetNumCollected() const;
	bool IsLocalPlayer() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaCollectionPlayerProgress")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaCollectionPlayerProgress")
	}
	static class UAthenaCollectionPlayerProgress* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCollectionPlayerProgress>();
	}
};
DUMPER7_ASSERTS_UAthenaCollectionPlayerProgress;

// Class FortniteUI.AthenaBaseStatView
// 0x0000 (0x0028 - 0x0028)
class UAthenaBaseStatView : public UObject
{
public:
	float GetStat(const struct FGameplayTag& InStat) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaBaseStatView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaBaseStatView")
	}
	static class UAthenaBaseStatView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaBaseStatView>();
	}
};
DUMPER7_ASSERTS_UAthenaBaseStatView;

// Class FortniteUI.FortCommunityVotingOption
// 0x0088 (0x0C28 - 0x0BA0)
class UFortCommunityVotingOption final : public UCommonButton
{
public:
	uint8                                         Pad_BA0[0x8];                                      // 0x0BA0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCommunityVotingManager*            VotingManager;                                     // 0x0BA8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UFortDirectAcquisitionOfferDetailsWidget> PreviewDetailWidgetClass;            // 0x0BB0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BB8[0x10];                                     // 0x0BB8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          ComOptionVote;                                     // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          ComOptionDetails;                                  // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortCommunityVotingVoteCounter*        FlameCounter;                                      // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UFortCommunityVotingFeedback> VoteFeedbackClass;                               // 0x0BE0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BE8[0x30];                                     // 0x0BE8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCommunityVotingOptionPreview*      ComOptionPreview;                                  // 0x0C18(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOverlay*                               ComVoteFeedbackContainer;                          // 0x0C20(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DisableButtons();
	void EnableButtons();
	bool HaveVotesRemaining();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCommunityVotingOption")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCommunityVotingOption")
	}
	static class UFortCommunityVotingOption* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCommunityVotingOption>();
	}
};
DUMPER7_ASSERTS_UFortCommunityVotingOption;

// Class FortniteUI.HUDWidgetBehavior
// 0x0028 (0x0050 - 0x0028)
class UHUDWidgetBehavior : public UObject
{
public:
	class FText                                   HUDLayoutToolName;                                 // 0x0028(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<class UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents;                  // 0x0040(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HUDWidgetBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HUDWidgetBehavior")
	}
	static class UHUDWidgetBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHUDWidgetBehavior>();
	}
};
DUMPER7_ASSERTS_UHUDWidgetBehavior;

// Class FortniteUI.FortPickerContext
// 0x01E0 (0x0210 - 0x0030)
class UFortPickerContext final : public UBlueprintContextBase
{
public:
	TMulticastInlineDelegate<void(EFortPickerMode Mode, int32 InitialOption, bool bIgnoreFirstAccept)> OnShowPicker; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPickerConfirm;                                   // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPickerCancel;                                    // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 OptionDirection)> OnPickerOptionMoved;                       // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 PickerOption)> OnPickerOptionChosen;                         // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPickerRefreshItems;                              // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FItemDefOptionData>             CustomPickerMenuItems;                             // 0x00A8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FSquadQuickChatOptionData>      SquadChatMenuItems;                                // 0x00B8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UFortItemDefinition*, struct FTrackedTrapTimeAndCount> TrackedTrapsMap;               // 0x00C8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPickerData*                        PickerData;                                        // 0x0120(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFortSchematicItem*>             AccountTrapSchematics;                             // 0x0128(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FFortPickerTemporaryWheel>      AvailableWheels;                                   // 0x0138(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         CurrentWheelIndex;                                 // 0x0148(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14C[0xC];                                      // 0x014C(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UObject*, int32>                   ConsumableStackCount;                              // 0x0158(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FText>        CategoryTitles;                                    // 0x01B0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayTag>                   CategoryTags;                                      // 0x0200(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void GetAdjacentPickerWheelInformation(int32 Direction, class FText* AdjacentTitle, bool* bCanPageThisDirection);
	class FText GetCurrentPickerDisplayName();
	void GetPickerWheelAdjacency(bool* bCanPageLeft, bool* bCanPageRight);
	void LegacySwitchToAdjacentWheel(int32 SelectionDirection);
	void PickerCanceled();
	void PickerOptionAccepted(int32 Option);
	void RestoreInputAxes();
	void SetFortPickerData(class UFortPickerData* Data);
	void ShowRadialPickerMenu(EFortPickerToDisplay PickerType, int32 WheelIndex, class UObject* ContextObject);

	bool DoesRadialCloseOnRelease() const;
	int32 GetCurrentWheelIndex() const;
	class UFortItem* GetListPickerOption(int32 Index_0) const;
	int32 GetNumPickerOptions() const;
	void GetRadialPickerOptionImageAndLabel(int32 Index_0, class FText* Label, struct FSlateBrush* Brush, TSoftObjectPtr<class UTexture2D>* Icon, bool* bOptionEnabled, bool* bIsLocked) const;
	void GetRadialPickerOptionItem(int32 Index_0, class UFortItem** Item, bool* bOptionEnabled) const;
	bool UseLeftThumbstick() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPickerContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPickerContext")
	}
	static class UFortPickerContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPickerContext>();
	}
};
DUMPER7_ASSERTS_UFortPickerContext;

// Class FortniteUI.FortActiveFriendsViolator
// 0x0008 (0x0290 - 0x0288)
class UFortActiveFriendsViolator : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Text_ActivePlayerCount;                            // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortActiveFriendsViolator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortActiveFriendsViolator")
	}
	static class UFortActiveFriendsViolator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActiveFriendsViolator>();
	}
};
DUMPER7_ASSERTS_UFortActiveFriendsViolator;

// Class FortniteUI.AthenaAboutModal
// 0x0098 (0x03B8 - 0x0320)
class UAthenaAboutModal final : public UCommonActivatableWidget
{
public:
	TMulticastInlineDelegate<void()>              BP_OnAboutModalClosed;                             // 0x0320(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0330(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	TArray<class FText>                           Entries;                                           // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UObject>                 HeroImage;                                         // 0x0358(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScrollBox*                             ScrollBox_Content;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFortLazyImage*                         Image_Item;                                        // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Accept;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_CloseMobile;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A0[0x18];                                     // 0x03A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSetContent(const class FText& InTitle, const TArray<class FText>& InEntries);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaAboutModal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaAboutModal")
	}
	static class UAthenaAboutModal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAboutModal>();
	}
};
DUMPER7_ASSERTS_UAthenaAboutModal;

// Class FortniteUI.AthenaSquadPedestalGroup
// 0x0030 (0x0250 - 0x0220)
class AAthenaSquadPedestalGroup : public AActor
{
public:
	ESubGame                                      UsedSubgame;                                       // 0x0220(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MonitoredSquadIdx;                                 // 0x0224(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortTeamMemberPedestal*>        MemberPedestals;                                   // 0x0228(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                        PedestalChildrenRoot;                              // 0x0238(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_240[0x10];                                     // 0x0240(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AthenaSquadPedestalGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AthenaSquadPedestalGroup")
	}
	static class AAthenaSquadPedestalGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthenaSquadPedestalGroup>();
	}
};
DUMPER7_ASSERTS_AAthenaSquadPedestalGroup;

// Class FortniteUI.FortCommunityVotingTileCandidate
// 0x0020 (0x0280 - 0x0260)
class UFortCommunityVotingTileCandidate final : public UUserWidget
{
public:
	uint8                                         Pad_260[0x10];                                     // 0x0260(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image_Candidate;                                   // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonLoadGuard*                       LoadGuard;                                         // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AnimateImage();
	void OnImageAnimationFinished();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCommunityVotingTileCandidate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCommunityVotingTileCandidate")
	}
	static class UFortCommunityVotingTileCandidate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCommunityVotingTileCandidate>();
	}
};
DUMPER7_ASSERTS_UFortCommunityVotingTileCandidate;

// Class FortniteUI.FortHUDElementWidget
// 0x0040 (0x02C8 - 0x0288)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ElementTag;                                        // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0298(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	ESlateVisibility                              HiddenVisibility;                                  // 0x02B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTutorialHighlight*                     TutorialHighlight;                                 // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortHUDElementWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortHUDElementWidget")
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};
DUMPER7_ASSERTS_UFortHUDElementWidget;

// Class FortniteUI.FortVoiceChannelSpeakerWidget
// 0x00A0 (0x0300 - 0x0260)
class UFortVoiceChannelSpeakerWidget : public UUserWidget
{
public:
	uint8                                         Pad_260[0x48];                                     // 0x0260(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ToleratedSilenceDelay;                             // 0x02A8(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2AC[0x14];                                     // 0x02AC(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PerfUpdateIntervalInSecs;                          // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         OpenCloseAnimProxyDuration;                        // 0x02C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPerfCollapseHorizontal;                           // 0x02C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TalkingAnimProxyDuration;                          // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWidgetAnimation*                       Anim_Close;                                        // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       Anim_Open;                                         // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_DisplayName;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonBorder*                          Border_ScaleBound;                                 // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortSocialAvatarIcon*                  AvatarIcon;                                        // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_ActiveVoiceIcon;                             // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void HandleAnimationFinished();
	void OnAnimateTalkingChanged(bool bIsNowTalking);
	void OnStyleAssigned(EChannelSpeakerStyle NewStyle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortVoiceChannelSpeakerWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortVoiceChannelSpeakerWidget")
	}
	static class UFortVoiceChannelSpeakerWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortVoiceChannelSpeakerWidget>();
	}
};
DUMPER7_ASSERTS_UFortVoiceChannelSpeakerWidget;

// Class FortniteUI.FortQuickBarSlotBase
// 0x0110 (0x0398 - 0x0288)
class UFortQuickBarSlotBase : public UCommonUserWidget
{
public:
	uint8                                         Pad_288[0x8];                                      // 0x0288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonWidgetSwitcher*                  SwitcherTopComboSwitcher;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                  SwitcherBottomComboSwitcher;                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeybindTop;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeybindBottom;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeybindBottomCombo1;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeybindBottomCombo2;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeybindTopComboArrow1;                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeybindTopComboArrow2;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeybindBottomComboArrow1;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortKeybindWidget*                     KeybindBottomComboArrow2;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       BottomHoldText;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 TopLeftArrowImage;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 TopLeftArrowImage2;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 TopRightArrowImage;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 TopRightArrowImage2;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BottomLeftArrowImage;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BottomLeftArrowImage2;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BottomRightArrowImage;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 BottomRightArrowImage2;                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 EmptyImage;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMultiSizeItemCard*                 ItemCardMaximized;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMultiSizeItemCard*                 ItemCardMinimized;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemCooldownWidget*                QuickbarSlotCooldown;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 SlotInteraction;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAthenaQuickBarNativeCell*              NativeCell;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SlotIndex;                                         // 0x0358(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortQuickBars                                QuickBarType;                                      // 0x035C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35D[0x7];                                      // 0x035D(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bShowBottomArrows : 1;                             // 0x0364(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_364_1 : 2;                                  // 0x0364(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bShowTopArrows : 1;                                // 0x0364(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_364_4 : 2;                                  // 0x0364(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bHideKeybindsWhenAbilityUnavailable : 1;           // 0x0364(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bShouldCollapseItemWidgetBorder : 1;               // 0x0364(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         DoNotPlaySelectionAnimation : 1;                   // 0x0365(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIsAthenaQuickBar : 1;                             // 0x0365(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bKeybindsHidden : 1;                               // 0x0365(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	EFortItemCardSize                             ItemCardSize;                                      // 0x0366(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_367[0x1];                                      // 0x0367(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              Item;                                              // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortInputData*                         InputData;                                         // 0x0370(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCheckVisibilityBasedOffInventoryCapacity;         // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UTutorialHighlight>      TutorialHighlight;                                 // 0x037C(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDragAndDropEnabled;                               // 0x0384(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUseSlotSizeBySlotUsage : 1;                       // 0x0385(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_386[0x2];                                      // 0x0386(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      SlotSizeBySlotUsage;                               // 0x0388(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class FName GetKeyBindingAction();
	class FName GetKeyBindingActionGamepad();
	class FName GetKeyBindingActionKeyboard();
	void MaximizeSlot(bool bShouldSkipAnimation);
	void MinimizeSlot(bool bShouldSkipAnimation);
	void OnMinigameEnded();
	void OnMinigameStarted();
	void OnRefreshItem();
	void RefreshInventoryCapacity();
	void RefreshItem();
	void RefreshItemIfSlotChanged(EFortQuickBars InQuickBar, const TArray<int32>& InSlot);
	void Resize(EFortItemCardSize CardSize);
	void SetBottomComboSwitcherVisibility(ESlateVisibility InVisibility);
	void SetBottomComboSwitcherVisibility_BP(ESlateVisibility InVisibility);
	void SetQuickbarIndexRuntime(int32 Index_0, bool bRefresh);
	void SetQuickbarTypeRuntime(EFortQuickBars NewQuickBarType, bool bRefresh);
	void SetSlotSelected(bool bSelected);
	void SetTopComboSwitcherVisibility(ESlateVisibility InVisibility);
	void UpdateItemCardsVisibility();
	void UpdateKeyBindingText();
	void UpdateKeyBindingVisibility();

	const struct FVector2D GetSlotSizeForItem(const class UFortItem* InItem) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortQuickBarSlotBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortQuickBarSlotBase")
	}
	static class UFortQuickBarSlotBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortQuickBarSlotBase>();
	}
};
DUMPER7_ASSERTS_UFortQuickBarSlotBase;

// Class FortniteUI.FortAthenaHelpPanel
// 0x0010 (0x04A0 - 0x0490)
class UFortAthenaHelpPanel final : public UFortActivatablePanel
{
public:
	class UCommonTreeView*                        TreeView_Help;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_HelpEntry;                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaHelpPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaHelpPanel")
	}
	static class UFortAthenaHelpPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaHelpPanel>();
	}
};
DUMPER7_ASSERTS_UFortAthenaHelpPanel;

// Class FortniteUI.FortTwitchLoginModalWidget
// 0x0008 (0x0498 - 0x0490)
class UFortTwitchLoginModalWidget final : public UFortActivatablePanel
{
public:
	class UNativeWidgetHost*                      NativeHost;                                        // 0x0490(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnNativeHostContentChanged();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortTwitchLoginModalWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortTwitchLoginModalWidget")
	}
	static class UFortTwitchLoginModalWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortTwitchLoginModalWidget>();
	}
};
DUMPER7_ASSERTS_UFortTwitchLoginModalWidget;

// Class FortniteUI.FortAthenaVehicleDashboardWidget
// 0x0068 (0x0330 - 0x02C8)
class UFortAthenaVehicleDashboardWidget : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsWidgetShowing;                                  // 0x02D0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     CurrentVehicleActor;                               // 0x02D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CurrentSpeed;                                      // 0x02E0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TargetFuelPercent;                                 // 0x02E4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DisplayedFuelPercent;                              // 0x02E8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FillBlendSpeed;                                    // 0x02EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpeedTextMaxInterpolationRate;                     // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  WidgetTagsToHideWhenVisible;                       // 0x02F8(0x0020)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonNumericTextBlock*                NumericText_Speed;                                 // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         HUDTopSpeed;                                       // 0x0328(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAddedFuel(float NewFuelPercent);
	void OnBoostFinished();
	void OnBoostStarted();
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel);
	void OnLowFuel();
	void OnOutOfFuel();
	void SetupVehicleFuelWidget(class AActor* NewVehicle, const bool bRequestShowWidget);
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel);
	void ShowNoFuelMessage();
	void UpdateSpeedometer(float NormalizedSpeed);

	float GetHUDTopSpeed() const;
	class AFortAthenaVehicle* GetVehicle() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaVehicleDashboardWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaVehicleDashboardWidget")
	}
	static class UFortAthenaVehicleDashboardWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaVehicleDashboardWidget>();
	}
};
DUMPER7_ASSERTS_UFortAthenaVehicleDashboardWidget;

// Class FortniteUI.FortSettingsContext
// 0x0090 (0x00C0 - 0x0030)
class UFortSettingsContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_30[0xC];                                       // 0x0030(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinGammaValue;                                     // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxGammaValue;                                     // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x7C];                                      // 0x0044(0x007C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AnonymousCharacterModeChanged(bool bInChecked);
	void AnonymousModeChanged(bool bInChecked);
	void AutoEquipChanged(bool bInChecked);
	void ChatVolumeChanged(float NewValue);
	void CinematicsVolumeChanged(float NewValue);
	void DialogVolumeChanged(float NewValue);
	void FirstPersonCameraChanged(bool bInChecked);
	void GamepadBuildingMultiplierValueChanged(float NewValue);
	void GamepadEditModeMultiplierValueChanged(float NewValue);
	void GamepadLookSensitivityXChanged(float NewValue);
	void GamepadLookSensitivityYChanged(float NewValue);
	void GamepadScopedMultiplierValueChanged(float NewValue);
	void GamepadTargetingMultiplierValueChanged(float NewValue);
	TArray<class FText> GetMotionAxisNames();
	int32 GetRotatorSettingValue(ESettingType InSettingType);
	float GetSafeZoneValue();
	TArray<class FText> GetSettingDisplayNames(ESettingType InSettingType);
	float GetSettingValueInRange(float Value, ESettingType InSettingType, ESettingTab InSettingTab);
	bool GetShowTemperature();
	float GetSliderSettingValue(ESettingType InSettingType);
	void GyroSensitivityValueChanged(float NewValue);
	void HiddenMatchmakingDelayMaxChanged(int32 InValue);
	void HiddenMatchmakingDelayMaxReset();
	void HideOtherPlayerNamesChanged(bool bInChecked);
	void HoldToSwapPickupChanged(bool bInChecked);
	void InWorldInteractChanged(bool bInChecked);
	void MotionAxisValueChanged(int32 NewValue);
