#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteConversationRuntime

#include "Basic.hpp"

#include "CommonDialogueRuntime_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// Class FortniteConversationRuntime.FortConversationParticipantComponent
// 0x0018 (0x0180 - 0x0168)
class UFortConversationParticipantComponent : public UConversationParticipantComponent
{
public:
	class UInputComponent*                        ConversationInputComp;                             // 0x0168(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_170[0x10];                                     // 0x0170(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationParticipantComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationParticipantComponent")
	}
	static class UFortConversationParticipantComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortConversationParticipantComponent>();
	}
};
DUMPER7_ASSERTS_UFortConversationParticipantComponent;

// Class FortniteConversationRuntime.FortConversationPawn
// 0x0018 (0x0BF0 - 0x0BD8)
class AFortConversationPawn final : public ABuildingProp
{
public:
	struct FGameplayTag                           ConversationEntryTag;                              // 0x0BD8(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           InteractorParticipantTag;                          // 0x0BE0(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           SelfParticipantTag;                                // 0x0BE8(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortConversationPawn")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortConversationPawn")
	}
	static class AFortConversationPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortConversationPawn>();
	}
};
DUMPER7_ASSERTS_AFortConversationPawn;

// Class FortniteConversationRuntime.FortPlayerConversationComponent
// 0x0038 (0x01B8 - 0x0180)
class UFortPlayerConversationComponent : public UFortConversationParticipantComponent
{
public:
	uint8                                         Pad_180[0x8];                                      // 0x0180(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   DialogWidgetSoftClass;                             // 0x0188(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UUserWidget*                            DialogWidgetInstance;                              // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortPlayerConversationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortPlayerConversationComponent")
	}
	static class UFortPlayerConversationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortPlayerConversationComponent>();
	}
};
DUMPER7_ASSERTS_UFortPlayerConversationComponent;

SDK_NAMESPACE_END
