#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hotfix_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonUI_structs.hpp"
#include "MediaUtils_structs.hpp"
#include "Party_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function FortniteUI.FortActivatablePanel.AsyncPlaySound2D
// 0x0040 (0x0040 - 0x0000)
struct FortActivatablePanel_AsyncPlaySound2D final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundBase>              SoundToLoad;                                       // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeMultiplier;                                  // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortActivatablePanel_AsyncPlaySound2D;

// Function FortniteUI.FortActivatablePanel.RestoreCenterWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreCenterWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanel_RestoreCenterWidget;

// Function FortniteUI.FortActivatablePanel.RestoreScrollWidget
// 0x0008 (0x0008 - 0x0000)
struct FortActivatablePanel_RestoreScrollWidget final
{
public:
	class UWidget*                                FallbackWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortActivatablePanel_RestoreScrollWidget;

// Function FortniteUI.AthenaReplayBrowserScreenBase.OnActionStateChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaReplayBrowserScreenBase_OnActionStateChanged final
{
public:
	bool                                          bHasAction;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaReplayBrowserScreenBase_OnActionStateChanged;

// Function FortniteUI.AthenaSpatialScreen.AddSpatialScreenSessionCounter
// 0x0018 (0x0018 - 0x0000)
struct AthenaSpatialScreen_AddSpatialScreenSessionCounter final
{
public:
	class FString                                 Entry;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AthenaSpatialScreen_AddSpatialScreenSessionCounter;

// Function FortniteUI.AthenaSpatialScreen.FireSpatialScreenAnalytic
// 0x0010 (0x0010 - 0x0000)
struct AthenaSpatialScreen_FireSpatialScreenAnalytic final
{
public:
	class FString                                 Interaction;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaSpatialScreen_FireSpatialScreenAnalytic;

// Function FortniteUI.FortServerTileBase.OnLaunchButtonEnableChanged
// 0x0001 (0x0001 - 0x0000)
struct FortServerTileBase_OnLaunchButtonEnableChanged final
{
public:
	bool                                          bEnableValue;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortServerTileBase_OnLaunchButtonEnableChanged;

// Function FortniteUI.AthenaCollectionPlayerProgress.BP_OnPlayerProgressInitialized
// 0x000C (0x000C - 0x0000)
struct AthenaCollectionPlayerProgress_BP_OnPlayerProgressInitialized final
{
public:
	bool                                          bIsLocalPlayer;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumCollected;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumToCollect;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCollectionPlayerProgress_BP_OnPlayerProgressInitialized;

// Function FortniteUI.AthenaCollectionPlayerProgress.BP_OnShowPlayerInfoSet
// 0x0001 (0x0001 - 0x0000)
struct AthenaCollectionPlayerProgress_BP_OnShowPlayerInfoSet final
{
public:
	bool                                          bShowPlayerInfo;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCollectionPlayerProgress_BP_OnShowPlayerInfoSet;

// Function FortniteUI.AthenaCollectionPlayerProgress.GetNumCollected
// 0x0004 (0x0004 - 0x0000)
struct AthenaCollectionPlayerProgress_GetNumCollected final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCollectionPlayerProgress_GetNumCollected;

// Function FortniteUI.AthenaCollectionPlayerProgress.IsLocalPlayer
// 0x0001 (0x0001 - 0x0000)
struct AthenaCollectionPlayerProgress_IsLocalPlayer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaCollectionPlayerProgress_IsLocalPlayer;

// Function FortniteUI.AthenaBaseStatView.GetStat
// 0x000C (0x000C - 0x0000)
struct AthenaBaseStatView_GetStat final
{
public:
	struct FGameplayTag                           InStat;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaBaseStatView_GetStat;

// Function FortniteUI.FortCommunityVotingOption.HaveVotesRemaining
// 0x0001 (0x0001 - 0x0000)
struct FortCommunityVotingOption_HaveVotesRemaining final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCommunityVotingOption_HaveVotesRemaining;

// Function FortniteUI.FortPickerContext.GetAdjacentPickerWheelInformation
// 0x0028 (0x0028 - 0x0000)
struct FortPickerContext_GetAdjacentPickerWheelInformation final
{
public:
	int32                                         Direction;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   AdjacentTitle;                                     // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bCanPageThisDirection;                             // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortPickerContext_GetAdjacentPickerWheelInformation;

// Function FortniteUI.FortPickerContext.GetCurrentPickerDisplayName
// 0x0018 (0x0018 - 0x0000)
struct FortPickerContext_GetCurrentPickerDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_GetCurrentPickerDisplayName;

// Function FortniteUI.FortPickerContext.GetPickerWheelAdjacency
// 0x0002 (0x0002 - 0x0000)
struct FortPickerContext_GetPickerWheelAdjacency final
{
public:
	bool                                          bCanPageLeft;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanPageRight;                                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_GetPickerWheelAdjacency;

// Function FortniteUI.FortPickerContext.LegacySwitchToAdjacentWheel
// 0x0004 (0x0004 - 0x0000)
struct FortPickerContext_LegacySwitchToAdjacentWheel final
{
public:
	int32                                         SelectionDirection;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_LegacySwitchToAdjacentWheel;

// Function FortniteUI.FortPickerContext.PickerOptionAccepted
// 0x0004 (0x0004 - 0x0000)
struct FortPickerContext_PickerOptionAccepted final
{
public:
	int32                                         Option;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_PickerOptionAccepted;

// Function FortniteUI.FortPickerContext.SetFortPickerData
// 0x0008 (0x0008 - 0x0000)
struct FortPickerContext_SetFortPickerData final
{
public:
	class UFortPickerData*                        Data;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_SetFortPickerData;

// Function FortniteUI.FortPickerContext.ShowRadialPickerMenu
// 0x0010 (0x0010 - 0x0000)
struct FortPickerContext_ShowRadialPickerMenu final
{
public:
	EFortPickerToDisplay                          PickerType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WheelIndex;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextObject;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_ShowRadialPickerMenu;

// Function FortniteUI.FortPickerContext.DoesRadialCloseOnRelease
// 0x0001 (0x0001 - 0x0000)
struct FortPickerContext_DoesRadialCloseOnRelease final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_DoesRadialCloseOnRelease;

// Function FortniteUI.FortPickerContext.GetCurrentWheelIndex
// 0x0004 (0x0004 - 0x0000)
struct FortPickerContext_GetCurrentWheelIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_GetCurrentWheelIndex;

// Function FortniteUI.FortPickerContext.GetListPickerOption
// 0x0010 (0x0010 - 0x0000)
struct FortPickerContext_GetListPickerOption final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_GetListPickerOption;

// Function FortniteUI.FortPickerContext.GetNumPickerOptions
// 0x0004 (0x0004 - 0x0000)
struct FortPickerContext_GetNumPickerOptions final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_GetNumPickerOptions;

// Function FortniteUI.FortPickerContext.GetRadialPickerOptionImageAndLabel
// 0x00D8 (0x00D8 - 0x0000)
struct FortPickerContext_GetRadialPickerOptionImageAndLabel final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Label;                                             // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Brush;                                             // 0x0020(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x00A8(0x0028)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptionEnabled;                                    // 0x00D0(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLocked;                                         // 0x00D1(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortPickerContext_GetRadialPickerOptionImageAndLabel;

// Function FortniteUI.FortPickerContext.GetRadialPickerOptionItem
// 0x0018 (0x0018 - 0x0000)
struct FortPickerContext_GetRadialPickerOptionItem final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              Item;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptionEnabled;                                    // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortPickerContext_GetRadialPickerOptionItem;

// Function FortniteUI.FortPickerContext.UseLeftThumbstick
// 0x0001 (0x0001 - 0x0000)
struct FortPickerContext_UseLeftThumbstick final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortPickerContext_UseLeftThumbstick;

// Function FortniteUI.AthenaAboutModal.OnSetContent
// 0x0028 (0x0028 - 0x0000)
struct AthenaAboutModal_OnSetContent final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FText>                           InEntries;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AthenaAboutModal_OnSetContent;

// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortHUDElementWidget_HandleOnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHUDElementWidget_HandleOnHUDElementVisibilityChanged;

// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
// 0x0001 (0x0001 - 0x0000)
struct FortHUDElementWidget_OnVisibilitySetEvent final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHUDElementWidget_OnVisibilitySetEvent;

// Function FortniteUI.FortVoiceChannelSpeakerWidget.OnAnimateTalkingChanged
// 0x0001 (0x0001 - 0x0000)
struct FortVoiceChannelSpeakerWidget_OnAnimateTalkingChanged final
{
public:
	bool                                          bIsNowTalking;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortVoiceChannelSpeakerWidget_OnAnimateTalkingChanged;

// Function FortniteUI.FortVoiceChannelSpeakerWidget.OnStyleAssigned
// 0x0001 (0x0001 - 0x0000)
struct FortVoiceChannelSpeakerWidget_OnStyleAssigned final
{
public:
	EChannelSpeakerStyle                          NewStyle;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortVoiceChannelSpeakerWidget_OnStyleAssigned;

// Function FortniteUI.FortQuickBarSlotBase.GetKeyBindingAction
// 0x0008 (0x0008 - 0x0000)
struct FortQuickBarSlotBase_GetKeyBindingAction final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_GetKeyBindingAction;

// Function FortniteUI.FortQuickBarSlotBase.GetKeyBindingActionGamepad
// 0x0008 (0x0008 - 0x0000)
struct FortQuickBarSlotBase_GetKeyBindingActionGamepad final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_GetKeyBindingActionGamepad;

// Function FortniteUI.FortQuickBarSlotBase.GetKeyBindingActionKeyboard
// 0x0008 (0x0008 - 0x0000)
struct FortQuickBarSlotBase_GetKeyBindingActionKeyboard final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_GetKeyBindingActionKeyboard;

// Function FortniteUI.FortQuickBarSlotBase.MaximizeSlot
// 0x0001 (0x0001 - 0x0000)
struct FortQuickBarSlotBase_MaximizeSlot final
{
public:
	bool                                          bShouldSkipAnimation;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_MaximizeSlot;

// Function FortniteUI.FortQuickBarSlotBase.MinimizeSlot
// 0x0001 (0x0001 - 0x0000)
struct FortQuickBarSlotBase_MinimizeSlot final
{
public:
	bool                                          bShouldSkipAnimation;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_MinimizeSlot;

// Function FortniteUI.FortQuickBarSlotBase.RefreshItemIfSlotChanged
// 0x0018 (0x0018 - 0x0000)
struct FortQuickBarSlotBase_RefreshItemIfSlotChanged final
{
public:
	EFortQuickBars                                InQuickBar;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 InSlot;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_RefreshItemIfSlotChanged;

// Function FortniteUI.FortQuickBarSlotBase.Resize
// 0x0001 (0x0001 - 0x0000)
struct FortQuickBarSlotBase_Resize final
{
public:
	EFortItemCardSize                             CardSize;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_Resize;

// Function FortniteUI.FortQuickBarSlotBase.SetBottomComboSwitcherVisibility
// 0x0001 (0x0001 - 0x0000)
struct FortQuickBarSlotBase_SetBottomComboSwitcherVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_SetBottomComboSwitcherVisibility;

// Function FortniteUI.FortQuickBarSlotBase.SetBottomComboSwitcherVisibility_BP
// 0x0001 (0x0001 - 0x0000)
struct FortQuickBarSlotBase_SetBottomComboSwitcherVisibility_BP final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_SetBottomComboSwitcherVisibility_BP;

// Function FortniteUI.FortQuickBarSlotBase.SetQuickbarIndexRuntime
// 0x0008 (0x0008 - 0x0000)
struct FortQuickBarSlotBase_SetQuickbarIndexRuntime final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRefresh;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_SetQuickbarIndexRuntime;

// Function FortniteUI.FortQuickBarSlotBase.SetQuickbarTypeRuntime
// 0x0002 (0x0002 - 0x0000)
struct FortQuickBarSlotBase_SetQuickbarTypeRuntime final
{
public:
	EFortQuickBars                                NewQuickBarType;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRefresh;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_SetQuickbarTypeRuntime;

// Function FortniteUI.FortQuickBarSlotBase.SetSlotSelected
// 0x0001 (0x0001 - 0x0000)
struct FortQuickBarSlotBase_SetSlotSelected final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_SetSlotSelected;

// Function FortniteUI.FortQuickBarSlotBase.SetTopComboSwitcherVisibility
// 0x0001 (0x0001 - 0x0000)
struct FortQuickBarSlotBase_SetTopComboSwitcherVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_SetTopComboSwitcherVisibility;

// Function FortniteUI.FortQuickBarSlotBase.GetSlotSizeForItem
// 0x0010 (0x0010 - 0x0000)
struct FortQuickBarSlotBase_GetSlotSizeForItem final
{
public:
	const class UFortItem*                        InItem;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortQuickBarSlotBase_GetSlotSizeForItem;

// Function FortniteUI.FortAthenaVehicleDashboardWidget.OnAddedFuel
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaVehicleDashboardWidget_OnAddedFuel final
{
public:
	float                                         NewFuelPercent;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaVehicleDashboardWidget_OnAddedFuel;

// Function FortniteUI.FortAthenaVehicleDashboardWidget.OnFuelValueChanged
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaVehicleDashboardWidget_OnFuelValueChanged final
{
public:
	float                                         FuelPercentage;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLowOnFuel;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaVehicleDashboardWidget_OnFuelValueChanged;

// Function FortniteUI.FortAthenaVehicleDashboardWidget.SetupVehicleFuelWidget
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaVehicleDashboardWidget_SetupVehicleFuelWidget final
{
public:
	class AActor*                                 NewVehicle;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequestShowWidget;                                // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaVehicleDashboardWidget_SetupVehicleFuelWidget;

// Function FortniteUI.FortAthenaVehicleDashboardWidget.SetVehicleHasInfiniteFuel
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaVehicleDashboardWidget_SetVehicleHasInfiniteFuel final
{
public:
	bool                                          bInfiniteFuel;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaVehicleDashboardWidget_SetVehicleHasInfiniteFuel;

// Function FortniteUI.FortAthenaVehicleDashboardWidget.UpdateSpeedometer
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaVehicleDashboardWidget_UpdateSpeedometer final
{
public:
	float                                         NormalizedSpeed;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaVehicleDashboardWidget_UpdateSpeedometer;

// Function FortniteUI.FortAthenaVehicleDashboardWidget.GetHUDTopSpeed
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaVehicleDashboardWidget_GetHUDTopSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaVehicleDashboardWidget_GetHUDTopSpeed;

// Function FortniteUI.FortAthenaVehicleDashboardWidget.GetVehicle
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaVehicleDashboardWidget_GetVehicle final
{
public:
	class AFortAthenaVehicle*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaVehicleDashboardWidget_GetVehicle;

// Function FortniteUI.FortSettingsContext.AnonymousCharacterModeChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_AnonymousCharacterModeChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_AnonymousCharacterModeChanged;

// Function FortniteUI.FortSettingsContext.AnonymousModeChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_AnonymousModeChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_AnonymousModeChanged;

// Function FortniteUI.FortSettingsContext.AutoEquipChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_AutoEquipChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_AutoEquipChanged;

// Function FortniteUI.FortSettingsContext.ChatVolumeChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_ChatVolumeChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_ChatVolumeChanged;

// Function FortniteUI.FortSettingsContext.CinematicsVolumeChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_CinematicsVolumeChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_CinematicsVolumeChanged;

// Function FortniteUI.FortSettingsContext.DialogVolumeChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_DialogVolumeChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_DialogVolumeChanged;

// Function FortniteUI.FortSettingsContext.FirstPersonCameraChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_FirstPersonCameraChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_FirstPersonCameraChanged;

// Function FortniteUI.FortSettingsContext.GamepadBuildingMultiplierValueChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_GamepadBuildingMultiplierValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GamepadBuildingMultiplierValueChanged;

// Function FortniteUI.FortSettingsContext.GamepadEditModeMultiplierValueChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_GamepadEditModeMultiplierValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GamepadEditModeMultiplierValueChanged;

// Function FortniteUI.FortSettingsContext.GamepadLookSensitivityXChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_GamepadLookSensitivityXChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GamepadLookSensitivityXChanged;

// Function FortniteUI.FortSettingsContext.GamepadLookSensitivityYChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_GamepadLookSensitivityYChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GamepadLookSensitivityYChanged;

// Function FortniteUI.FortSettingsContext.GamepadScopedMultiplierValueChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_GamepadScopedMultiplierValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GamepadScopedMultiplierValueChanged;

// Function FortniteUI.FortSettingsContext.GamepadTargetingMultiplierValueChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_GamepadTargetingMultiplierValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GamepadTargetingMultiplierValueChanged;

// Function FortniteUI.FortSettingsContext.GetMotionAxisNames
// 0x0010 (0x0010 - 0x0000)
struct FortSettingsContext_GetMotionAxisNames final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GetMotionAxisNames;

// Function FortniteUI.FortSettingsContext.GetRotatorSettingValue
// 0x0008 (0x0008 - 0x0000)
struct FortSettingsContext_GetRotatorSettingValue final
{
public:
	ESettingType                                  InSettingType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GetRotatorSettingValue;

// Function FortniteUI.FortSettingsContext.GetSafeZoneValue
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_GetSafeZoneValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GetSafeZoneValue;

// Function FortniteUI.FortSettingsContext.GetSettingDisplayNames
// 0x0018 (0x0018 - 0x0000)
struct FortSettingsContext_GetSettingDisplayNames final
{
public:
	ESettingType                                  InSettingType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GetSettingDisplayNames;

// Function FortniteUI.FortSettingsContext.GetSettingValueInRange
// 0x000C (0x000C - 0x0000)
struct FortSettingsContext_GetSettingValueInRange final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESettingType                                  InSettingType;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESettingTab                                   InSettingTab;                                      // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GetSettingValueInRange;

// Function FortniteUI.FortSettingsContext.GetShowTemperature
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_GetShowTemperature final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GetShowTemperature;

// Function FortniteUI.FortSettingsContext.GetSliderSettingValue
// 0x0008 (0x0008 - 0x0000)
struct FortSettingsContext_GetSliderSettingValue final
{
public:
	ESettingType                                  InSettingType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GetSliderSettingValue;

// Function FortniteUI.FortSettingsContext.GyroSensitivityValueChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_GyroSensitivityValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_GyroSensitivityValueChanged;

// Function FortniteUI.FortSettingsContext.HiddenMatchmakingDelayMaxChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_HiddenMatchmakingDelayMaxChanged final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_HiddenMatchmakingDelayMaxChanged;

// Function FortniteUI.FortSettingsContext.HideOtherPlayerNamesChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_HideOtherPlayerNamesChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_HideOtherPlayerNamesChanged;

// Function FortniteUI.FortSettingsContext.HoldToSwapPickupChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_HoldToSwapPickupChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_HoldToSwapPickupChanged;

// Function FortniteUI.FortSettingsContext.InWorldInteractChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_InWorldInteractChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_InWorldInteractChanged;

// Function FortniteUI.FortSettingsContext.MotionAxisValueChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_MotionAxisValueChanged final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_MotionAxisValueChanged;

// Function FortniteUI.FortSettingsContext.MotionControlEnabledValueChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_MotionControlEnabledValueChanged final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_MotionControlEnabledValueChanged;

// Function FortniteUI.FortSettingsContext.MotionHarvestingToolMultiplierValueChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_MotionHarvestingToolMultiplierValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_MotionHarvestingToolMultiplierValueChanged;

// Function FortniteUI.FortSettingsContext.MotionScopedMultiplierValueChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_MotionScopedMultiplierValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_MotionScopedMultiplierValueChanged;

// Function FortniteUI.FortSettingsContext.MotionTargetingMultiplierValueChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_MotionTargetingMultiplierValueChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_MotionTargetingMultiplierValueChanged;

// Function FortniteUI.FortSettingsContext.MouseSensitivityMultiplierForAircraftChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_MouseSensitivityMultiplierForAircraftChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_MouseSensitivityMultiplierForAircraftChanged;

// Function FortniteUI.FortSettingsContext.MouseSensitivityXChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_MouseSensitivityXChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_MouseSensitivityXChanged;

// Function FortniteUI.FortSettingsContext.MouseSensitivityYChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_MouseSensitivityYChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_MouseSensitivityYChanged;

// Function FortniteUI.FortSettingsContext.MusicVolumeChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_MusicVolumeChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_MusicVolumeChanged;

// Function FortniteUI.FortSettingsContext.NotifyUsersWhenPlayingChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_NotifyUsersWhenPlayingChanged final
{
public:
	bool                                          bNotify;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_NotifyUsersWhenPlayingChanged;

// Function FortniteUI.FortSettingsContext.OnAimAssistChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnAimAssistChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnAimAssistChanged;

// Function FortniteUI.FortSettingsContext.OnAimAssistReset
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnAimAssistReset final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnAimAssistReset;

// Function FortniteUI.FortSettingsContext.OnAutoChangeMaterialChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnAutoChangeMaterialChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnAutoChangeMaterialChanged;

// Function FortniteUI.FortSettingsContext.OnAutoChangeMaterialReset
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnAutoChangeMaterialReset final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnAutoChangeMaterialReset;

// Function FortniteUI.FortSettingsContext.OnAutoOpenDoorsChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnAutoOpenDoorsChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnAutoOpenDoorsChanged;

// Function FortniteUI.FortSettingsContext.OnAutoPickupWeaponsChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnAutoPickupWeaponsChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnAutoPickupWeaponsChanged;

// Function FortniteUI.FortSettingsContext.OnAutoPickupWeaponsConsolePCChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnAutoPickupWeaponsConsolePCChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnAutoPickupWeaponsConsolePCChanged;

// Function FortniteUI.FortSettingsContext.OnAutoSortConsumablesToRightChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnAutoSortConsumablesToRightChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnAutoSortConsumablesToRightChanged;

// Function FortniteUI.FortSettingsContext.OnBuildingPossessionChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnBuildingPossessionChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnBuildingPossessionChanged;

// Function FortniteUI.FortSettingsContext.OnContextTutorialChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnContextTutorialChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnContextTutorialChanged;

// Function FortniteUI.FortSettingsContext.OnCreativeModeReplayRecordingPreferenceChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnCreativeModeReplayRecordingPreferenceChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnCreativeModeReplayRecordingPreferenceChanged;

// Function FortniteUI.FortSettingsContext.OnCreativeTurboDeleteChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnCreativeTurboDeleteChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnCreativeTurboDeleteChanged;

// Function FortniteUI.FortSettingsContext.OnCreativeTurboDeleteReset
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnCreativeTurboDeleteReset final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnCreativeTurboDeleteReset;

// Function FortniteUI.FortSettingsContext.OnCrossplayPreferenceChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnCrossplayPreferenceChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnCrossplayPreferenceChanged;

// Function FortniteUI.FortSettingsContext.OnEditButtonHoldTimeChanged
// 0x0004 (0x0004 - 0x0000)
struct FortSettingsContext_OnEditButtonHoldTimeChanged final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnEditButtonHoldTimeChanged;

// Function FortniteUI.FortSettingsContext.OnEditConfirmOnReleaseChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnEditConfirmOnReleaseChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnEditConfirmOnReleaseChanged;

// Function FortniteUI.FortSettingsContext.OnEditModeAimAssistChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnEditModeAimAssistChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnEditModeAimAssistChanged;

// Function FortniteUI.FortSettingsContext.OnEnableTryBuildOnFocusChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnEnableTryBuildOnFocusChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortSettingsContext_OnEnableTryBuildOnFocusChanged;

// Function FortniteUI.FortSettingsContext.OnFocusOnFirstBuildingPieceWhenQuickbarSwappedChanged
// 0x0001 (0x0001 - 0x0000)
struct FortSettingsContext_OnFocusOnFirstBuildingPieceWhenQuickbarSwappedChanged final
{
public:
	bool                                          bInChecked;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
