#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FriendSubscriptionToastWidget

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function FriendSubscriptionToastWidget.FriendSubscriptionToastWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FriendSubscriptionToastWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FriendSubscriptionToastWidget_C_PreConstruct;

// Function FriendSubscriptionToastWidget.FriendSubscriptionToastWidget_C.ExecuteUbergraph_FriendSubscriptionToastWidget
// 0x0030 (0x0030 - 0x0000)
struct FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FriendSubscriptionToastWidget_C_ExecuteUbergraph_FriendSubscriptionToastWidget;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
