#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass Frontend.Frontend_C
// 0x0018 (0x0250 - 0x0238)
class AFrontend_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NewLobby;                                          // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewVar_0;                                          // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHBOnboardingFlow_C*                    HBOnboardingFlow_ExecuteUbergraph_Frontend_RefProperty; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlaySpeech(const class FString& Filename, int32 SampleRate, class USoundWave* AssetFile);
	void OnMatchStarted();
	void EnableTutorial();
	void ExecuteUbergraph_Frontend(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Frontend_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Frontend_C")
	}
	static class AFrontend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontend_C>();
	}
};
DUMPER7_ASSERTS_AFrontend_C;

SDK_NAMESPACE_END
