#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_HeroLoadout

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass Frontend_HeroLoadout.Frontend_HeroLoadout_C
// 0x0088 (0x03D0 - 0x0348)
class AFrontend_HeroLoadout_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTransform                             Transform___HeroLoadOut;                           // 0x0350(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Transform___Command;                               // 0x0380(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AHeroLoadoutItemPedestal_C*             HL_Pedestal;                                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Command_Pedestal_Placement_ExecuteUbergraph_Frontend_HeroLoadout_RefProperty; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HeroLoadout_Pedestal_Placement_ExecuteUbergraph_Frontend_HeroLoadout_RefProperty; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Frontend_HeroLoadout(int32 EntryPoint);
	void HandleFrontendCameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void Command___Transform();
	void HeroLoadout___Transfrom();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Frontend_HeroLoadout_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Frontend_HeroLoadout_C")
	}
	static class AFrontend_HeroLoadout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontend_HeroLoadout_C>();
	}
};
DUMPER7_ASSERTS_AFrontend_HeroLoadout_C;

SDK_NAMESPACE_END
