#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ShockGrenade_RemoveFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Athena_ShockGrenade_RemoveFX.GA_Athena_ShockGrenade_RemoveFX_C
// 0x0028 (0x0AD0 - 0x0AA8)
class UGA_Athena_ShockGrenade_RemoveFX_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Looping_GC;                                        // 0x0AB8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Player_Landing_GC;                                 // 0x0AC0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           VehicleOnGroundTimer;                              // 0x0AC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_ShockGrenade_RemoveFX(int32 EntryPoint);
	void VehicleLandedCheck();
	void K2_ActivateAbility();
	void OnChange_FB10A796481939495F3E43A6ECDEF98E(EMovementMode NewMovementMode);
	void OnChange_4AD3DFC14DFECA79ED54A7B53F3A9E7E(EMovementMode NewMovementMode);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_ShockGrenade_RemoveFX_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_ShockGrenade_RemoveFX_C")
	}
	static class UGA_Athena_ShockGrenade_RemoveFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ShockGrenade_RemoveFX_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_ShockGrenade_RemoveFX_C;

SDK_NAMESPACE_END
