#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Thermal_Parent_PostProcess

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Athena_Thermal_Parent_PostProcess.GA_Athena_Thermal_Parent_PostProcess_C
// 0x0058 (0x0B00 - 0x0AA8)
class UGA_Athena_Thermal_Parent_PostProcess_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           PP_Cue;                                            // 0x0AB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            PlayerController;                                  // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_QuestTargetTags;                                // 0x0AC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  NullTagContainer;                                  // 0x0AE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_Thermal_Parent_PostProcess(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_Thermal_Parent_PostProcess_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_Thermal_Parent_PostProcess_C")
	}
	static class UGA_Athena_Thermal_Parent_PostProcess_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Thermal_Parent_PostProcess_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_Thermal_Parent_PostProcess_C;

SDK_NAMESPACE_END
