#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_GenericTargetApply_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Athena_ActivePower_StandardActivation_Parent_classes.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C
// 0x0030 (0x0C90 - 0x0C60)
class UGA_Athena_ActivePower_GenericTargetApply_Parent_C : public UGA_Athena_ActivePower_StandardActivation_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ActivePower_GenericTargetApply_Parent_C; // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CommitOnEveryTargeting;                            // 0x0C68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C69[0x3];                                      // 0x0C69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag_TargetApplyNotify;                             // 0x0C6C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_TargetingApplication;                          // 0x0C74(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ApplyEffectLevel;                                  // 0x0C7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Targeting;                                      // 0x0C80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetingGCUsesParams;                             // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent(int32 EntryPoint);
	void CastMontageBlendOut();
	void ResetCommitDoOnce();
	void ApplyEffect(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Target_();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void CastMontageNotifyEndAbility();
	void CastMontageCancelledOrInterrupted();
	void PowerCommitFailed();
	void Targeted_712B318342E20326067585ADEC197F67(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_712B318342E20326067585ADEC197F67(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	struct FGameplayCueParameters TargetingGCParams();
	void InitAbility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_ActivePower_GenericTargetApply_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_ActivePower_GenericTargetApply_Parent_C")
	}
	static class UGA_Athena_ActivePower_GenericTargetApply_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ActivePower_GenericTargetApply_Parent_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_ActivePower_GenericTargetApply_Parent_C;

SDK_NAMESPACE_END
