#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_FloppingRabbit

#include "Basic.hpp"

#include "GA_ThrowConsumable_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Athena_FloppingRabbit.GA_Athena_FloppingRabbit_C
// 0x0028 (0x0E50 - 0x0E28)
class UGA_Athena_FloppingRabbit_C : public UGA_ThrowConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_FloppingRabbit_C;         // 0x0E28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           T_Active;                                          // 0x0E30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_InWorld;                                         // 0x0E38(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CastMontageWeapon;                                 // 0x0E40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InVehicleTag;                                      // 0x0E48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_FloppingRabbit(int32 EntryPoint);
	void ThrowMontageStarted();
	void K2_ActivateAbility();
	void Added_5FF18B9B4B9A1DE12D88D68E50AB8A5B();
	void OnCompleted_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnBlendOut_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnInterrupted_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnNotifyBegin_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);
	void OnNotifyEnd_27A3BC8E4EB0B07EA2FD509EEE97AFC7(class FName NotifyName);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_FloppingRabbit_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_FloppingRabbit_C")
	}
	static class UGA_Athena_FloppingRabbit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_FloppingRabbit_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_FloppingRabbit_C;

SDK_NAMESPACE_END
