#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_LeapGlider_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Athena_ActivePower_Leap_Parent_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Athena_ActivePower_LeapGlider_Parent.GA_Athena_ActivePower_LeapGlider_Parent_C
// 0x0108 (0x1008 - 0x0F00)
class UGA_Athena_ActivePower_LeapGlider_Parent_C : public UGA_Athena_ActivePower_Leap_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ActivePower_LeapGlider_Parent_C; // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaGliderItemDefinition*            Glider_Cosmetic_Override;                          // 0x0F08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OpenGliderSoundCue;                                // 0x0F10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LensEffectClass;                                   // 0x0F18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitterCameraLensEffectBase*           LensEffect;                                        // 0x0F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_SkyDivingMessageTag;                             // 0x0F28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_StartRedeploy;                                   // 0x0F48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          GenericFailsafeHit;                                // 0x0F50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ParachuteOpened;                                   // 0x0F51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F52[0x6];                                      // 0x0F52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  T_OpenParahcute;                                   // 0x0F58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  BlockedTags;                                       // 0x0F78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_GrantedActive;                                  // 0x0F98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_InfCooldown;                                    // 0x0FB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_MinActiveTime;                                  // 0x0FD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_MinActiveTime;                                 // 0x0FE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_Active;                                         // 0x1000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_ActivePower_LeapGlider_Parent(int32 EntryPoint);
	void HandleItemEquip();
	void WeaponUnequipped();
	void BoardDroppedMidGlide(const class UFortWorldItem* ItemDropped);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnLand(const struct FHitResult& Hit);
	void GenericFailSafe();
	void MovementModeChangeFailSafe(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void K2_ActivateAbility();
	void PowerCommitFailed();
	void CastMontageCancelledOrInterrupted();
	void CastMontageNotifyEndAbility();
	void CastMontageBlendOut();
	void CleanupAbility();
	void OnSync_68C1AC134C9324B6EC0F089B02953286();
	void OnSync_3ADE1BE041AF08C4CB1C9FA374F2E496();
	void EventReceived_46002FDB48565B7FA88DA089C488CA73(const struct FGameplayEventData& Payload);
	void OnSync_48D3266A4217EF7058D7FCA507015CB5();
	void Added_9CF55B3043720DD4EE05809F2B45DD91();
	void OnSync_5B9655A74696A7C0515A278467F52358();
	void InitAbility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_ActivePower_LeapGlider_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_ActivePower_LeapGlider_Parent_C")
	}
	static class UGA_Athena_ActivePower_LeapGlider_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ActivePower_LeapGlider_Parent_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_ActivePower_LeapGlider_Parent_C;

SDK_NAMESPACE_END
