#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_SpawnProjectile_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_Athena_ActivePower_StandardActivation_Parent_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Athena_ActivePower_SpawnProjectile_Parent.GA_Athena_ActivePower_SpawnProjectile_Parent_C
// 0x0320 (0x0F80 - 0x0C60)
class UGA_Athena_ActivePower_SpawnProjectile_Parent_C : public UGA_Athena_ActivePower_StandardActivation_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ActivePower_SpawnProjectile_Parent_C; // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 ProjectileToSpawn;                                 // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_ProjectileSpeed;                               // 0x0C70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ProjectileGravity;                             // 0x0C90(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Proj_UseProjectileSpeedAndGrav;                    // 0x0CB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB1[0x3];                                      // 0x0CB1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Proj_SpawnSocket;                                  // 0x0CB4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CBC[0x4];                                      // 0x0CBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_SpawnPitchOffset;                              // 0x0CC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Proj_SpawnWorldOffset;                             // 0x0CE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Proj_SpawnForwardOffset;                           // 0x0CEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProjUsesAbilityChargeMult;                         // 0x0CF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF1[0x3];                                      // 0x0CF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Proj_ChargePercent;                                // 0x0CF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Proj_HitApplicationTag;                          // 0x0CF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Proj_HitEffectLevel;                               // 0x0D00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D04[0x4];                                      // 0x0D04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       Spec_Hit;                                          // 0x0D08(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	struct FGameplayTag                           T_Proj_ExplodeApplicationTag;                      // 0x0DC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Proj_ExplodeEffectLevel;                           // 0x0DC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DCC[0x4];                                      // 0x0DCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       Spec_Explode;                                      // 0x0DD0(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)
	class AFortProjectileBase*                    LastProjectileSpawned;                             // 0x0E88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_SpawnProjectileNotify;                           // 0x0E90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CommitOnEveryProjectile;                           // 0x0E98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E99[0x7];                                      // 0x0E99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AFortProjectileBase* ProjectileSpawned)> OnProjectileSpawned; // 0x0EA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FGameplayTag                           GC_SpawnProjectile;                                // 0x0EB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnProjectileGCUsesParams;                       // 0x0EB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UsesAdditionalExplosionContainer;                  // 0x0EB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EBA[0x2];                                      // 0x0EBA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           T_Proj_AdditionalExplodeApplicationTag;            // 0x0EBC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Proj_AdditionalExplodeEffectLevel;                 // 0x0EC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       Spec_AdditionalExplode;                            // 0x0EC8(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance, AdvancedDisplay)

public:
	void ExecuteUbergraph_GA_Athena_ActivePower_SpawnProjectile_Parent(int32 EntryPoint);
	void CastMontageBlendOut();
	void ResetCommitDoOnce();
	void CastMontageNotifyEndAbility();
	void CastMontageCancelledOrInterrupted();
	void PowerCommitFailed();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void UpdateTrajectory();
	void InitTrajectoryVariables();
	void CleanupTrajectoryIndicatorOnUnequip();
	void PowerSpawnProjectile(class AFortProjectileBase** ProjectileSpawned);
	void GetProjectileSpawnLocationAndRotation(struct FVector* Location, struct FRotator* Direction);
	void Get_Homing_Target(class AActor** HomingTarget);
	void MakeEffectContainers(struct FFortGameplayEffectContainerSpec* Hit, struct FFortGameplayEffectContainerSpec* Explode);
	void InitAbility();
	struct FGameplayCueParameters SpawnProjectileGCParams();
	void AddAdditionalExplosionContainer(class AFortProjectileBase* Projectile);
	class AFortProjectileTrajectory* SpawnTrajectoryIndicator(bool bSpawnOnEquip);
	void GetProjectileTrajectoryPoints(TArray<struct FVector>* OutSplinePoints, TArray<struct FVector>* OutSplineTangents, struct FHitResult* OutHitResult);

	bool ShouldOnlyShowTrajectoryOnUse() const;
	TSubclassOf<class AFortProjectileTrajectory> GetProjectileTrajectoryActor() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_ActivePower_SpawnProjectile_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_ActivePower_SpawnProjectile_Parent_C")
	}
	static class UGA_Athena_ActivePower_SpawnProjectile_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ActivePower_SpawnProjectile_Parent_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_ActivePower_SpawnProjectile_Parent_C;

SDK_NAMESPACE_END
