#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_Leap_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Athena_Power_Leap_Type_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Athena_ActivePower_StandardActivation_Parent_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Athena_ActivePower_Leap_Parent.GA_Athena_ActivePower_Leap_Parent_C
// 0x02A0 (0x0F00 - 0x0C60)
class UGA_Athena_ActivePower_Leap_Parent_C : public UGA_Athena_ActivePower_StandardActivation_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_ActivePower_Leap_Parent_C; // 0x0C60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Tag_TargetingLandApplication;                      // 0x0C68(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Target;                                         // 0x0C70(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetGCUsesParams;                                // 0x0C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C79[0x3];                                      // 0x0C79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ApplyEffectLevelTargetLand;                        // 0x0C7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthena_Power_Leap_Type                       LeapType;                                          // 0x0C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C81[0x3];                                      // 0x0C81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag_LeapNotify;                                    // 0x0C84(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Land;                                           // 0x0C8C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LandGCUsesParams;                                  // 0x0C94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasLand;                                           // 0x0C95(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C96[0x2];                                      // 0x0C96(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CastMontageLandSection;                            // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetOnLand;                                      // 0x0CA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OnLeapSetIgnoreNextFall;                           // 0x0CA1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OnLeapResetFallHeight;                             // 0x0CA2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA3[0x1];                                      // 0x0CA3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GC_Leap;                                           // 0x0CA4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LeapGCUsesParams;                                  // 0x0CAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CAD[0x3];                                      // 0x0CAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_VerticalLaunchMagnitude;                       // 0x0CB0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_HorizontalLaunchMagnitude;                     // 0x0CD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_VertitcalVelocityPercentMaintained;            // 0x0CF0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          VerticalVelocityMustMatchImpulse;                  // 0x0D10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D11[0x7];                                      // 0x0D11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_HorizontalVelocityPercentMaintained;           // 0x0D18(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          VerticalLaunchMagnitudeUsesCharge;                 // 0x0D38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HorizontalLaunchMagnitudeUsesCharge;               // 0x0D39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BaseLaunchDirectionOnAcceleration;                 // 0x0D3A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3B[0x5];                                      // 0x0D3B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_ArcLeapDistance;                               // 0x0D40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	ETraceTypeQuery                               ArcLeapLocationTraceChannel;                       // 0x0D60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D61[0x3];                                      // 0x0D61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ArcTraceRadius;                                    // 0x0D64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_ArcNoTargetLeapDistanceMultiplier;             // 0x0D68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ArcLeapDistanceUsesCharge;                         // 0x0D88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D89[0x3];                                      // 0x0D89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag_TargetingApplication;                          // 0x0D8C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ApplyEffectLevelTarget;                            // 0x0D94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ZeroAccelerationAssumesForward;                    // 0x0D98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TriggerLandOnEnterWater;                           // 0x0D99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LandedInWater;                                     // 0x0D9A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          BlockPlayerMovementForLand;                        // 0x0D9B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DoesTargetingWhileLeaping;                         // 0x0D9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9D[0x3];                                      // 0x0D9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_WhileLeapingTraceFrames;                       // 0x0DA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_LeapingTargetCapsuleRadius;                    // 0x0DC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_LeapingTargetCapsuleHalfHeight;                // 0x0DE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         TargetWhileLeapingInterval;                        // 0x0E00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E04[0x4];                                      // 0x0E04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer_TargetWhileLeaping;                          // 0x0E08(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      WhileLeapingTargetObjectTypes;                     // 0x0E10(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AActor*>                         WhileLeapingHitActors;                             // 0x0E20(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)
	class UClass*                                 GE_WhileLeapingHit;                                // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WhileLeapingEffectLevel;                           // 0x0E38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_LeapingLoop;                                    // 0x0E3C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          LeapingLoopGCUsesParams;                           // 0x0E44(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TargetWhileLeapRequiresChargeThreshold;            // 0x0E45(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E46[0x2];                                      // 0x0E46(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         TargetWhileLeapChargeThreshold;                    // 0x0E48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          EndAbilityOnLeapFinish;                            // 0x0E68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E69[0x7];                                      // 0x0E69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_LeapDuration;                                  // 0x0E70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveFloat*                            Curve_StrengthOverTime;                            // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GravityOnLeap;                                     // 0x0E98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E99[0x3];                                      // 0x0E99(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CalculatedLaunchVelocity;                          // 0x0E9C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UCurveVector*                           Curve_LeapPathOffset;                              // 0x0EA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CalculatedArcTargetLocation;                       // 0x0EB0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	ERootMotionFinishVelocityMode                 VelocityOnFinish;                                  // 0x0EBC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EBD[0x3];                                      // 0x0EBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SetVelOnFinish;                                    // 0x0EC0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClampVelOnFinish;                                  // 0x0ECC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionMoveToForce* LeapMoveToTask;                                   // 0x0ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionConstantForce* LeapConstTask;                                  // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               WhileLeapingDrawDebug;                             // 0x0EE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          GiveNextLandFallImmunityOnLeap;                    // 0x0EE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE2[0x6];                                      // 0x0EE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_FallDamageImmunity;                             // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEH_FallDamageImmunity;                            // 0x0EF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceRemoveLeapingLoopOnEnd;                       // 0x0EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Athena_ActivePower_Leap_Parent(int32 EntryPoint);
	void CleanUpOnLand();
	void SetWaterBinding();
	void CastMontageBlendOut();
	void OnLeapFinish();
	void ResetLandDoOnce();
	void K2_OnEndAbility(bool bWasCancelled);
	void StartTargetingWhileLeaping();
	void LaunchPlayer();
	void TargetWhileLeaping();
	void PlayerEnterWater(class AFortPlayerPawn* FortPlayerPawn);
	void OnLand(const struct FHitResult& Hit);
	void Target();
	void Leap();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void CastMontageNotifyEndAbility();
	void CastMontageCancelledOrInterrupted();
	void PowerCommitFailed();
	void TargetLand();
	void ApplyEffect(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag, int32 ApplyEffectLevel);
	void Added_4AFB1A714908D5D644343FBEE4D1439D();
	void OnTimedOut_AA23A03A4BF870123217CFA9BF23BAB1();
	void OnTimedOutAndDestinationReached_AA23A03A4BF870123217CFA9BF23BAB1();
	void OnFinish_9F5DC18E4B89C436F6868EA0C59CAE68();
	void Targeted_99BB82FC44E77279564E1682CE7A7B69(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_99BB82FC44E77279564E1682CE7A7B69(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Targeted_2DF7971548860AB5EB1DD2BB833D040D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_2DF7971548860AB5EB1DD2BB833D040D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	struct FGameplayCueParameters TargetGCParams();
	struct FGameplayCueParameters LandGCParams();
	void SetFallSettings();
	struct FGameplayCueParameters LeapGCParams();
	struct FVector GetLaunchVelocity();
	struct FVector GetVelocityPercent();
	struct FVector GetArcTargetLocation();
	float ModifyLaunchMagWithCharge(float Mag, bool Modify);
	struct FVector GetAccelerationValue(class ACharacter* Pawn);
	void ApplyEffectToWhileLeapingTargets(TArray<struct FHitResult>& Array);
	struct FGameplayCueParameters LeapingLoopGCParams();
	void InitAbility();
	void GetArcCustomLocation(struct FVector* Location);
	void SelectArcLocation(struct FVector* TargetLocation);
	void GetClampVelocityOnFinish(float* ClampVelOnFinish_0);
	void GetSetVelocityOnFinish(struct FVector* SetVelOnFinish_0);
	float GetLeapDuration();
	void Give_Till_Land_Fall_Immunity();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_ActivePower_Leap_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_ActivePower_Leap_Parent_C")
	}
	static class UGA_Athena_ActivePower_Leap_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ActivePower_Leap_Parent_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_ActivePower_Leap_Parent_C;

SDK_NAMESPACE_END
