#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_GenericTargetApply_Parent

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent
// 0x01E0 (0x01E0 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0008(0x0028)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0038(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate; // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_Event_NotifyTag;                            // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0088(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1; // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue_1;     // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_TargetingGCParams_ReturnValue;            // 0x00E0(0x00B8)(ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x01A0(0x0028)()
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x01D0(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Athena_ActivePower_GenericTargetApply_Parent_C_ExecuteUbergraph_GA_Athena_ActivePower_GenericTargetApply_Parent;

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.ApplyEffect
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Athena_ActivePower_GenericTargetApply_Parent_C_ApplyEffect;

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.CastMontageNotifyStart
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_CastMontageNotifyStart final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Athena_ActivePower_GenericTargetApply_Parent_C_CastMontageNotifyStart;

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.Targeted_712B318342E20326067585ADEC197F67
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Athena_ActivePower_GenericTargetApply_Parent_C_Targeted_712B318342E20326067585ADEC197F67;

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.Cancelled_712B318342E20326067585ADEC197F67
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Athena_ActivePower_GenericTargetApply_Parent_C_Cancelled_712B318342E20326067585ADEC197F67;

// Function GA_Athena_ActivePower_GenericTargetApply_Parent.GA_Athena_ActivePower_GenericTargetApply_Parent_C.TargetingGCParams
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Athena_ActivePower_GenericTargetApply_Parent_C_TargetingGCParams final
{
public:
	struct FGameplayCueParameters                 ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_Athena_ActivePower_GenericTargetApply_Parent_C_TargetingGCParams;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
