#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_ActivePower_LeapGlider_Cancel_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Athena_ActivePower_LeapGlider_Cancel_Parent.GA_Athena_ActivePower_LeapGlider_Cancel_Parent_C
// 0x0070 (0x0B18 - 0x0AA8)
class UGA_Athena_ActivePower_LeapGlider_Cancel_Parent_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  T_ChangeEquipment;                                 // 0x0AB0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_ActiveTag;                                      // 0x0AD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_InfCooldown;                                    // 0x0AF0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           T_CancelCooldown;                                  // 0x0B10(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_ActivePower_LeapGlider_Cancel_Parent(int32 EntryPoint);
	void RanAbilitySuccesfully();
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_ActivePower_LeapGlider_Cancel_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_ActivePower_LeapGlider_Cancel_Parent_C")
	}
	static class UGA_Athena_ActivePower_LeapGlider_Cancel_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_ActivePower_LeapGlider_Cancel_Parent_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_ActivePower_LeapGlider_Cancel_Parent_C;

SDK_NAMESPACE_END
