#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_AppleSun_WithTrajectory

#include "Basic.hpp"

#include "GA_ThrowConsumable_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Athena_AppleSun_WithTrajectory.GA_Athena_AppleSun_WithTrajectory_C
// 0x0060 (0x0E88 - 0x0E28)
class UGA_Athena_AppleSun_WithTrajectory_C final : public UGA_ThrowConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_AppleSun_WithTrajectory_C; // 0x0E28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          LocationIsValid;                                   // 0x0E30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E31[0x3];                                      // 0x0E31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OffsetLocation;                                    // 0x0E34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemDef;                                           // 0x0E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               ItemDef_VR;                                        // 0x0E40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Recharging_Tags;                                   // 0x0E48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  VR_tag;                                            // 0x0E68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Athena_AppleSun_WithTrajectory(int32 EntryPoint);
	void Remove_Item_();
	void UpdateTrajectory();
	void K2_CommitExecute();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Athena_AppleSun_WithTrajectory_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Athena_AppleSun_WithTrajectory_C")
	}
	static class UGA_Athena_AppleSun_WithTrajectory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_AppleSun_WithTrajectory_C>();
	}
};
DUMPER7_ASSERTS_UGA_Athena_AppleSun_WithTrajectory_C;

SDK_NAMESPACE_END
