#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Wasabi_Claws_AirHit_Move

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_HighTower_Wasabi_Claws_AirHit_Move.GA_HighTower_Wasabi_Claws_AirHit_Move_C
// 0x01E0 (0x0C88 - 0x0AA8)
class UGA_HighTower_Wasabi_Claws_AirHit_Move_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPawn*                              Pawn;                                              // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_KnockBackImmunity;                              // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Handle_KnockbackImmunity;                          // 0x0AC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   SavedCollisionChannel;                             // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FailsafeTimerHandle;                               // 0x0AD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FailsafeAbilityDuration;                           // 0x0AD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ADC[0x4];                                      // 0x0ADC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DesiredLandingDistanceFromTarget;                  // 0x0AE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DistanceToTarget;                                  // 0x0B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActorsCombinedScaledRadiusSize;                    // 0x0B04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         TravelDistanceNoTarget;                            // 0x0B08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxTravelDuration;                                 // 0x0B28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinTravelDuration;                                 // 0x0B48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveVector*                           PathOffsetCurve;                                   // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         SpeedAfterTravelNoTarget;                          // 0x0B78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityTask_ApplyRootMotionMoveToActorForce* RootMotionMoveToActorTask;                   // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionMoveToForce* RootMotionMoveToForceTask;                        // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHeightToBeConsideredOnGround;                   // 0x0BA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BAC[0x4];                                      // 0x0BAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         GravityOverrideAfterFinishTravel;                  // 0x0BB0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         GravityDurationAfterFinishTravel;                  // 0x0BD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          AbilityActive;                                     // 0x0BF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BF1[0x7];                                      // 0x0BF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_SetGravityAfterFinishTravel;                    // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConstrainNoTargetMovementToHorizontalOnly;         // 0x0C00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C01[0x7];                                      // 0x0C01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_Cooldown;                                       // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MontageStartSection;                               // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_FindTarget;                                    // 0x0C20(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_DamageContainer;                               // 0x0C28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_EndAbility;                                    // 0x0C30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_ActivePower;                                    // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Handle_GE_ActivePower;                             // 0x0C40(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ZVelocityClampAfterTravelNoTarget;                 // 0x0C48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_Landed_MoveSpeed;                               // 0x0C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_PreventJumpOnActivate;                          // 0x0C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_KnockedBack;                                   // 0x0C78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      Task_OnKnockedBack;                                // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Wasabi_Claws_AirHit_Move(int32 EntryPoint);
	void BindOnKnockedBack();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void FinishAbility();
	void FinishedMoving();
	void FailSafeTimer();
	void Added_91F3EC48431FC438313FA4BD75E84263();
	void Targeted_1465C132499C5AE7D48062BD3C4821CF(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_1465C132499C5AE7D48062BD3C4821CF(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnCompleted_6D78318F4DE2AC168A16859F16564240(const struct FGameplayTag& NotifyTag);
	void OnBlendOut_6D78318F4DE2AC168A16859F16564240(const struct FGameplayTag& NotifyTag);
	void OnInterrupted_6D78318F4DE2AC168A16859F16564240(const struct FGameplayTag& NotifyTag);
	void OnCancelled_6D78318F4DE2AC168A16859F16564240(const struct FGameplayTag& NotifyTag);
	void OnNotifyBegin_6D78318F4DE2AC168A16859F16564240(const struct FGameplayTag& NotifyTag);
	void OnNotifyEnd_6D78318F4DE2AC168A16859F16564240(const struct FGameplayTag& NotifyTag);
	void Targeted_92ECF2A7400141A084C8DB9199B6EA5D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_92ECF2A7400141A084C8DB9199B6EA5D(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void OnTimedOut_FF2A6E7C4270A27EB71452A8D7959034();
	void OnTimedOutAndDestinationReached_FF2A6E7C4270A27EB71452A8D7959034();
	void OnFinished_9DF085EB4FE8952D7AC79889F4433491(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation);
	void InitAbility();
	void SetKnockbackImmunity(bool ImmunityOn);
	void SetPawnCollision(class AFortPawn* FortPawn, bool CollisionOn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_HighTower_Wasabi_Claws_AirHit_Move_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_HighTower_Wasabi_Claws_AirHit_Move_C")
	}
	static class UGA_HighTower_Wasabi_Claws_AirHit_Move_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Wasabi_Claws_AirHit_Move_C>();
	}
};
DUMPER7_ASSERTS_UGA_HighTower_Wasabi_Claws_AirHit_Move_C;

SDK_NAMESPACE_END
