#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_CooldownOnLand_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_HighTower_CooldownOnLand_Parent.GA_HighTower_CooldownOnLand_Parent_C
// 0x0058 (0x0B00 - 0x0AA8)
class UGA_HighTower_CooldownOnLand_Parent_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Tag_SurfaceSwimming;                               // 0x0AB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_IgnoreApplication;                              // 0x0AB8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Tag_InVehicle;                                     // 0x0AD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Tag_AssetTagToRemove;                              // 0x0AE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_HighTower_CooldownOnLand_Parent(int32 EntryPoint);
	void K2_ActivateAbility();
	void CallRemove();
	void PawnLanded(const struct FHitResult& Hit);
	void SetUpBinds();
	void SetUpWaits();
	void Added_FF63B9CA43E2AA1106AA64B0B845E754();
	void Added_110E5507443E119AB2CF2885652DF496();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_HighTower_CooldownOnLand_Parent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_HighTower_CooldownOnLand_Parent_C")
	}
	static class UGA_HighTower_CooldownOnLand_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_CooldownOnLand_Parent_C>();
	}
};
DUMPER7_ASSERTS_UGA_HighTower_CooldownOnLand_Parent_C;

SDK_NAMESPACE_END
