#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Hightower_Wasabi_Claws_Mantis

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GA_Hightower_Wasabi_Claws_Mantis.GA_Hightower_Wasabi_Claws_Mantis_C.ExecuteUbergraph_GA_Hightower_Wasabi_Claws_Mantis
// 0x0040 (0x0040 - 0x0000)
struct GA_Hightower_Wasabi_Claws_Mantis_C_ExecuteUbergraph_GA_Hightower_Wasabi_Claws_Mantis final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NotifyTag;                            // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_2; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_3; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GA_Hightower_Wasabi_Claws_Mantis_C_ExecuteUbergraph_GA_Hightower_Wasabi_Claws_Mantis;

// Function GA_Hightower_Wasabi_Claws_Mantis.GA_Hightower_Wasabi_Claws_Mantis_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Hightower_Wasabi_Claws_Mantis_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GA_Hightower_Wasabi_Claws_Mantis_C_K2_OnEndAbility;

// Function GA_Hightower_Wasabi_Claws_Mantis.GA_Hightower_Wasabi_Claws_Mantis_C.OnGenericNotifyFromAnimation
// 0x0008 (0x0008 - 0x0000)
struct GA_Hightower_Wasabi_Claws_Mantis_C_OnGenericNotifyFromAnimation final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Hightower_Wasabi_Claws_Mantis_C_OnGenericNotifyFromAnimation;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
