#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Date_BallLightning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_Athena_ActivePower_SpawnProjectile_Parent_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_HighTower_Date_BallLightning.GA_HighTower_Date_BallLightning_C
// 0x0020 (0x0FA0 - 0x0F80)
class UGA_HighTower_Date_BallLightning_C : public UGA_Athena_ActivePower_SpawnProjectile_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_HighTower_Date_BallLightning_C;  // 0x0F80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          FiringAllowed;                                     // 0x0F88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InputReleased;                                     // 0x0F89(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F8A[0x2];                                      // 0x0F8A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           T_OkToThrowNotify;                                 // 0x0F8C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         HoldStartTime;                                     // 0x0F94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinHoldTime;                                       // 0x0F98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Date_BallLightning(int32 EntryPoint);
	void CustomEvent_2(class AFortProjectileBase* ProjectileSpawned);
	void K2_ActivateAbility();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void MulticastThrow();
	void CustomEvent_1();
	void K2_OnEndAbility(bool bWasCancelled);
	void Released(float HoldTime);
	void OnSync_CD7C69E84CC97FE216AEA089D8A95231();
	void Added_5CB6885747BB3160A88BD2880752E130();
	void Added_60A0EC084FB8C048E3BA878CCFA25811();
	void InitAbility();
	void Check_Min_Hold_Time(bool* Success, float* MinTimeRemaining);
	void PowerSpawnProjectile(class AFortProjectileBase** ProjectileSpawned);

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_HighTower_Date_BallLightning_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_HighTower_Date_BallLightning_C")
	}
	static class UGA_HighTower_Date_BallLightning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Date_BallLightning_C>();
	}
};
DUMPER7_ASSERTS_UGA_HighTower_Date_BallLightning_C;

SDK_NAMESPACE_END
