#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_HoneyDew_JumpSmash_Smash

#include "Basic.hpp"

#include "GA_Athena_ActivePower_Leap_Parent_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_HighTower_HoneyDew_JumpSmash_Smash.GA_HighTower_HoneyDew_JumpSmash_Smash_C
// 0x00A0 (0x0FA0 - 0x0F00)
class UGA_HighTower_HoneyDew_JumpSmash_Smash_C final : public UGA_Athena_ActivePower_Leap_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_HighTower_HoneyDew_JumpSmash_Smash_C; // 0x0F00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_LaunchSpeed;                                   // 0x0F08(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MinAngle;                                      // 0x0F28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_MaxAngle;                                      // 0x0F48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  InfinteJumpTag;                                    // 0x0F68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         FallingCheckTick;                                  // 0x0F88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F8C[0x4];                                      // 0x0F8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FallingCheckHandle;                                // 0x0F90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         LandingFailSafeDelay;                              // 0x0F98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_Smash(int32 EntryPoint);
	void OnLand(const struct FHitResult& Hit);
	void K2_OnEndAbility(bool bWasCancelled);
	void Leap();
	void PlayLandAnyway();
	struct FVector GetLaunchVelocity();
	struct FGameplayCueParameters LandGCParams();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_HighTower_HoneyDew_JumpSmash_Smash_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_HighTower_HoneyDew_JumpSmash_Smash_C")
	}
	static class UGA_HighTower_HoneyDew_JumpSmash_Smash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_HoneyDew_JumpSmash_Smash_C>();
	}
};
DUMPER7_ASSERTS_UGA_HighTower_HoneyDew_JumpSmash_Smash_C;

SDK_NAMESPACE_END
