#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate.GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate_C.ExecuteUbergraph_GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate
// 0x00C0 (0x00C0 - 0x0000)
struct GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate_C_ExecuteUbergraph_GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate;

// Function GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate.GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_HighTower_Wasabi_Claws_SpinSlash_PreActivate_C_K2_ActivateAbilityFromEvent;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
