#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Grape_Bramble_IcySurface

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_HighTower_Grape_Bramble_IcySurface.GA_HighTower_Grape_Bramble_IcySurface_C
// 0x0050 (0x0AF8 - 0x0AA8)
class UGA_HighTower_Grape_Bramble_IcySurface_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SlopeTimer;                                        // 0x0AB8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         OldZ;                                              // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewZ;                                              // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GELEvel;                                           // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartingVelocity;                                  // 0x0ACC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            IcyFeetSurfaceHandle;                              // 0x0AD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            AccelHandle;                                       // 0x0AE0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultWalkableAngle;                              // 0x0AE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ImmunityHandle;                                    // 0x0AEC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Grape_Bramble_IcySurface(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void CheckSlope();
	void SetSpeedVars();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_HighTower_Grape_Bramble_IcySurface_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_HighTower_Grape_Bramble_IcySurface_C")
	}
	static class UGA_HighTower_Grape_Bramble_IcySurface_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Grape_Bramble_IcySurface_C>();
	}
};
DUMPER7_ASSERTS_UGA_HighTower_Grape_Bramble_IcySurface_C;

SDK_NAMESPACE_END
