#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_Tomato_RepulsorCannon

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GA_Athena_ActivePower_GenericTargetApply_Parent_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_HighTower_Tomato_RepulsorCannon.GA_HighTower_Tomato_RepulsorCannon_C
// 0x00E0 (0x0D70 - 0x0C90)
class UGA_HighTower_Tomato_RepulsorCannon_C : public UGA_Athena_ActivePower_GenericTargetApply_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_HighTower_Tomato_RepulsorCannon_C; // 0x0C90(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Range;                                             // 0x0C98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                FxBeamEndPoint;                                    // 0x0CB8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_BeamLoop;                                       // 0x0CC4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CCC[0x4];                                      // 0x0CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LimitRotationTickHandle;                           // 0x0CD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AimScale;                                          // 0x0CD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_Slow_Handle;                                    // 0x0CDC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseStrength;                                   // 0x0CE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditionalZLaunch;                                 // 0x0CE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SlowDuringHover;                                   // 0x0CEC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SlowRotationDuringAbility;                         // 0x0CED(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CEE[0x2];                                      // 0x0CEE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           GC_Blast;                                          // 0x0CF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_ChargeUp;                                       // 0x0CF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         SavedHitActors;                                    // 0x0D00(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class AActor*>                         TargetDataArray;                                   // 0x0D10(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	struct FScalableFloat                         NumberOfTraces;                                    // 0x0D20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         TimeBetweenTraces;                                 // 0x0D40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         AimScaleTickAmount;                                // 0x0D60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HitWorldGC;                                        // 0x0D64(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HighTower_Tomato_RepulsorCannon(int32 EntryPoint);
	void CustomEvent_0();
	void CastMontageCancelledOrInterrupted();
	void CastMontageBlendOut();
	void Trace();
	void SetHover(bool On);
	void HandleAimScale();
	void OnAbilityActivated();
	void CastMontageNotifyEndAbility();
	void TargetTick();
	void K2_OnEndAbility(bool bWasCancelled);
	void Reset();
	void CastMontageNotifyStart(const struct FGameplayTag& NotifyTag);
	void Targeted_BC710BC0457E9C272340D29C282F4A22(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_BC710BC0457E9C272340D29C282F4A22(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Targeted_6CCC317040D245E97B19C2AD0E09D396(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_6CCC317040D245E97B19C2AD0E09D396(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	struct FGameplayCueParameters TargetingGCParams();
	void Update_Rotation_Input_Scale(bool LimitRotation, float InInputPitchScale, float InInputYawScale);
	void LaunchPlayer(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_HighTower_Tomato_RepulsorCannon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_HighTower_Tomato_RepulsorCannon_C")
	}
	static class UGA_HighTower_Tomato_RepulsorCannon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HighTower_Tomato_RepulsorCannon_C>();
	}
};
DUMPER7_ASSERTS_UGA_HighTower_Tomato_RepulsorCannon_C;

SDK_NAMESPACE_END
