#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop.GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C.ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop
// 0x00F8 (0x00F8 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_5;                    // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_4;                    // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate;      // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_3;                    // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_1;    // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_2;                    // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_2;    // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_1;                    // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_3;    // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag;                      // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_4;    // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_CustomEvent_Character;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_PrevMovementMode;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_PreviousCustomMode;             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_5;    // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode)> K2Node_CreateDelegate_OutputDelegate_6; // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_ExecuteUbergraph_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop;

// Function GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop.GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_K2_OnEndAbility;

// Function GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop.GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C.OnMovementModeChanged
// 0x0010 (0x0010 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnMovementModeChanged final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 PrevMovementMode;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PreviousCustomMode;                                // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnMovementModeChanged;

// Function GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop.GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C.OnCompleted_93C0045E453E3CB76DE8D1A7203DD472
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnCompleted_93C0045E453E3CB76DE8D1A7203DD472 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnCompleted_93C0045E453E3CB76DE8D1A7203DD472;

// Function GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop.GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C.OnBlendOut_93C0045E453E3CB76DE8D1A7203DD472
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnBlendOut_93C0045E453E3CB76DE8D1A7203DD472 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnBlendOut_93C0045E453E3CB76DE8D1A7203DD472;

// Function GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop.GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C.OnInterrupted_93C0045E453E3CB76DE8D1A7203DD472
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnInterrupted_93C0045E453E3CB76DE8D1A7203DD472 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnInterrupted_93C0045E453E3CB76DE8D1A7203DD472;

// Function GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop.GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C.OnCancelled_93C0045E453E3CB76DE8D1A7203DD472
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnCancelled_93C0045E453E3CB76DE8D1A7203DD472 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnCancelled_93C0045E453E3CB76DE8D1A7203DD472;

// Function GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop.GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C.OnNotifyBegin_93C0045E453E3CB76DE8D1A7203DD472
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnNotifyBegin_93C0045E453E3CB76DE8D1A7203DD472 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnNotifyBegin_93C0045E453E3CB76DE8D1A7203DD472;

// Function GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop.GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C.OnNotifyEnd_93C0045E453E3CB76DE8D1A7203DD472
// 0x0008 (0x0008 - 0x0000)
struct GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnNotifyEnd_93C0045E453E3CB76DE8D1A7203DD472 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_HighTower_HoneyDew_JumpSmash_JumpAnimLoop_C_OnNotifyEnd_93C0045E453E3CB76DE8D1A7203DD472;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
