#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LowTower_HeldObject_Chaplin_Exposion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GA_LowTower_HeldObject_Chaplin_Exposion.GA_LowTower_HeldObject_Chaplin_Exposion_C.ExecuteUbergraph_GA_LowTower_HeldObject_Chaplin_Exposion
// 0x0198 (0x0198 - 0x0000)
struct GA_LowTower_HeldObject_Chaplin_Exposion_C_ExecuteUbergraph_GA_LowTower_HeldObject_Chaplin_Exposion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate; // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0048(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0090(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x00B8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x00D8(0x00B0)(ConstParm)
	class ABuildingGameplayActor*                 K2Node_DynamicCast_AsBuilding_Gameplay_Actor;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GA_LowTower_HeldObject_Chaplin_Exposion_C_ExecuteUbergraph_GA_LowTower_HeldObject_Chaplin_Exposion;

// Function GA_LowTower_HeldObject_Chaplin_Exposion.GA_LowTower_HeldObject_Chaplin_Exposion_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_LowTower_HeldObject_Chaplin_Exposion_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_LowTower_HeldObject_Chaplin_Exposion_C_K2_ActivateAbilityFromEvent;

// Function GA_LowTower_HeldObject_Chaplin_Exposion.GA_LowTower_HeldObject_Chaplin_Exposion_C.Targeted_E0DFECF744FA4E0991DB29AA05C14BEC
// 0x0030 (0x0030 - 0x0000)
struct GA_LowTower_HeldObject_Chaplin_Exposion_C_Targeted_E0DFECF744FA4E0991DB29AA05C14BEC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LowTower_HeldObject_Chaplin_Exposion_C_Targeted_E0DFECF744FA4E0991DB29AA05C14BEC;

// Function GA_LowTower_HeldObject_Chaplin_Exposion.GA_LowTower_HeldObject_Chaplin_Exposion_C.Cancelled_E0DFECF744FA4E0991DB29AA05C14BEC
// 0x0030 (0x0030 - 0x0000)
struct GA_LowTower_HeldObject_Chaplin_Exposion_C_Cancelled_E0DFECF744FA4E0991DB29AA05C14BEC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LowTower_HeldObject_Chaplin_Exposion_C_Cancelled_E0DFECF744FA4E0991DB29AA05C14BEC;

// Function GA_LowTower_HeldObject_Chaplin_Exposion.GA_LowTower_HeldObject_Chaplin_Exposion_C.GetCustomAbilitySourceTransform
// 0x0060 (0x0060 - 0x0000)
struct GA_LowTower_HeldObject_Chaplin_Exposion_C_GetCustomAbilitySourceTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GA_LowTower_HeldObject_Chaplin_Exposion_C_GetCustomAbilitySourceTransform;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
