#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Lotus_Mustache_LockOnTargeting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Lotus_Mustache_LockOnTargeting.GA_Lotus_Mustache_LockOnTargeting_C
// 0x01C0 (0x0C68 - 0x0AA8)
class UGA_Lotus_Mustache_LockOnTargeting_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LowGravRemoveDelay;                                // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Float;                                             // 0x0ABC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityResetThreshold;                            // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC4[0x4];                                      // 0x0AC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0AC8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                         PotentialTargets;                                  // 0x0AF0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         TargetPriorityFloat;                               // 0x0B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B04[0x4];                                      // 0x0B04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PotentialTarget;                                   // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0B10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainer           EffectContainer;                                   // 0x0B18(0x00B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DistanceInfluenceMultiple;                         // 0x0BD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD4[0x4];                                      // 0x0BD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         LockOnRange;                                       // 0x0BD8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         LockOnRectSize;                                    // 0x0BF8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Tick;                                              // 0x0C18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1C[0x4];                                      // 0x0C1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Attribute;                                         // 0x0C20(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AB_Ranged_Lotus_Mustache_C*             Weapon;                                            // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DotCheckValue;                                     // 0x0C60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Lotus_Mustache_LockOnTargeting(int32 EntryPoint);
	void LockOnTickNew(class AActor* Target_Pawn);
	void LookForHomingTarget();
	void LockOnTickOld();
	void K2_ActivateAbility();
	void Removed_58908BB54D428427AF9ABCB9028B681F();
	void Added_0D35071B4FEDC4CD0463C99574134FAB();
	void OnCompleted_9AB91A59481723B332308EBEA7FC15AD(class FName NotifyName);
	void OnBlendOut_9AB91A59481723B332308EBEA7FC15AD(class FName NotifyName);
	void OnInterrupted_9AB91A59481723B332308EBEA7FC15AD(class FName NotifyName);
	void OnNotifyBegin_9AB91A59481723B332308EBEA7FC15AD(class FName NotifyName);
	void OnNotifyEnd_9AB91A59481723B332308EBEA7FC15AD(class FName NotifyName);
	void OnChange_B230F5A34FBD93E78E242A8524699628();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Lotus_Mustache_LockOnTargeting_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Lotus_Mustache_LockOnTargeting_C")
	}
	static class UGA_Lotus_Mustache_LockOnTargeting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Lotus_Mustache_LockOnTargeting_C>();
	}
};
DUMPER7_ASSERTS_UGA_Lotus_Mustache_LockOnTargeting_C;

SDK_NAMESPACE_END
