#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Quest_Awakening_HightowerDate_VR

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GA_Quest_PassiveAbility_classes.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GA_Quest_Awakening_HightowerDate_VR.GA_Quest_Awakening_HightowerDate_VR_C
// 0x0048 (0x0B08 - 0x0AC0)
class UGA_Quest_Awakening_HightowerDate_VR_C final : public UGA_Quest_PassiveAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Quest_Awakening_HightowerDate_VR_C; // 0x0AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           T_Location;                                        // 0x0AC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Awakening_Handle;                                  // 0x0AD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Awakening;                                      // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           T_Hightower;                                       // 0x0AE0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Quest_Awakening;                                   // 0x0AE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Quest_Complete;                                 // 0x0AF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF1[0x7];                                      // 0x0AF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    NewVar_0;                                          // 0x0AF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_GA_Quest_Awakening_HightowerDate_VR(int32 EntryPoint);
	void K2_ActivateAbility();
	void Wait_End_Game_Phase(EAthenaGamePhase GamePhase);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Quest_Awakening_HightowerDate_VR_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Quest_Awakening_HightowerDate_VR_C")
	}
	static class UGA_Quest_Awakening_HightowerDate_VR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Quest_Awakening_HightowerDate_VR_C>();
	}
};
DUMPER7_ASSERTS_UGA_Quest_Awakening_HightowerDate_VR_C;

SDK_NAMESPACE_END
