#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStateMachine

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayStateMachine_structs.hpp"


SDK_NAMESPACE_START

// Class GameplayStateMachine.GameplayState
// 0x0010 (0x0038 - 0x0028)
class UGameplayState : public UObject
{
public:
	struct FGameplayTag                           StateId;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReplicates;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginState(const struct FGameplayTag& PrevStateId);
	void EndState(const struct FGameplayTag& NextStateId);
	void UpdateState(const float DeltaTime);

	struct FGameplayTag GetStateId() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayState")
	}
	static class UGameplayState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayState>();
	}
};
DUMPER7_ASSERTS_UGameplayState;

// Class GameplayStateMachine.GameplayStateMachine
// 0x0048 (0x0080 - 0x0038)
class UGameplayStateMachine final : public UGameplayState
{
public:
	struct FGameplayTag                           StateMachineId;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPubliclyBroadcast;                                // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPersistDelegatesOnUnregistration;                 // 0x0041(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayStateData               ActiveGameplayStateData;                           // 0x0048(0x0010)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayStateSettings>         GameplayStateSettings;                             // 0x0058(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           InitialGameplayStateId;                            // 0x0068(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameplayStateMachineManager*           StateMachineManager;                               // 0x0070(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameplayStateMachineSubsystem*         StateMachineSubSystem;                             // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void EvaluateStateTransition();
	void OnRep_ActiveGameplayStateData();
	void SetState(const struct FGameplayTag& InStateId);

	struct FGameplayTag GetActiveStateId() const;
	class UGameplayState* GetActiveStateObject() const;
	struct FGameplayTag GetStateMachineId() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayStateMachine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayStateMachine")
	}
	static class UGameplayStateMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayStateMachine>();
	}
};
DUMPER7_ASSERTS_UGameplayStateMachine;

// Class GameplayStateMachine.GameplayStateMachineManager
// 0x0120 (0x01D0 - 0x00B0)
class UGameplayStateMachineManager final : public UActorComponent
{
public:
	struct FGameplayStateMachineArray             StateMachineList;                                  // 0x00B0(0x0120)(Net, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayStateMachineManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayStateMachineManager")
	}
	static class UGameplayStateMachineManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayStateMachineManager>();
	}
};
DUMPER7_ASSERTS_UGameplayStateMachineManager;

// Class GameplayStateMachine.GameplayStateMachineSubsystem
// 0x0050 (0x0080 - 0x0030)
class UGameplayStateMachineSubsystem final : public UGameInstanceSubsystem
{
public:
	TMap<struct FGameplayTag, struct FGameplayStateMachineData> StateMachineMap;                     // 0x0030(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayStateMachineSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayStateMachineSubsystem")
	}
	static class UGameplayStateMachineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayStateMachineSubsystem>();
	}
};
DUMPER7_ASSERTS_UGameplayStateMachineSubsystem;

SDK_NAMESPACE_END
