#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayStateMachine

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// ScriptStruct GameplayStateMachine.ActiveGameplayStateData
// 0x0010 (0x0010 - 0x0000)
struct FActiveGameplayStateData final
{
public:
	class UGameplayState*                         GameplayState;                                     // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           PreviousStateId;                                   // 0x0008(0x0008)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FActiveGameplayStateData;

// ScriptStruct GameplayStateMachine.GameplayStateSettings
// 0x0010 (0x0010 - 0x0000)
struct FGameplayStateSettings final
{
public:
	TSubclassOf<class UGameplayState>             StateClass;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StateId;                                           // 0x0008(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGameplayStateSettings;

// ScriptStruct GameplayStateMachine.GameplayStateMachineItem
// 0x000C (0x0018 - 0x000C)
struct FGameplayStateMachineItem final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayStateMachine*                  StateMachine;                                      // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FGameplayStateMachineItem;

// ScriptStruct GameplayStateMachine.GameplayStateMachineArray
// 0x0018 (0x0120 - 0x0108)
struct FGameplayStateMachineArray final : public FFastArraySerializer
{
public:
	class UGameplayStateMachineManager*           StateMachineManager;                               // 0x0108(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayStateMachineItem>      StateMachineItems;                                 // 0x0110(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FGameplayStateMachineArray;

// ScriptStruct GameplayStateMachine.GameplayStateMachineData
// 0x00B8 (0x00B8 - 0x0000)
struct FGameplayStateMachineData final
{
public:
	class UGameplayStateMachine*                  StateMachine;                                      // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0xB0];                                       // 0x0008(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGameplayStateMachineData;

SDK_NAMESPACE_END
