#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GamepadMappingInfo_v3

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.ExecuteUbergraph_GamepadMappingInfo_v3
// 0x01A0 (0x01A0 - 0x0000)
struct GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetControllerImage_Texture;               // 0x0020(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button_2;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UGamepadKeyTextButton_C*                K2Node_DynamicCast_AsGamepad_Key_Text_Button;      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGamepadKeyTextButton_C*>        K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue_2;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTabIdAtIndex_ReturnValue_3;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTabCount_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGamepadKeyTextButton_C*                CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText;       // 0x00D8(0x0018)()
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName_1;   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText_1;     // 0x00F8(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button_1;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate_2;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate_3;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSettingsContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCustomButtonDataForKey_ActionName_2;   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCustomButtonDataForKey_DescText_2;     // 0x0178(0x0018)()
	class UGamepadKeyTextButton_C*                CallFunc_Array_Get_Item_1;                         // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadMappingInfo_v3_C_ExecuteUbergraph_GamepadMappingInfo_v3;

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.DeadzoneLookResetButtonClicked_Bind
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadMappingInfo_v3_C_DeadzoneLookResetButtonClicked_Bind;

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.DeadzoneMoveResetButtonClicked_Bind
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadMappingInfo_v3_C_DeadzoneMoveResetButtonClicked_Bind;

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.OnButtonClicked_Bind
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_OnButtonClicked_Bind final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadMappingInfo_v3_C_OnButtonClicked_Bind;

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.OnLoaded_CDBC1B27496027B96D10BC9A64224F3D
// 0x0008 (0x0008 - 0x0000)
struct GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadMappingInfo_v3_C_OnLoaded_CDBC1B27496027B96D10BC9A64224F3D;

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.Update Displayed Mapping
// 0x0040 (0x0040 - 0x0000)
struct GamepadMappingInfo_v3_C_Update_Displayed_Mapping final
{
public:
	int32                                         Platform;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputActionGroup                         Mode;                                              // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Configuration;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_Select_Default_2;                           // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GamepadMappingInfo_v3_C_Update_Displayed_Mapping;

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.OnConfigChanged
// 0x0028 (0x0028 - 0x0000)
struct GamepadMappingInfo_v3_C_OnConfigChanged final
{
public:
	EFortInputActionGroup                         Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCustomGamepadConfig_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GamepadMappingInfo_v3_C_OnConfigChanged;

// Function GamepadMappingInfo_v3.GamepadMappingInfo_v3_C.HandleConfigChanged_Athena
// 0x1DC0 (0x1DC0 - 0x0000)
struct GamepadMappingInfo_v3_C_HandleConfigChanged_Athena final
{
public:
	EFortInputActionGroup                         Mode;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00C0(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0140(0x0018)()
	int32                                         Temp_int_Variable_2;                               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0160(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0178(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0190(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x01A8(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x01C0(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x01D8(0x0018)()
	int32                                         Temp_int_Variable_3;                               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x01F8(0x0018)()
	class FText                                   Temp_text_Variable_17;                             // 0x0210(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x0228(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x0240(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x0258(0x0018)()
	class FText                                   Temp_text_Variable_21;                             // 0x0270(0x0018)()
	int32                                         Temp_int_Variable_4;                               // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0290(0x0018)()
	class FText                                   Temp_text_Variable_22;                             // 0x02A8(0x0018)()
	class FText                                   Temp_text_Variable_23;                             // 0x02C0(0x0018)()
	class FText                                   Temp_text_Variable_24;                             // 0x02D8(0x0018)()
	class FText                                   Temp_text_Variable_25;                             // 0x02F0(0x0018)()
	int32                                         Temp_int_Variable_5;                               // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x0310(0x0018)()
	class FText                                   Temp_text_Variable_26;                             // 0x0328(0x0018)()
	class FText                                   Temp_text_Variable_27;                             // 0x0340(0x0018)()
	class FText                                   Temp_text_Variable_28;                             // 0x0358(0x0018)()
	class FText                                   Temp_text_Variable_29;                             // 0x0370(0x0018)()
	class FText                                   Temp_text_Variable_30;                             // 0x0388(0x0018)()
	int32                                         Temp_int_Variable_6;                               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_5;                           // 0x03A8(0x0018)()
	class FText                                   Temp_text_Variable_31;                             // 0x03C0(0x0018)()
	class FText                                   Temp_text_Variable_32;                             // 0x03D8(0x0018)()
	class FText                                   Temp_text_Variable_33;                             // 0x03F0(0x0018)()
	class FText                                   Temp_text_Variable_34;                             // 0x0408(0x0018)()
	class FText                                   Temp_text_Variable_35;                             // 0x0420(0x0018)()
	int32                                         Temp_int_Variable_7;                               // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_6;                           // 0x0440(0x0018)()
	class FText                                   Temp_text_Variable_36;                             // 0x0458(0x0018)()
	class FText                                   Temp_text_Variable_37;                             // 0x0470(0x0018)()
	class FText                                   Temp_text_Variable_38;                             // 0x0488(0x0018)()
	class FText                                   Temp_text_Variable_39;                             // 0x04A0(0x0018)()
	class FText                                   Temp_text_Variable_40;                             // 0x04B8(0x0018)()
	int32                                         Temp_int_Variable_8;                               // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_7;                           // 0x04D8(0x0018)()
	class FText                                   Temp_text_Variable_41;                             // 0x04F0(0x0018)()
	class FText                                   Temp_text_Variable_42;                             // 0x0508(0x0018)()
	class FText                                   Temp_text_Variable_43;                             // 0x0520(0x0018)()
	class FText                                   Temp_text_Variable_44;                             // 0x0538(0x0018)()
	class FText                                   Temp_text_Variable_45;                             // 0x0550(0x0018)()
	int32                                         Temp_int_Variable_9;                               // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_8;                           // 0x0570(0x0018)()
	class FText                                   Temp_text_Variable_46;                             // 0x0588(0x0018)()
	class FText                                   Temp_text_Variable_47;                             // 0x05A0(0x0018)()
	class FText                                   Temp_text_Variable_48;                             // 0x05B8(0x0018)()
	class FText                                   Temp_text_Variable_49;                             // 0x05D0(0x0018)()
	class FText                                   Temp_text_Variable_50;                             // 0x05E8(0x0018)()
	int32                                         Temp_int_Variable_10;                              // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_604[0x4];                                      // 0x0604(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_9;                           // 0x0608(0x0018)()
	class FText                                   Temp_text_Variable_51;                             // 0x0620(0x0018)()
	class FText                                   Temp_text_Variable_52;                             // 0x0638(0x0018)()
	class FText                                   Temp_text_Variable_53;                             // 0x0650(0x0018)()
	class FText                                   Temp_text_Variable_54;                             // 0x0668(0x0018)()
	class FText                                   Temp_text_Variable_55;                             // 0x0680(0x0018)()
	int32                                         Temp_int_Variable_11;                              // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_10;                          // 0x06A0(0x0018)()
	class FText                                   Temp_text_Variable_56;                             // 0x06B8(0x0018)()
	class FText                                   Temp_text_Variable_57;                             // 0x06D0(0x0018)()
	class FText                                   Temp_text_Variable_58;                             // 0x06E8(0x0018)()
	class FText                                   Temp_text_Variable_59;                             // 0x0700(0x0018)()
	class FText                                   Temp_text_Variable_60;                             // 0x0718(0x0018)()
	int32                                         Temp_int_Variable_12;                              // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_734[0x4];                                      // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_11;                          // 0x0738(0x0018)()
	class FText                                   Temp_text_Variable_61;                             // 0x0750(0x0018)()
	class FText                                   Temp_text_Variable_62;                             // 0x0768(0x0018)()
	class FText                                   Temp_text_Variable_63;                             // 0x0780(0x0018)()
	class FText                                   Temp_text_Variable_64;                             // 0x0798(0x0018)()
	class FText                                   Temp_text_Variable_65;                             // 0x07B0(0x0018)()
	int32                                         Temp_int_Variable_13;                              // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CC[0x4];                                      // 0x07CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_12;                          // 0x07D0(0x0018)()
	class FText                                   Temp_text_Variable_66;                             // 0x07E8(0x0018)()
	class FText                                   Temp_text_Variable_67;                             // 0x0800(0x0018)()
	class FText                                   Temp_text_Variable_68;                             // 0x0818(0x0018)()
	class FText                                   Temp_text_Variable_69;                             // 0x0830(0x0018)()
	class FText                                   Temp_text_Variable_70;                             // 0x0848(0x0018)()
	int32                                         Temp_int_Variable_14;                              // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_864[0x4];                                      // 0x0864(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_13;                          // 0x0868(0x0018)()
	class FText                                   Temp_text_Variable_71;                             // 0x0880(0x0018)()
	class FText                                   Temp_text_Variable_72;                             // 0x0898(0x0018)()
	class FText                                   Temp_text_Variable_73;                             // 0x08B0(0x0018)()
	class FText                                   Temp_text_Variable_74;                             // 0x08C8(0x0018)()
	class FText                                   Temp_text_Variable_75;                             // 0x08E0(0x0018)()
	int32                                         Temp_int_Variable_15;                              // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_14;                          // 0x0900(0x0018)()
	class FText                                   Temp_text_Variable_76;                             // 0x0918(0x0018)()
	class FText                                   Temp_text_Variable_77;                             // 0x0930(0x0018)()
	class FText                                   Temp_text_Variable_78;                             // 0x0948(0x0018)()
	class FText                                   Temp_text_Variable_79;                             // 0x0960(0x0018)()
	class FText                                   Temp_text_Variable_80;                             // 0x0978(0x0018)()
	int32                                         Temp_int_Variable_16;                              // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_994[0x4];                                      // 0x0994(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_15;                          // 0x0998(0x0018)()
	class FText                                   Temp_text_Variable_81;                             // 0x09B0(0x0018)()
	class FText                                   Temp_text_Variable_82;                             // 0x09C8(0x0018)()
	class FText                                   Temp_text_Variable_83;                             // 0x09E0(0x0018)()
	class FText                                   Temp_text_Variable_84;                             // 0x09F8(0x0018)()
	class FText                                   Temp_text_Variable_85;                             // 0x0A10(0x0018)()
	int32                                         Temp_int_Variable_17;                              // 0x0A28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2C[0x4];                                      // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_16;                          // 0x0A30(0x0018)()
	class FText                                   Temp_text_Variable_86;                             // 0x0A48(0x0018)()
	class FText                                   Temp_text_Variable_87;                             // 0x0A60(0x0018)()
	class FText                                   Temp_text_Variable_88;                             // 0x0A78(0x0018)()
	class FText                                   Temp_text_Variable_89;                             // 0x0A90(0x0018)()
	class FText                                   Temp_text_Variable_90;                             // 0x0AA8(0x0018)()
	int32                                         Temp_int_Variable_18;                              // 0x0AC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC4[0x4];                                      // 0x0AC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_17;                          // 0x0AC8(0x0018)()
	class FText                                   Temp_text_Variable_91;                             // 0x0AE0(0x0018)()
	class FText                                   Temp_text_Variable_92;                             // 0x0AF8(0x0018)()
	class FText                                   Temp_text_Variable_93;                             // 0x0B10(0x0018)()
	class FText                                   Temp_text_Variable_94;                             // 0x0B28(0x0018)()
	class FText                                   Temp_text_Variable_95;                             // 0x0B40(0x0018)()
	int32                                         Temp_int_Variable_19;                              // 0x0B58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B5C[0x4];                                      // 0x0B5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_18;                          // 0x0B60(0x0018)()
	class FText                                   Temp_text_Variable_96;                             // 0x0B78(0x0018)()
	class FText                                   Temp_text_Variable_97;                             // 0x0B90(0x0018)()
	class FText                                   Temp_text_Variable_98;                             // 0x0BA8(0x0018)()
	class FText                                   Temp_text_Variable_99;                             // 0x0BC0(0x0018)()
	class FText                                   Temp_text_Variable_100;                            // 0x0BD8(0x0018)()
	int32                                         Temp_int_Variable_20;                              // 0x0BF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF4[0x4];                                      // 0x0BF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_19;                          // 0x0BF8(0x0018)()
	class FText                                   Temp_text_Variable_101;                            // 0x0C10(0x0018)()
	class FText                                   Temp_text_Variable_102;                            // 0x0C28(0x0018)()
	class FText                                   Temp_text_Variable_103;                            // 0x0C40(0x0018)()
	class FText                                   Temp_text_Variable_104;                            // 0x0C58(0x0018)()
	class FText                                   Temp_text_Variable_105;                            // 0x0C70(0x0018)()
	int32                                         Temp_int_Variable_21;                              // 0x0C88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8C[0x4];                                      // 0x0C8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_20;                          // 0x0C90(0x0018)()
	class FText                                   Temp_text_Variable_106;                            // 0x0CA8(0x0018)()
	class FText                                   Temp_text_Variable_107;                            // 0x0CC0(0x0018)()
	class FText                                   Temp_text_Variable_108;                            // 0x0CD8(0x0018)()
	class FText                                   Temp_text_Variable_109;                            // 0x0CF0(0x0018)()
	class FText                                   Temp_text_Variable_110;                            // 0x0D08(0x0018)()
	int32                                         Temp_int_Variable_22;                              // 0x0D20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D24[0x4];                                      // 0x0D24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_21;                          // 0x0D28(0x0018)()
	class FText                                   Temp_text_Variable_111;                            // 0x0D40(0x0018)()
	class FText                                   Temp_text_Variable_112;                            // 0x0D58(0x0018)()
	class FText                                   Temp_text_Variable_113;                            // 0x0D70(0x0018)()
	class FText                                   Temp_text_Variable_114;                            // 0x0D88(0x0018)()
	class FText                                   Temp_text_Variable_115;                            // 0x0DA0(0x0018)()
	int32                                         Temp_int_Variable_23;                              // 0x0DB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DBC[0x4];                                      // 0x0DBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_22;                          // 0x0DC0(0x0018)()
	class FText                                   Temp_text_Variable_116;                            // 0x0DD8(0x0018)()
	class FText                                   Temp_text_Variable_117;                            // 0x0DF0(0x0018)()
	class FText                                   Temp_text_Variable_118;                            // 0x0E08(0x0018)()
	class FText                                   Temp_text_Variable_119;                            // 0x0E20(0x0018)()
	class FText                                   Temp_text_Variable_120;                            // 0x0E38(0x0018)()
	int32                                         Temp_int_Variable_24;                              // 0x0E50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E54[0x4];                                      // 0x0E54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_23;                          // 0x0E58(0x0018)()
	class FText                                   Temp_text_Variable_121;                            // 0x0E70(0x0018)()
	class FText                                   Temp_text_Variable_122;                            // 0x0E88(0x0018)()
	class FText                                   Temp_text_Variable_123;                            // 0x0EA0(0x0018)()
	class FText                                   Temp_text_Variable_124;                            // 0x0EB8(0x0018)()
	class FText                                   Temp_text_Variable_125;                            // 0x0ED0(0x0018)()
	int32                                         Temp_int_Variable_25;                              // 0x0EE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EEC[0x4];                                      // 0x0EEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_24;                          // 0x0EF0(0x0018)()
	class FText                                   Temp_text_Variable_126;                            // 0x0F08(0x0018)()
	class FText                                   Temp_text_Variable_127;                            // 0x0F20(0x0018)()
	class FText                                   Temp_text_Variable_128;                            // 0x0F38(0x0018)()
	class FText                                   Temp_text_Variable_129;                            // 0x0F50(0x0018)()
	class FText                                   Temp_text_Variable_130;                            // 0x0F68(0x0018)()
	int32                                         Temp_int_Variable_26;                              // 0x0F80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F84[0x4];                                      // 0x0F84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_25;                          // 0x0F88(0x0018)()
	class FText                                   Temp_text_Variable_131;                            // 0x0FA0(0x0018)()
	class FText                                   Temp_text_Variable_132;                            // 0x0FB8(0x0018)()
	class FText                                   Temp_text_Variable_133;                            // 0x0FD0(0x0018)()
	class FText                                   Temp_text_Variable_134;                            // 0x0FE8(0x0018)()
	class FText                                   Temp_text_Variable_135;                            // 0x1000(0x0018)()
	int32                                         Temp_int_Variable_27;                              // 0x1018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101C[0x4];                                     // 0x101C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_26;                          // 0x1020(0x0018)()
	class FText                                   Temp_text_Variable_136;                            // 0x1038(0x0018)()
	class FText                                   Temp_text_Variable_137;                            // 0x1050(0x0018)()
	class FText                                   Temp_text_Variable_138;                            // 0x1068(0x0018)()
	class FText                                   Temp_text_Variable_139;                            // 0x1080(0x0018)()
	class FText                                   Temp_text_Variable_140;                            // 0x1098(0x0018)()
	int32                                         Temp_int_Variable_28;                              // 0x10B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10B4[0x4];                                     // 0x10B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_27;                          // 0x10B8(0x0018)()
	class FText                                   Temp_text_Variable_141;                            // 0x10D0(0x0018)()
	class FText                                   Temp_text_Variable_142;                            // 0x10E8(0x0018)()
	class FText                                   Temp_text_Variable_143;                            // 0x1100(0x0018)()
	class FText                                   Temp_text_Variable_144;                            // 0x1118(0x0018)()
	class FText                                   Temp_text_Variable_145;                            // 0x1130(0x0018)()
	int32                                         Temp_int_Variable_29;                              // 0x1148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114C[0x4];                                     // 0x114C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_28;                          // 0x1150(0x0018)()
	class FText                                   Temp_text_Variable_146;                            // 0x1168(0x0018)()
	class FText                                   Temp_text_Variable_147;                            // 0x1180(0x0018)()
	class FText                                   Temp_text_Variable_148;                            // 0x1198(0x0018)()
	class FText                                   Temp_text_Variable_149;                            // 0x11B0(0x0018)()
	class FText                                   Temp_text_Variable_150;                            // 0x11C8(0x0018)()
	int32                                         Temp_int_Variable_30;                              // 0x11E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11E4[0x4];                                     // 0x11E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_29;                          // 0x11E8(0x0018)()
	class FText                                   Temp_text_Variable_151;                            // 0x1200(0x0018)()
	class FText                                   Temp_text_Variable_152;                            // 0x1218(0x0018)()
	class FText                                   Temp_text_Variable_153;                            // 0x1230(0x0018)()
	class FText                                   Temp_text_Variable_154;                            // 0x1248(0x0018)()
	class FText                                   Temp_text_Variable_155;                            // 0x1260(0x0018)()
	int32                                         Temp_int_Variable_31;                              // 0x1278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_127C[0x4];                                     // 0x127C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_30;                          // 0x1280(0x0018)()
	class FText                                   Temp_text_Variable_156;                            // 0x1298(0x0018)()
	class FText                                   Temp_text_Variable_157;                            // 0x12B0(0x0018)()
	class FText                                   Temp_text_Variable_158;                            // 0x12C8(0x0018)()
	class FText                                   Temp_text_Variable_159;                            // 0x12E0(0x0018)()
	class FText                                   Temp_text_Variable_160;                            // 0x12F8(0x0018)()
	int32                                         Temp_int_Variable_32;                              // 0x1310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1314[0x4];                                     // 0x1314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_31;                          // 0x1318(0x0018)()
	class FText                                   Temp_text_Variable_161;                            // 0x1330(0x0018)()
	class FText                                   Temp_text_Variable_162;                            // 0x1348(0x0018)()
	class FText                                   Temp_text_Variable_163;                            // 0x1360(0x0018)()
	class FText                                   Temp_text_Variable_164;                            // 0x1378(0x0018)()
	class FText                                   Temp_text_Variable_165;                            // 0x1390(0x0018)()
	int32                                         Temp_int_Variable_33;                              // 0x13A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13AC[0x4];                                     // 0x13AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_32;                          // 0x13B0(0x0018)()
	class FText                                   Temp_text_Variable_166;                            // 0x13C8(0x0018)()
	class FText                                   Temp_text_Variable_167;                            // 0x13E0(0x0018)()
	class FText                                   Temp_text_Variable_168;                            // 0x13F8(0x0018)()
	class FText                                   Temp_text_Variable_169;                            // 0x1410(0x0018)()
	class FText                                   Temp_text_Variable_170;                            // 0x1428(0x0018)()
	int32                                         Temp_int_Variable_34;                              // 0x1440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1444[0x4];                                     // 0x1444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_33;                          // 0x1448(0x0018)()
	class FText                                   Temp_text_Variable_171;                            // 0x1460(0x0018)()
	class FText                                   Temp_text_Variable_172;                            // 0x1478(0x0018)()
	class FText                                   Temp_text_Variable_173;                            // 0x1490(0x0018)()
	class FText                                   Temp_text_Variable_174;                            // 0x14A8(0x0018)()
	class FText                                   Temp_text_Variable_175;                            // 0x14C0(0x0018)()
	int32                                         Temp_int_Variable_35;                              // 0x14D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14DC[0x4];                                     // 0x14DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_34;                          // 0x14E0(0x0018)()
	class FText                                   Temp_text_Variable_176;                            // 0x14F8(0x0018)()
	class FText                                   Temp_text_Variable_177;                            // 0x1510(0x0018)()
	class FText                                   Temp_text_Variable_178;                            // 0x1528(0x0018)()
	class FText                                   Temp_text_Variable_179;                            // 0x1540(0x0018)()
	class FText                                   Temp_text_Variable_180;                            // 0x1558(0x0018)()
	int32                                         Temp_int_Variable_36;                              // 0x1570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1574[0x4];                                     // 0x1574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_35;                          // 0x1578(0x0018)()
	class FText                                   Temp_text_Variable_181;                            // 0x1590(0x0018)()
	class FText                                   Temp_text_Variable_182;                            // 0x15A8(0x0018)()
	class FText                                   Temp_text_Variable_183;                            // 0x15C0(0x0018)()
	class FText                                   Temp_text_Variable_184;                            // 0x15D8(0x0018)()
	class FText                                   Temp_text_Variable_185;                            // 0x15F0(0x0018)()
	int32                                         Temp_int_Variable_37;                              // 0x1608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_160C[0x4];                                     // 0x160C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_36;                          // 0x1610(0x0018)()
	class FText                                   Temp_text_Variable_186;                            // 0x1628(0x0018)()
	class FText                                   Temp_text_Variable_187;                            // 0x1640(0x0018)()
	class FText                                   Temp_text_Variable_188;                            // 0x1658(0x0018)()
	class FText                                   Temp_text_Variable_189;                            // 0x1670(0x0018)()
	class FText                                   Temp_text_Variable_190;                            // 0x1688(0x0018)()
	int32                                         Temp_int_Variable_38;                              // 0x16A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A4[0x4];                                     // 0x16A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_37;                          // 0x16A8(0x0018)()
