#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_GenericTriggeredAbility

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GAT_TriggeredAbility_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GAT_GenericTriggeredAbility.GAT_GenericTriggeredAbility_C
// 0x00C8 (0x0B88 - 0x0AC0)
class UGAT_GenericTriggeredAbility_C : public UGAT_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_GenericTriggeredAbility_C;      // 0x0AC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayEventData                     EventData;                                         // 0x0AC8(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isAutoCommitted;                                   // 0x0B80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isStaminaLockedOut;                                // 0x0B81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAT_GenericTriggeredAbility(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GAT_GenericTriggeredAbility_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GAT_GenericTriggeredAbility_C")
	}
	static class UGAT_GenericTriggeredAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_GenericTriggeredAbility_C>();
	}
};
DUMPER7_ASSERTS_UGAT_GenericTriggeredAbility_C;

SDK_NAMESPACE_END
