#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericPetLayer_AnimBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass GenericPetLayer_AnimBP.GenericPetLayer_AnimBP_C
// 0x0A20 (0x0CE0 - 0x02C0)
class UGenericPetLayer_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x02D0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0300(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0388(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03B8(0x0088)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0440(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x0460(0x01B0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0610(0x0108)()
	uint8                                         Pad_718[0x8];                                      // 0x0718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x0720(0x01B0)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x08D0(0x01B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0A80(0x0020)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_1;                             // 0x0AA0(0x00F8)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x0B98(0x00F8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0C90(0x0030)()
	float                                         HandIKAlphaOverride;                               // 0x0CC0(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LegIKAlphaOverride;                                // 0x0CC4(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAtTargetLocationInput;                         // 0x0CC8(0x000C)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookAtOverrideInput;                               // 0x0CD4(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PetFullOverrideLayer(const struct FPoseLink& InPose, struct FPoseLink* PetFullOverrideLayer_0);
	void PetSkeletalControlLayer(const struct FPoseLink& Pose, float LookAtOverrideInput_0, const struct FVector& LookAtTargetLocationInput_0, float LegIKAlphaOverride_0, float HandIKAlphaOverride_0, struct FPoseLink* PetSkeletalControlLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_GenericPetLayer_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GenericPetLayer_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GenericPetLayer_AnimBP_C")
	}
	static class UGenericPetLayer_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericPetLayer_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_UGenericPetLayer_AnimBP_C;

SDK_NAMESPACE_END
