#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GenericPetLayer_Radish_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function GenericPetLayer_Radish_AnimBP.GenericPetLayer_Radish_AnimBP_C.PetFullOverrideLayer
// 0x0020 (0x0020 - 0x0000)
struct GenericPetLayer_Radish_AnimBP_C_PetFullOverrideLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PetFullOverrideLayer_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_GenericPetLayer_Radish_AnimBP_C_PetFullOverrideLayer;

// Function GenericPetLayer_Radish_AnimBP.GenericPetLayer_Radish_AnimBP_C.PetSkeletalControlLayer
// 0x0038 (0x0038 - 0x0000)
struct GenericPetLayer_Radish_AnimBP_C_PetSkeletalControlLayer final
{
public:
	struct FPoseLink                              Pose;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         LookAtOverrideInput_0;                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LookAtTargetLocationInput_0;                       // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LegIKAlphaOverride_0;                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HandIKAlphaOverride_0;                             // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPoseLink                              PetSkeletalControlLayer_0;                         // 0x0028(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_GenericPetLayer_Radish_AnimBP_C_PetSkeletalControlLayer;

// Function GenericPetLayer_Radish_AnimBP.GenericPetLayer_Radish_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct GenericPetLayer_Radish_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_GenericPetLayer_Radish_AnimBP_C_AnimGraph;

// Function GenericPetLayer_Radish_AnimBP.GenericPetLayer_Radish_AnimBP_C.ExecuteUbergraph_GenericPetLayer_Radish_AnimBP
// 0x0004 (0x0004 - 0x0000)
struct GenericPetLayer_Radish_AnimBP_C_ExecuteUbergraph_GenericPetLayer_Radish_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GenericPetLayer_Radish_AnimBP_C_ExecuteUbergraph_GenericPetLayer_Radish_AnimBP;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
