#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsCore

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "HairStrandsCore_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class HairStrandsCore.GroomHairGroupsPreview
// 0x0010 (0x0038 - 0x0028)
class UGroomHairGroupsPreview final : public UObject
{
public:
	TArray<struct FGroomHairGroupPreview>         Groups;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomHairGroupsPreview")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomHairGroupsPreview")
	}
	static class UGroomHairGroupsPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomHairGroupsPreview>();
	}
};
DUMPER7_ASSERTS_UGroomHairGroupsPreview;

// Class HairStrandsCore.GroomActor
// 0x0008 (0x0228 - 0x0220)
class AGroomActor final : public AActor
{
public:
	class UGroomComponent*                        GroomComponent;                                    // 0x0220(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomActor")
	}
	static class AGroomActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGroomActor>();
	}
};
DUMPER7_ASSERTS_AGroomActor;

// Class HairStrandsCore.GroomAsset
// 0x0060 (0x0088 - 0x0028)
class UGroomAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairGroupInfo>                 HairGroupsInfo;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsPhysics>             HairGroupsPhysics;                                 // 0x0040(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableGlobalInterpolation;                         // 0x0050(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomInterpolationType                       HairInterpolationType;                             // 0x0051(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x16];                                      // 0x0052(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HairToGuideDensity;                                // 0x0068(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x0070(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomAsset")
	}
	static class UGroomAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAsset>();
	}
};
DUMPER7_ASSERTS_UGroomAsset;

// Class HairStrandsCore.GroomBindingAsset
// 0x0078 (0x00A0 - 0x0028)
class alignas(0x10) UGroomBindingAsset final : public UObject
{
public:
	class UGroomAsset*                            Groom;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInterpolationPoints;                            // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGoomBindingGroupInfo>          GroupInfos;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x48];                                      // 0x0058(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomBindingAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomBindingAsset")
	}
	static class UGroomBindingAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomBindingAsset>();
	}
};
DUMPER7_ASSERTS_UGroomBindingAsset;

// Class HairStrandsCore.GroomAssetImportData
// 0x0008 (0x0030 - 0x0028)
class UGroomAssetImportData final : public UAssetImportData
{
public:
	class UGroomImportOptions*                    ImportOptions;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomAssetImportData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomAssetImportData")
	}
	static class UGroomAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAssetImportData>();
	}
};
DUMPER7_ASSERTS_UGroomAssetImportData;

// Class HairStrandsCore.GroomComponent
// 0x00F0 (0x0560 - 0x0470)
class UGroomComponent final : public UMeshComponent
{
public:
	class UGroomAsset*                            GroomAsset;                                        // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNiagaraComponent*>              NiagaraComponents;                                 // 0x0470(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBindGroomToSkeletalMesh;                          // 0x0480(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0488(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGroomBindingAsset*                     BindingAsset;                                      // 0x0490(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x0498(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HairDebugMaterial;                                 // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HairDefaultMaterial;                               // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         AngularSpringsSystem;                              // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         CosseratRodsSystem;                                // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C0[0x50];                                     // 0x04C0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairGroupDesc>                 GroomGroupsDesc;                                   // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_520[0x40];                                     // 0x0520(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomComponent")
	}
	static class UGroomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomComponent>();
	}
};
DUMPER7_ASSERTS_UGroomComponent;

// Class HairStrandsCore.GroomCreateBindingOptions
// 0x0018 (0x0040 - 0x0028)
class UGroomCreateBindingOptions final : public UObject
{
public:
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInterpolationPoints;                            // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomCreateBindingOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomCreateBindingOptions")
	}
	static class UGroomCreateBindingOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateBindingOptions>();
	}
};
DUMPER7_ASSERTS_UGroomCreateBindingOptions;

// Class HairStrandsCore.GroomImportOptions
// 0x0028 (0x0050 - 0x0028)
class UGroomImportOptions final : public UObject
{
public:
	struct FGroomConversionSettings               ConversionSettings;                                // 0x0028(0x0018)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	struct FGroomBuildSettings                    BuildSettings;                                     // 0x0040(0x000C)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroomImportOptions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroomImportOptions")
	}
	static class UGroomImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomImportOptions>();
	}
};
DUMPER7_ASSERTS_UGroomImportOptions;

SDK_NAMESPACE_END
