#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HighTowerRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// Class HighTowerRuntime.FortAthenaMutator_HighTowerAbilityIntro
// 0x0010 (0x0390 - 0x0380)
class AFortAthenaMutator_HighTowerAbilityIntro final : public AFortAthenaMutator_GameModeBase
{
public:
	struct FGameplayTag                           ShowAbilityIntroTag;                               // 0x0380(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlayOnlyOnce;                                     // 0x0388(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeginSkydiveFromBus(class AFortPlayerControllerZone* PlayerController);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaMutator_HighTowerAbilityIntro")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaMutator_HighTowerAbilityIntro")
	}
	static class AFortAthenaMutator_HighTowerAbilityIntro* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_HighTowerAbilityIntro>();
	}
};
DUMPER7_ASSERTS_AFortAthenaMutator_HighTowerAbilityIntro;

// Class HighTowerRuntime.FortItemLayerAnimInstance_DateGaunlets
// 0x0010 (0x0300 - 0x02F0)
class UFortItemLayerAnimInstance_DateGaunlets : public UFortBaseLayerAnimInstance
{
public:
	bool                                          bIsBoostJumping;                                   // 0x02F0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F1[0xF];                                      // 0x02F1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortItemLayerAnimInstance_DateGaunlets")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortItemLayerAnimInstance_DateGaunlets")
	}
	static class UFortItemLayerAnimInstance_DateGaunlets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemLayerAnimInstance_DateGaunlets>();
	}
};
DUMPER7_ASSERTS_UFortItemLayerAnimInstance_DateGaunlets;

SDK_NAMESPACE_END
