#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HighTower_Tapas_LayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass HighTower_Tapas_LayerAnimBP.HighTower_Tapas_LayerAnimBP_C
// 0x1250 (0x1540 - 0x02F0)
class UHighTower_Tapas_LayerAnimBP_C final : public UFortItemAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x0300(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_18;                  // 0x0330(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x03B8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x03E8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0470(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x04A0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x0528(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0558(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0588(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x05B8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x05E8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0618(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x0648(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0678(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x06A8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x06D8(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0708(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x0738(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x0768(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x07F0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0820(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x08A8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x08D8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x0960(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x0990(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x0A18(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0A48(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x0AD0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x0B00(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x0B88(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x0BB8(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x0C40(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x0C70(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x0CF8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x0D28(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x0DB0(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x0DE0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x0E68(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x0E98(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x0F20(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x0F50(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0F80(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0FB0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0FE0(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x1010(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1040(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x10C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x10F8(0x0088)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1180(0x0088)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1208(0x0188)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1390(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x13C0(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1448(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1478(0x0088)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1500(0x0030)()
	float                                         Pitch;                                             // 0x1530(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x1534(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HighTower_Tapas_LayerAnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw_0, float Pitch_0, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("HighTower_Tapas_LayerAnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HighTower_Tapas_LayerAnimBP_C")
	}
	static class UHighTower_Tapas_LayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighTower_Tapas_LayerAnimBP_C>();
	}
};
DUMPER7_ASSERTS_UHighTower_Tapas_LayerAnimBP_C;

SDK_NAMESPACE_END
