#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoagieRuntime

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// Enum HoagieRuntime.EHoagieBoostState
// NumValues: 0x0006
enum class EHoagieBoostState : uint8
{
	Unknown                                  = 0,
	Ready                                    = 1,
	Started                                  = 2,
	Finished                                 = 3,
	Failed                                   = 4,
	EHoagieBoostState_MAX                    = 5,
};

// ScriptStruct HoagieRuntime.FortHeliFlightModel
// 0x0110 (0x0110 - 0x0000)
struct FFortHeliFlightModel final
{
public:
	uint8                                         Pad_0[0x108];                                      // 0x0000(0x0108)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHoagieVehicleConfigs*              Configs;                                           // 0x0108(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FFortHeliFlightModel;

// ScriptStruct HoagieRuntime.ReplicatedHeliControlState
// 0x0018 (0x0018 - 0x0000)
struct FReplicatedHeliControlState final
{
public:
	struct FVector_NetQuantizeNormal              Up;                                                // 0x0000(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal              Forward;                                           // 0x000C(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FReplicatedHeliControlState;

// ScriptStruct HoagieRuntime.CachedSeatCollision
// 0x0008 (0x0008 - 0x0000)
struct FCachedSeatCollision final
{
public:
	int32                                         SeatIndex;                                         // 0x0000(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOccupied;                                         // 0x0004(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCachedSeatCollision;

// ScriptStruct HoagieRuntime.RotorHit
// 0x000C (0x000C - 0x0000)
struct FRotorHit final
{
public:
	TWeakObjectPtr<class AActor>                  HitActor;                                          // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastHitTimer;                                      // 0x0008(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRotorHit;

SDK_NAMESPACE_END
