#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HydrogenUI

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function HydrogenUI.HydrogenWidgetBase.MutatorReady
// 0x0008 (0x0008 - 0x0000)
struct HydrogenWidgetBase_MutatorReady final
{
public:
	const class AFortAthenaMutator_Hydrogen*      MutatorActor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HydrogenWidgetBase_MutatorReady;

// Function HydrogenUI.HydrogenWidgetBase.OnMutatorAvailable
// 0x0008 (0x0008 - 0x0000)
struct HydrogenWidgetBase_OnMutatorAvailable final
{
public:
	class AFortGameplayMutator*                   MutatorActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HydrogenWidgetBase_OnMutatorAvailable;

// Function HydrogenUI.HydrogenWidgetBase.GetCaptureProgressPercent
// 0x0010 (0x0010 - 0x0000)
struct HydrogenWidgetBase_GetCaptureProgressPercent final
{
public:
	const class AHydrogenObjectiveActor*          InObjective;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HydrogenWidgetBase_GetCaptureProgressPercent;

// Function HydrogenUI.HydrogenWidgetBase.GetHydrogenMutator
// 0x0008 (0x0008 - 0x0000)
struct HydrogenWidgetBase_GetHydrogenMutator final
{
public:
	class AFortAthenaMutator_Hydrogen*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HydrogenWidgetBase_GetHydrogenMutator;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
