#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconAndNameWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass IconAndNameWidget.IconAndNameWidget_C
// 0x00E8 (0x0320 - 0x0238)
class UIconAndNameWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          CommonBorder_0;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Matched;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Name_0;                                            // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            Brush;                                             // 0x0260(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Text;                                              // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 BorderStyle;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bBorderVisible;                                    // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bMatches;                                          // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bBorderColorOverride;                              // 0x030A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30B[0x1];                                      // 0x030B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           RGBA0;                                             // 0x030C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IconAndNameWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Setup_Border();
	void Setup_Text();
	void Set_Border_Color(const struct FLinearColor& Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("IconAndNameWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"IconAndNameWidget_C")
	}
	static class UIconAndNameWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIconAndNameWidget_C>();
	}
};
DUMPER7_ASSERTS_UIconAndNameWidget_C;

SDK_NAMESPACE_END
