#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemEntry

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ItemEntry.ItemEntry_C.ExecuteUbergraph_ItemEntry
// 0x0010 (0x0010 - 0x0000)
struct ItemEntry_C_ExecuteUbergraph_ItemEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemEntry_C_ExecuteUbergraph_ItemEntry;

// Function ItemEntry.ItemEntry_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct ItemEntry_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemEntry_C_OnListItemObjectSet;

// Function ItemEntry.ItemEntry_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemEntry_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemEntry_C_BP_OnItemSelectionChanged;

// Function ItemEntry.ItemEntry_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemEntry_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ItemEntry_C_BP_OnItemExpansionChanged;

// Function ItemEntry.ItemEntry_C.GetListItemObject
// 0x0008 (0x0008 - 0x0000)
struct ItemEntry_C_GetListItemObject final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemEntry_C_GetListItemObject;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
