#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemPresentationEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ItemPresentationEntry.ItemPresentationEntry_C.ExecuteUbergraph_ItemPresentationEntry
// 0x0080 (0x0080 - 0x0000)
struct ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0010(0x0070)(ConstParm)
};
DUMPER7_ASSERTS_ItemPresentationEntry_C_ExecuteUbergraph_ItemPresentationEntry;

// Function ItemPresentationEntry.ItemPresentationEntry_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct ItemPresentationEntry_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_ItemPresentationEntry_C_OnMouseLeave;

// Function ItemPresentationEntry.ItemPresentationEntry_C.HandleHover
// 0x0008 (0x0008 - 0x0000)
struct ItemPresentationEntry_C_HandleHover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemPresentationEntry_C_HandleHover;

// Function ItemPresentationEntry.ItemPresentationEntry_C.HandleUnhover
// 0x0008 (0x0008 - 0x0000)
struct ItemPresentationEntry_C_HandleUnhover final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemPresentationEntry_C_HandleUnhover;

// Function ItemPresentationEntry.ItemPresentationEntry_C.HandleSelectedAnim
// 0x0010 (0x0010 - 0x0000)
struct ItemPresentationEntry_C_HandleSelectedAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemPresentationEntry_C_HandleSelectedAnim;

// Function ItemPresentationEntry.ItemPresentationEntry_C.HandelDeselectedAnim
// 0x0010 (0x0010 - 0x0000)
struct ItemPresentationEntry_C_HandelDeselectedAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemPresentationEntry_C_HandelDeselectedAnim;

// Function ItemPresentationEntry.ItemPresentationEntry_C.PlayIntro
// 0x0020 (0x0020 - 0x0000)
struct ItemPresentationEntry_C_PlayIntro final
{
public:
	float                                         TimeBeforeStart;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ItemPresentationEntry_C_PlayIntro;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
