#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemSeriesOrRarity

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass ItemSeriesOrRarity.ItemSeriesOrRarity_C
// 0x0028 (0x0288 - 0x0260)
class UItemSeriesOrRarity_C final : public UUserWidget
{
public:
	class UWidgetSwitcher*                        RarityOrSeriesSwitcher;                            // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RarityTextBlock;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SeriesBorder;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeriesTextBlock;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          OnlyShowSeries;                                    // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UpdateItemDefinition(class UFortItemDefinition* ItemDefinition);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ItemSeriesOrRarity_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ItemSeriesOrRarity_C")
	}
	static class UItemSeriesOrRarity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemSeriesOrRarity_C>();
	}
};
DUMPER7_ASSERTS_UItemSeriesOrRarity_C;

SDK_NAMESPACE_END
