#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JoinServer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass JoinServer.JoinServer_C
// 0x0080 (0x03E0 - 0x0360)
class UJoinServer_C final : public UFortUIStateWidget_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBuildWatermark_C*                      BuildWatermark;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetStack*                     MainContentStack;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ManualStart;                                       // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConfirmationDialogAction>      TutorialCanceledConfirmActions;                    // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   NoneAction;                                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundPromptTutorial;                               // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatchmakingAttempts;                               // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TutorialMatchmakingStarted;                        // 0x03A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UProgressWidget_C*                      ProgressWidget;                                    // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTutorialWindow_C*                      TutorialWindow;                                    // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbandonSession;                                    // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                MenuWidget;                                        // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxMatchmakingAttempts;                            // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URejoinWindow_C*                        RejoinWindow;                                      // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RejoinAttemptCount;                                // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_JoinServer(int32 EntryPoint);
	void OnEnterState(EFortUIState PreviousUIState);
	void Construct();
	void HandleClientEvent_OnboardingStartMatchmaking(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleRequestAbandon();
	void HandleRequestRejoinRetry();
	void HandleClientEvent_RejoinStart(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void ShowSkipTutorial();
	void RequestTutorialRetry();
	void OnSuccess_C91A02504569664A4B1E259E5F57A79D();
	void OnFailure_C91A02504569664A4B1E259E5F57A79D();
	void OnSuccess_B419884742513722D11D8AB4D90DE5E2();
	void OnFailure_B419884742513722D11D8AB4D90DE5E2();
	void DialogResult_B65B7C6342A70AAA7E4C689EE8A624BF(EFortDialogResult Result, class FName ResultName);
	void Initialize();
	void HandleMatchmakingComplete(EMatchmakingCompleteResult Result);
	void HandleMatchmakingStateChange(EMatchmakingState OldState, EMatchmakingState NewState);
	void HandleLobbyDisconnected();
	void HandleEnterState(EFortUIState PreviousState);
	void StartTutorialMatchmakingFlow();
	void SkipTutorial();
	void HandleLobbyTimeUpdated(int32 TimeRemaining);
	void GetMatchmakingError(EMatchmakingCompleteResult MatchMakingError, class FText* ErrorText);
	void ShowTutorialCanceled();
	class UWidget* HandleGetMainMenuContent();
	void ShowRejoinWindow();
	void HideRejoinWindow(bool AbandonSession_0);
	void RemoveRejoinWindowDuringRejoin();
	void ShowRetryRejoinSession();
	void ShowRetryRejoinWindow(const class FText& Failure, bool AllowRetry);
	void ShowAbandoningProgress();
	void HandleLobbyConnectingToGame();
	void IsCampaignSubGame(bool* Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("JoinServer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"JoinServer_C")
	}
	static class UJoinServer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJoinServer_C>();
	}
};
DUMPER7_ASSERTS_UJoinServer_C;

SDK_NAMESPACE_END
