#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalQuestRewardDetails

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function JournalQuestRewardDetails.JournalQuestRewardDetails_C.ExecuteUbergraph_JournalQuestRewardDetails
// 0x0004 (0x0004 - 0x0000)
struct JournalQuestRewardDetails_C_ExecuteUbergraph_JournalQuestRewardDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_JournalQuestRewardDetails_C_ExecuteUbergraph_JournalQuestRewardDetails;

// Function JournalQuestRewardDetails.JournalQuestRewardDetails_C.UpdatePlayButtonState
// 0x0004 (0x0004 - 0x0000)
struct JournalQuestRewardDetails_C_UpdatePlayButtonState final
{
public:
	bool                                          CallFunc_CanGotoQuest_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPlayQuest_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_JournalQuestRewardDetails_C_UpdatePlayButtonState;

// Function JournalQuestRewardDetails.JournalQuestRewardDetails_C.UpdatePanelInfo
// 0x0038 (0x0038 - 0x0000)
struct JournalQuestRewardDetails_C_UpdatePanelInfo final
{
public:
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRewardInfo                        CallFunc_GetRewardInfo_BP_ReturnValue;             // 0x0008(0x0030)()
};
DUMPER7_ASSERTS_JournalQuestRewardDetails_C_UpdatePanelInfo;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
