#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KairosSceneCapture

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum KairosSceneCapture.EKairosAvatarCaptureState
// NumValues: 0x0006
enum class EKairosAvatarCaptureState : uint8
{
	Unloaded                                 = 0,
	LoadingAssets                            = 1,
	ReadyToSpawn                             = 2,
	FinalizingSpawn                          = 3,
	Displaying                               = 4,
	EKairosAvatarCaptureState_MAX            = 5,
};

// Enum KairosSceneCapture.EKairosHeroAnimationType
// NumValues: 0x0004
enum class EKairosHeroAnimationType : uint8
{
	Unknown                                  = 0,
	Idle                                     = 1,
	Emote                                    = 2,
	EKairosHeroAnimationType_MAX             = 3,
};

// Enum KairosSceneCapture.EKairosHeroAnimationState
// NumValues: 0x0006
enum class EKairosHeroAnimationState : uint8
{
	Unknown                                  = 0,
	Idling                                   = 1,
	Emoting                                  = 2,
	Face_Live                                = 3,
	Face_Playback                            = 4,
	EKairosHeroAnimationState_MAX            = 5,
};

// Enum KairosSceneCapture.EKairosHeroSkeletonType
// NumValues: 0x0004
enum class EKairosHeroSkeletonType : uint8
{
	Unknown                                  = 0,
	Male                                     = 1,
	Female                                   = 2,
	EKairosHeroSkeletonType_MAX              = 3,
};

// Enum KairosSceneCapture.EKairosAppMode
// NumValues: 0x0004
enum class EKairosAppMode : uint8
{
	Unknown                                  = 0,
	AvatarCapture                            = 1,
	AvatarRender                             = 2,
	EKairosAppMode_MAX                       = 3,
};

// ScriptStruct KairosSceneCapture.KairosSnippetPlayRecord
// 0x0018 (0x0018 - 0x0000)
struct FKairosSnippetPlayRecord final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKairosSnippetPlayRecord;

// ScriptStruct KairosSceneCapture.KairosSnippetParams
// 0x0018 (0x0018 - 0x0000)
struct FKairosSnippetParams final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKairosSnippetParams;

// ScriptStruct KairosSceneCapture.KairosAvatarAttributesMcpData
// 0x0010 (0x0010 - 0x0000)
struct FKairosAvatarAttributesMcpData final
{
public:
	TArray<struct FMcpVariantReader>              Variants;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKairosAvatarAttributesMcpData;

// ScriptStruct KairosSceneCapture.KairosAvatarItemMcpData
// 0x0020 (0x0020 - 0x0000)
struct FKairosAvatarItemMcpData final
{
public:
	class FString                                 TemplateId;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FKairosAvatarAttributesMcpData         Attributes;                                        // 0x0010(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKairosAvatarItemMcpData;

// ScriptStruct KairosSceneCapture.KairosAvatarMcpData
// 0x0098 (0x0098 - 0x0000)
struct FKairosAvatarMcpData final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CurrentUser;                                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldPlayFacialAnimation;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKairosAvatarItemMcpData               Character;                                         // 0x0028(0x0020)(NativeAccessSpecifierPublic)
	struct FKairosAvatarItemMcpData               Backpack;                                          // 0x0048(0x0020)(NativeAccessSpecifierPublic)
	struct FKairosAvatarItemMcpData               Dance;                                             // 0x0068(0x0020)(NativeAccessSpecifierPublic)
	TArray<class FString>                         BackgroundColors;                                  // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKairosAvatarMcpData;

// ScriptStruct KairosSceneCapture.KairosCaptureAvatarParams
// 0x0040 (0x0040 - 0x0000)
struct FKairosCaptureAvatarParams final
{
public:
	class FString                                 Background;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Format;                                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FrameRate;                                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumFrames;                                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKairosAvatarMcpData>           Characters;                                        // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKairosCaptureAvatarParams;

// ScriptStruct KairosSceneCapture.KairosBobbleTimeParams
// 0x0060 (0x0060 - 0x0000)
struct FKairosBobbleTimeParams final
{
public:
	class FString                                 Background;                                        // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKairosAvatarMcpData>           Characters;                                        // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SnippetPath;                                       // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContainerType;                                     // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContainerID;                                       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MessageID;                                         // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKairosBobbleTimeParams;

// ScriptStruct KairosSceneCapture.KairosCaptureParams
// 0x0100 (0x0100 - 0x0000)
struct alignas(0x10) FKairosCaptureParams final
{
public:
	int32                                         FrameRate;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OverrideNumFrames;                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Size;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 BackgroundColor;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FullPathAndName;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0xD8];                                      // 0x0028(0x00D8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKairosCaptureParams;

// ScriptStruct KairosSceneCapture.KairosAvatarDisplayInfo
// 0x03C0 (0x03C0 - 0x0000)
struct FKairosAvatarDisplayInfo final
{
public:
	EKairosAvatarCaptureState                     CurrentState;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKairosAvatarCaptureState                     TargetState;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0xE];                                        // 0x0002(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SpawnTransform;                                    // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKairosAvatarMcpData                   AvatarData;                                        // 0x0040(0x0098)(NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x30];                                      // 0x00D8(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortAthenaLoadout                     Loadout;                                           // 0x0108(0x00F0)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      AnimToPlay;                                        // 0x01F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SnippetPathToPlay;                                 // 0x0200(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_210[0x10];                                     // 0x0210(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHero*                              HeroItem;                                          // 0x0220(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKairosCaptureParams                   CaptureParams;                                     // 0x0230(0x0100)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   BackgroundColors;                                  // 0x0330(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AKairosHeroBase*                        KairosHero;                                        // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerPawn*                        Pawn;                                              // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCurrentUser;                                    // 0x0350(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x0358(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             HeadBoneTransform;                                 // 0x0370(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bSpawnTransformIsAbsolute;                         // 0x03A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNewCharacter;                                   // 0x03A1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AFortPlayerPawn>            HeroPawnClass;                                     // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDefaultFrontendAnimClass;                      // 0x03B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B1[0xF];                                      // 0x03B1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKairosAvatarDisplayInfo;

// ScriptStruct KairosSceneCapture.KairosSceneInfo
// 0x0020 (0x0020 - 0x0000)
struct FKairosSceneInfo final
{
public:
	EKairosAppMode                                SceneAppMode;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKairosAvatarDisplayInfo>       SpawnedAvatars;                                    // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 BackgroundColor;                                   // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FKairosSceneInfo;

// ScriptStruct KairosSceneCapture.KairosAnimationFramingInfo
// 0x0050 (0x0050 - 0x0000)
struct FKairosAnimationFramingInfo final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           IdleMontage;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKairosHeroAnimationType                      AnimationType;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKairosHeroSkeletonType                       SkeletonType;                                      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0xE];                                       // 0x0012(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CameraTransform;                                   // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKairosAnimationFramingInfo;

SDK_NAMESPACE_END
