#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LagerRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_classes.hpp"
#include "LagerRuntime_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// Class LagerRuntime.FortAthenaLivingWorldConfigData
// 0x0088 (0x00B8 - 0x0030)
class UFortAthenaLivingWorldConfigData final : public UDataAsset
{
public:
	TSoftObjectPtr<class UDataTable>              CategoryTable;                                     // 0x0030(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxActorCount;                                     // 0x0058(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MaxEventSpawnPerTick;                              // 0x0078(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         MinimumEventGenerationInterval;                    // 0x0098(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaLivingWorldConfigData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaLivingWorldConfigData")
	}
	static class UFortAthenaLivingWorldConfigData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldConfigData>();
	}
};
DUMPER7_ASSERTS_UFortAthenaLivingWorldConfigData;

// Class LagerRuntime.FortAthenaLivingWorldEventData
// 0x0068 (0x0098 - 0x0030)
class UFortAthenaLivingWorldEventData final : public UDataAsset
{
public:
	int32                                         TimeOfDayFilters;                                  // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WaterLevelIndexMin;                                // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WaterLevelIndexMax;                                // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      ProviderFiltersTagQuery;                           // 0x0040(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FFortAthenaLivingWorldEventDataActorSpawnDescription> ActorDescriptions;           // 0x0088(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaLivingWorldEventData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaLivingWorldEventData")
	}
	static class UFortAthenaLivingWorldEventData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldEventData>();
	}
};
DUMPER7_ASSERTS_UFortAthenaLivingWorldEventData;

// Class LagerRuntime.FortAthenaLivingWorldManager
// 0x0300 (0x03B0 - 0x00B0)
class UFortAthenaLivingWorldManager : public UGameStateComponent
{
public:
	TSoftObjectPtr<class UFortAthenaLivingWorldConfigData> LagerConfig;                              // 0x00B0(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         LagerEnabled;                                      // 0x00D8(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         PointProviders;                                    // 0x00F8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            SpecialActorMinimapIconBrush;                      // 0x0108(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FVector2D                              SpecialActorMinimapIconScale;                      // 0x0190(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            SpecialActorCompassIconBrush;                      // 0x0198(0x0088)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	struct FVector2D                              SpecialActorCompassIconScale;                      // 0x0220(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSubclassOf<class UFortAthenaAISpawnerData>> LoadedSpawnerDataClass;                      // 0x0228(0x0010)(ZeroConstructor, Transient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortGameStateAthena*                   CachedGameState;                                   // 0x0238(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_240[0xF8];                                     // 0x0240(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         RuntimePointProviderList;                          // 0x0338(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<class AActor*>                           RuntimePointProviderOwners;                        // 0x0348(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_398[0x18];                                     // 0x0398(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void LivingWorldManagerRegisterPointProvider(class AActor* PointProvider);
	static void LivingWorldManagerUnregisterPointProvider(class AActor* PointProvider);

	void LivingWorldManagerFlush();
	void LivingWorldManagerGenerateEvents();
	void LivingWorldManagerProviderDebugActor(int32 ProviderIndex);
	void LivingWorldManagerToggleActorMinimap();
	void LivingWorldManagerToggleGenerateEvents();
	void LivingWorldManagerToggleVerboseLogging();
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnPatrolPathAdded(class AFortAthenaPatrolPath* PatrolPath);
	void OnSpawnedActorDestroy(class AActor* DestroyedActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaLivingWorldManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaLivingWorldManager")
	}
	static class UFortAthenaLivingWorldManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaLivingWorldManager>();
	}
};
DUMPER7_ASSERTS_UFortAthenaLivingWorldManager;

// Class LagerRuntime.FortAthenaLivingWorldPointProviderInterface
// 0x0000 (0x0000 - 0x0000)
class IFortAthenaLivingWorldPointProviderInterface final
{
public:
	void OnEventRequested();
	void OnSpawnedActorFailed();

	void GetFiltersTags(struct FGameplayTagContainer* FilterTags) const;
	bool GetValidLocation(const struct FFortAthenaLivingWorldPointProviderFilterRules& PointFilter, struct FVector* OutPosition, struct FRotator* OutRotation) const;
	bool IsEnabled(const struct FFortAthenaLivingWorldPointProviderFilterRules& PointFilter) const;
	void OnSpawnedActor(class AActor* SpawnedActor) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaLivingWorldPointProviderInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaLivingWorldPointProviderInterface")
	}
	static class IFortAthenaLivingWorldPointProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFortAthenaLivingWorldPointProviderInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFortAthenaLivingWorldPointProviderInterface;

// Class LagerRuntime.FortAthenaLivingWorldVolume
// 0x0108 (0x0360 - 0x0258)
class AFortAthenaLivingWorldVolume final : public AVolume
{
public:
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  FiltersTags;                                       // 0x0260(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                      DeactivationTagsQuery;                             // 0x0280(0x0048)(Edit, NativeAccessSpecifierPrivate)
	float                                         DeactivationTagsRange;                             // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQuery*                              EnvironmentQuery;                                  // 0x02D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         WaterLevelIndexMin;                                // 0x02D8(0x0020)(Edit, NativeAccessSpecifierPrivate)
	struct FScalableFloat                         WaterLevelIndexMax;                                // 0x02F8(0x0020)(Edit, NativeAccessSpecifierPrivate)
	class AFortGameStateAthena*                   CachedGameState;                                   // 0x0318(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_320[0x40];                                     // 0x0320(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnPointProviderRegistered(class AActor* PointProvider);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaLivingWorldVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaLivingWorldVolume")
	}
	static class AFortAthenaLivingWorldVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaLivingWorldVolume>();
	}
};
DUMPER7_ASSERTS_AFortAthenaLivingWorldVolume;

// Class LagerRuntime.FortCheatManager_LivingWorldManager
// 0x0000 (0x0028 - 0x0028)
class UFortCheatManager_LivingWorldManager final : public UChildCheatManager
{
public:
	void LivingWorldManagerSpawn(const class FString& EventDataName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCheatManager_LivingWorldManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCheatManager_LivingWorldManager")
	}
	static class UFortCheatManager_LivingWorldManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_LivingWorldManager>();
	}
};
DUMPER7_ASSERTS_UFortCheatManager_LivingWorldManager;

// Class LagerRuntime.FortAthenaPatrolPathPointProvider
// 0x0040 (0x0260 - 0x0220)
class AFortAthenaPatrolPathPointProvider final : public AActor
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  FiltersTags;                                       // 0x0228(0x0020)(Edit, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AFortAthenaPatrolPath>   PatrolPathWeakPtr;                                 // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortGameStateAthena*                   CachedGameState;                                   // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCurrentPlaylistLoaded(class FName PlaylistName, const struct FGameplayTagContainer& PlaylistContextTags);
	void OnSpawnedActorDestroyed(class AActor* DestroyedActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaPatrolPathPointProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaPatrolPathPointProvider")
	}
	static class AFortAthenaPatrolPathPointProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaPatrolPathPointProvider>();
	}
};
DUMPER7_ASSERTS_AFortAthenaPatrolPathPointProvider;

SDK_NAMESPACE_END
