#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LagerRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "LagerRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerRegisterPointProvider
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider final
{
public:
	class AActor*                                 PointProvider;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_LivingWorldManagerRegisterPointProvider;

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerUnregisterPointProvider
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider final
{
public:
	class AActor*                                 PointProvider;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_LivingWorldManagerUnregisterPointProvider;

// Function LagerRuntime.FortAthenaLivingWorldManager.LivingWorldManagerProviderDebugActor
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor final
{
public:
	int32                                         ProviderIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_LivingWorldManagerProviderDebugActor;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnCurrentPlaylistLoaded;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnPatrolPathAdded
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_OnPatrolPathAdded final
{
public:
	class AFortAthenaPatrolPath*                  PatrolPath;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnPatrolPathAdded;

// Function LagerRuntime.FortAthenaLivingWorldManager.OnSpawnedActorDestroy
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldManager_OnSpawnedActorDestroy final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldManager_OnSpawnedActorDestroy;

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetFiltersTags
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetFiltersTags final
{
public:
	struct FGameplayTagContainer                  FilterTags;                                        // 0x0000(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_GetFiltersTags;

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.GetValidLocation
// 0x0020 (0x0020 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_GetValidLocation final
{
public:
	struct FFortAthenaLivingWorldPointProviderFilterRules PointFilter;                               // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutPosition;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               OutRotation;                                       // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_GetValidLocation;

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.IsEnabled
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_IsEnabled final
{
public:
	struct FFortAthenaLivingWorldPointProviderFilterRules PointFilter;                               // 0x0000(0x0001)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_IsEnabled;

// Function LagerRuntime.FortAthenaLivingWorldPointProviderInterface.OnSpawnedActor
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldPointProviderInterface_OnSpawnedActor final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldPointProviderInterface_OnSpawnedActor;

// Function LagerRuntime.FortAthenaLivingWorldVolume.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldVolume_OnCurrentPlaylistLoaded;

// Function LagerRuntime.FortAthenaLivingWorldVolume.OnPointProviderRegistered
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaLivingWorldVolume_OnPointProviderRegistered final
{
public:
	class AActor*                                 PointProvider;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaLivingWorldVolume_OnPointProviderRegistered;

// Function LagerRuntime.FortCheatManager_LivingWorldManager.LivingWorldManagerSpawn
// 0x0010 (0x0010 - 0x0000)
struct FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn final
{
public:
	class FString                                 EventDataName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortCheatManager_LivingWorldManager_LivingWorldManagerSpawn;

// Function LagerRuntime.FortAthenaPatrolPathPointProvider.OnCurrentPlaylistLoaded
// 0x0028 (0x0028 - 0x0000)
struct FortAthenaPatrolPathPointProvider_OnCurrentPlaylistLoaded final
{
public:
	class FName                                   PlaylistName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PlaylistContextTags;                               // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaPatrolPathPointProvider_OnCurrentPlaylistLoaded;

// Function LagerRuntime.FortAthenaPatrolPathPointProvider.OnSpawnedActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortAthenaPatrolPathPointProvider_OnSpawnedActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortAthenaPatrolPathPointProvider_OnSpawnedActorDestroyed;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
