#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LiveStreamAnimation

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "LiveStreamAnimation_structs.hpp"


SDK_NAMESPACE_START

// Class LiveStreamAnimation.LiveStreamAnimationChannel
// 0x0010 (0x0080 - 0x0070)
class ULiveStreamAnimationChannel final : public UChannel
{
public:
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveStreamAnimationChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveStreamAnimationChannel")
	}
	static class ULiveStreamAnimationChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamAnimationChannel>();
	}
};
DUMPER7_ASSERTS_ULiveStreamAnimationChannel;

// Class LiveStreamAnimation.LiveStreamAnimationDataHandler
// 0x0010 (0x0038 - 0x0028)
class ULiveStreamAnimationDataHandler : public UObject
{
public:
	class ULiveStreamAnimationSubsystem*          OwningSubsystem;                                   // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveStreamAnimationDataHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveStreamAnimationDataHandler")
	}
	static class ULiveStreamAnimationDataHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamAnimationDataHandler>();
	}
};
DUMPER7_ASSERTS_ULiveStreamAnimationDataHandler;

// Class LiveStreamAnimation.LiveStreamAnimationSettings
// 0x0038 (0x0070 - 0x0038)
class ULiveStreamAnimationSettings final : public UDeveloperSettings
{
public:
	TArray<class FName>                           HandleNames;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, Transient, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FSoftClassPath>                 ConfiguredDataHandlers;                            // 0x0048(0x0010)(Edit, ZeroConstructor, Transient, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x18];                                      // 0x0058(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveStreamAnimationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveStreamAnimationSettings")
	}
	static class ULiveStreamAnimationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamAnimationSettings>();
	}
};
DUMPER7_ASSERTS_ULiveStreamAnimationSettings;

// Class LiveStreamAnimation.LiveStreamAnimationSubsystem
// 0x0048 (0x0078 - 0x0030)
class ULiveStreamAnimationSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x0050(0x0001)(ZeroConstructor, Transient, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x17];                                      // 0x0051(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULiveStreamAnimationDataHandler*> ConfiguredDataHandlers;                           // 0x0068(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetAcceptClientPackets_Private(bool bInShouldAcceptClientPackets);
	void SetRole(const ELiveStreamAnimationRole NewRole);

	class ULiveStreamAnimationDataHandler* GetDataHandler(TSubclassOf<class ULiveStreamAnimationDataHandler> Type) const;
	ELiveStreamAnimationRole GetRole() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveStreamAnimationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveStreamAnimationSubsystem")
	}
	static class ULiveStreamAnimationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveStreamAnimationSubsystem>();
	}
};
DUMPER7_ASSERTS_ULiveStreamAnimationSubsystem;

SDK_NAMESPACE_END
