#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocalNotifications

#include "Basic.hpp"


SDK_NAMESPACE_START

// Enum LocalNotifications.ELocalNotificationEventType
// NumValues: 0x0003
enum class ELocalNotificationEventType : uint8
{
	None                                     = 0,
	FirstLogin                               = 1,
	Max                                      = 2,
};

// Enum LocalNotifications.ELocalNotificationParams
// NumValues: 0x0006
enum class ELocalNotificationParams : uint8
{
	BestHour24ToNotify                       = 0,
	SpecificFireDateTime                     = 1,
	HoursSinceLastSession                    = 2,
	HoursAfterEvent_Max                      = 3,
	HoursAfterEvent_Min                      = 4,
	Max                                      = 5,
};

// Enum LocalNotifications.ELocalNotificationType
// NumValues: 0x0003
enum class ELocalNotificationType : uint8
{
	SpecificDateTime                         = 0,
	RangeDateTime                            = 1,
	Max                                      = 2,
};

// ScriptStruct LocalNotifications.LocalNotificationData
// 0x0090 (0x0090 - 0x0000)
struct FLocalNotificationData final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELocalNotificationType                        Type;                                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELocalNotificationEventType                   EventType;                                         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ELocalNotificationParams, class FString> ParamsByName;                                      // 0x0008(0x0050)(NativeAccessSpecifierPublic)
	bool                                          LocalTime;                                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TitleKey;                                          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BodyKey;                                           // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActivationEvent;                                   // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLocalNotificationData;

SDK_NAMESPACE_END
