#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LowTowerRuntime

#include "Basic.hpp"

#include "LowTowerRuntime_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function LowTowerRuntime.FortHardyComponent_Telemetry.SetExtractionReason
// 0x0001 (0x0001 - 0x0000)
struct FortHardyComponent_Telemetry_SetExtractionReason final
{
public:
	EHardyExtractionReason                        Reason;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortHardyComponent_Telemetry_SetExtractionReason;

// Function LowTowerRuntime.FortLaurelAnimInstance.SetAnimInstanceInformation
// 0x0001 (0x0001 - 0x0000)
struct FortLaurelAnimInstance_SetAnimInstanceInformation final
{
public:
	bool                                          bInIsActive;                                       // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortLaurelAnimInstance_SetAnimInstanceInformation;

// Function LowTowerRuntime.FortLaurelAnimInstance.SetLaurelInformation
// 0x0010 (0x0010 - 0x0000)
struct FortLaurelAnimInstance_SetLaurelInformation final
{
public:
	bool                                          bInHasItemInInventory;                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInPawnIsDestroyingBuildingForNav;                 // 0x0001(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHasPawnGoal;                                    // 0x0002(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           InGoalActor;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortLaurelAnimInstance_SetLaurelInformation;

// Function LowTowerRuntime.FortLaurelComponent_Telemetry.OnDropAllItems
// 0x0001 (0x0001 - 0x0000)
struct FortLaurelComponent_Telemetry_OnDropAllItems final
{
public:
	ELaurelDropItemReason                         DropItemReason;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortLaurelComponent_Telemetry_OnDropAllItems;

// Function LowTowerRuntime.FortLaurelComponent_Telemetry.SetExtractionReason
// 0x0001 (0x0001 - 0x0000)
struct FortLaurelComponent_Telemetry_SetExtractionReason final
{
public:
	ELaurelExtractionReason                       Reason;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortLaurelComponent_Telemetry_SetExtractionReason;

// Function LowTowerRuntime.FortLaurelComponent_Telemetry.SetLaurelType
// 0x0001 (0x0001 - 0x0000)
struct FortLaurelComponent_Telemetry_SetLaurelType final
{
public:
	ELaurelType                                   Type;                                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortLaurelComponent_Telemetry_SetLaurelType;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
