#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LSALiveLink

#include "Basic.hpp"

#include "LiveStreamAnimation_structs.hpp"
#include "LiveStreamAnimation_classes.hpp"
#include "LSALiveLink_structs.hpp"
#include "LiveLinkInterface_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class LSALiveLink.LSALiveLinkDataHandler
// 0x0010 (0x0048 - 0x0038)
class ULSALiveLinkDataHandler final : public ULiveStreamAnimationDataHandler
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool StartTrackingLiveLinkSubject(const class FName LiveLinkSubject, const struct FLiveStreamAnimationHandleWrapper& RegisteredName, const struct FLSALiveLinkSourceOptions& Options, const struct FLiveStreamAnimationHandleWrapper& TranslationProfile);
	void StopTrackingLiveLinkSubject(const struct FLiveStreamAnimationHandleWrapper& RegisteredName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LSALiveLinkDataHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LSALiveLinkDataHandler")
	}
	static class ULSALiveLinkDataHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULSALiveLinkDataHandler>();
	}
};
DUMPER7_ASSERTS_ULSALiveLinkDataHandler;

// Class LSALiveLink.LSALiveLinkFrameTranslator
// 0x0060 (0x0088 - 0x0028)
class ULSALiveLinkFrameTranslator final : public ULiveLinkFrameTranslator
{
public:
	TMap<struct FLiveStreamAnimationHandleWrapper, struct FLSALiveLinkTranslationProfile> TranslationProfiles; // 0x0028(0x0050)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x10];                                      // 0x0078(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LSALiveLinkFrameTranslator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LSALiveLinkFrameTranslator")
	}
	static class ULSALiveLinkFrameTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULSALiveLinkFrameTranslator>();
	}
};
DUMPER7_ASSERTS_ULSALiveLinkFrameTranslator;

// Class LSALiveLink.LSALiveLinkRole
// 0x0000 (0x0028 - 0x0028)
class ULSALiveLinkRole final : public ULiveLinkBasicRole
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LSALiveLinkRole")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LSALiveLinkRole")
	}
	static class ULSALiveLinkRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULSALiveLinkRole>();
	}
};
DUMPER7_ASSERTS_ULSALiveLinkRole;

// Class LSALiveLink.LSALiveLinkSettings
// 0x0040 (0x0078 - 0x0038)
class ULSALiveLinkSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class ULSALiveLinkFrameTranslator> FrameTranslator;                               // 0x0038(0x0028)(Edit, Transient, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LSALiveLinkSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LSALiveLinkSettings")
	}
	static class ULSALiveLinkSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULSALiveLinkSettings>();
	}
};
DUMPER7_ASSERTS_ULSALiveLinkSettings;

// Class LSALiveLink.LiveLinkTestSkelMeshTrackerComponent
// 0x00D0 (0x0180 - 0x00B0)
class ULiveLinkTestSkelMeshTrackerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TranslationProfile;                                // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FComponentReference                    SkelMeshComp;                                      // 0x00C0(0x0028)(Edit, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class USkeletalMeshComponent>  WeakSkelMeshComp;                                  // 0x00E8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FBoneReference>                 BonesToTrack;                                      // 0x00F0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_100[0x80];                                     // 0x0100(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartTrackingSkelMesh(class FName InSubjectName);
	void StopTrackingSkelMesh();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LiveLinkTestSkelMeshTrackerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LiveLinkTestSkelMeshTrackerComponent")
	}
	static class ULiveLinkTestSkelMeshTrackerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULiveLinkTestSkelMeshTrackerComponent>();
	}
};
DUMPER7_ASSERTS_ULiveLinkTestSkelMeshTrackerComponent;

SDK_NAMESPACE_END
