#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_HighTower_Tomato_Casual_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass M_MED_HighTower_Tomato_Casual_AnimBP.M_MED_HighTower_Tomato_Casual_AnimBP_C
// 0x0180 (0x0620 - 0x04A0)
class UM_MED_HighTower_Tomato_Casual_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData             AnimBlueprintClassSubsystem_PropertyAccess;        // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04B0(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x04E0(0x0140)(ContainsInstancedReference)

public:
	void ExecuteUbergraph_M_MED_HighTower_Tomato_Casual_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("M_MED_HighTower_Tomato_Casual_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"M_MED_HighTower_Tomato_Casual_AnimBP_C")
	}
	static class UM_MED_HighTower_Tomato_Casual_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_HighTower_Tomato_Casual_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_UM_MED_HighTower_Tomato_Casual_AnimBP_C;

SDK_NAMESPACE_END
