#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MantisRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


SDK_NAMESPACE_START

// Enum MantisRuntime.EFortMantisBranchPath
// NumValues: 0x0007
enum class EFortMantisBranchPath : uint8
{
	Default                                  = 0,
	Path_1                                   = 1,
	Path_2                                   = 2,
	Path_3                                   = 3,
	Path_4                                   = 4,
	Path_5                                   = 5,
	EFortMantisBranchPath_MAX                = 6,
};

// Enum MantisRuntime.EFortMantisBranchRule
// NumValues: 0x0004
enum class EFortMantisBranchRule : uint8
{
	Off                                      = 0,
	Any                                      = 1,
	Starter                                  = 2,
	EFortMantisBranchRule_MAX                = 3,
};

// Enum MantisRuntime.EFortMantisNotifyWindow
// NumValues: 0x0005
enum class EFortMantisNotifyWindow : uint8
{
	Invalid                                  = 0,
	Input                                    = 1,
	Execution                                = 2,
	Damage                                   = 3,
	EFortMantisNotifyWindow_MAX              = 4,
};

// Enum MantisRuntime.EFortMantisNotifyEvent
// NumValues: 0x0003
enum class EFortMantisNotifyEvent : uint8
{
	Invalid                                  = 0,
	Branch                                   = 1,
	EFortMantisNotifyEvent_MAX               = 2,
};

// ScriptStruct MantisRuntime.FortRootMotionSource_Mantis
// 0x0020 (0x00C0 - 0x00A0)
struct FFortRootMotionSource_Mantis final : public FRootMotionSource
{
public:
	float                                         CurrentTechniqueTime;                              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           TechniqueMontage;                                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LatestRepMovementLocation;                         // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFortRootMotionSource_Mantis;

// ScriptStruct MantisRuntime.FortMantisTargetData
// 0x0008 (0x0010 - 0x0008)
struct FFortMantisTargetData final : public FGameplayAbilityTargetData
{
public:
	int32                                         TechniqueDataIndex;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFortMantisTargetData;

// ScriptStruct MantisRuntime.FortMantisTechniqueBranch
// 0x0014 (0x0014 - 0x0000)
struct FFortMantisTechniqueBranch final
{
public:
	class FName                                   FromTechnique;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ToTechnique;                                       // 0x0008(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisBranchPath                         BranchPath;                                        // 0x0010(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFortMantisTechniqueBranch;

// ScriptStruct MantisRuntime.FortMantisTechniqueData
// 0x00B8 (0x00B8 - 0x0000)
struct FFortMantisTechniqueData final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartsSequence;                                   // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEndsSequence;                                     // 0x0009(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InputWindowDelay;                                  // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0010(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRootMotion;                                    // 0x0018(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      ActivationTagQuery;                                // 0x0020(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                      OngoingTagQuery;                                   // 0x0068(0x0048)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ApplicationTag;                                    // 0x00B0(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFortMantisTechniqueData;

// ScriptStruct MantisRuntime.FortMantisMontageData
// 0x0018 (0x0018 - 0x0000)
struct FFortMantisMontageData final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFortMantisMontageData;

SDK_NAMESPACE_END
