#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MantisRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "MantisRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "ModularGameplay_classes.hpp"


SDK_NAMESPACE_START

// Class MantisRuntime.FortItemLayerAnimInstance_UncleBrolly
// 0x0070 (0x0380 - 0x0310)
class UFortItemLayerAnimInstance_UncleBrolly : public UFortItemLayerAnimInstance
{
public:
	struct FCachedAnimStateArray                  UmbrellaGliderOpenStateDataArray;                  // 0x0310(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FVector                                WrapTranslation;                                   // 0x0328(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               WrapRotation;                                      // 0x0334(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               RootRotationOffset;                                // 0x0340(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LandingPredictedTimer;                             // 0x034C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldUpdateYawCorrection;                        // 0x0350(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasAcceleratingBeforeDodge;                       // 0x0351(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UncleBrollyDeployCurveValue;                       // 0x0354(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DashChargeTier;                                    // 0x0358(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DashChargeAdditivePlayrate;                        // 0x035C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUmbrellaFailing;                                // 0x0360(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMeleeGuarding;                                  // 0x0361(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSprinting;                                      // 0x0362(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInAir;                                          // 0x0363(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLandingPredicted;                               // 0x0364(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumping;                                        // 0x0365(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodging;                                        // 0x0366(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodgingEast;                                    // 0x0367(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodgingSouth;                                   // 0x0368(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodgingWest;                                    // 0x0369(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashing;                                        // 0x036A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashCharging;                                   // 0x036B(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashPredictingEnd;                              // 0x036C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsChargeTier1;                                    // 0x036D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsChargeTier2;                                    // 0x036E(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsChargeTier3;                                    // 0x036F(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMeleeGuardingOrUmbrellaFailing;                   // 0x0370(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Default_to_GuardLoop;                  // 0x0371(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Default_to_GuardIntro;                 // 0x0372(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_GuardIntro_to_Default;                 // 0x0373(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpperBodyShouldPassThrough;                       // 0x0374(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUmbrellaGliderIsOpen;                             // 0x0375(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_376[0xA];                                      // 0x0376(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortItemLayerAnimInstance_UncleBrolly")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortItemLayerAnimInstance_UncleBrolly")
	}
	static class UFortItemLayerAnimInstance_UncleBrolly* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemLayerAnimInstance_UncleBrolly>();
	}
};
DUMPER7_ASSERTS_UFortItemLayerAnimInstance_UncleBrolly;

// Class MantisRuntime.FortAbilityTask_ApplyRootMotionMantisForce
// 0x0020 (0x00D8 - 0x00B8)
class UFortAbilityTask_ApplyRootMotionMantisForce final : public UAbilityTask_ApplyRootMotion_Base
{
public:
	TMulticastInlineDelegate<void()>              OnFinish;                                          // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x00C8(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           TechniqueMontage;                                  // 0x00D0(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UFortAbilityTask_ApplyRootMotionMantisForce* ApplyRootMotionMantisForce(class UGameplayAbility* OwningAbility, float Duration_0, class UAnimMontage* TechniqueMontage_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAbilityTask_ApplyRootMotionMantisForce")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAbilityTask_ApplyRootMotionMantisForce")
	}
	static class UFortAbilityTask_ApplyRootMotionMantisForce* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAbilityTask_ApplyRootMotionMantisForce>();
	}
};
DUMPER7_ASSERTS_UFortAbilityTask_ApplyRootMotionMantisForce;

// Class MantisRuntime.FortMantisPawnComponent
// 0x0160 (0x0210 - 0x00B0)
class UFortMantisPawnComponent final : public UPawnComponent
{
public:
	uint8                                         Pad_B0[0x60];                                      // 0x00B0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UAnimMontage*, struct FFortMantisMontageData> MontageDataMap;                         // 0x0110(0x0050)(Protected, NativeAccessSpecifierProtected)
	class UFortMantisData*                        MantisData;                                        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AFortWeapon*                            Weapon;                                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_170[0xA0];                                     // 0x0170(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnCharacterMovementPreUpdate(class UCharacterMovementComponent* CharMoveComp, float DeltaSeconds);
	void OnPostPhysicsRotation(class UCharacterMovementComponent* CharMoveComp, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMantisPawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMantisPawnComponent")
	}
	static class UFortMantisPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMantisPawnComponent>();
	}
};
DUMPER7_ASSERTS_UFortMantisPawnComponent;

// Class MantisRuntime.FortAnimNotify_Mantis
// 0x0008 (0x0040 - 0x0038)
class UFortAnimNotify_Mantis final : public UAnimNotify
{
public:
	EFortMantisNotifyEvent                        MantisNotifyEvent;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisBranchRule                         MantisBranchRule;                                  // 0x0039(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortMantisBranchPath                         MantisBranchPath;                                  // 0x003A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAnimNotify_Mantis")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAnimNotify_Mantis")
	}
	static class UFortAnimNotify_Mantis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimNotify_Mantis>();
	}
};
DUMPER7_ASSERTS_UFortAnimNotify_Mantis;

// Class MantisRuntime.FortMantisWeaponComponent
// 0x0010 (0x00C0 - 0x00B0)
class UFortMantisWeaponComponent final : public UFortWeaponComponent
{
public:
	class UFortMantisData*                        MantisData;                                        // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMantisPawnComponent*               MantisPawnComponent;                               // 0x00B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMantisWeaponComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMantisWeaponComponent")
	}
	static class UFortMantisWeaponComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMantisWeaponComponent>();
	}
};
DUMPER7_ASSERTS_UFortMantisWeaponComponent;

// Class MantisRuntime.FortAnimNotifyState_Mantis
// 0x0010 (0x0040 - 0x0030)
class UFortAnimNotifyState_Mantis final : public UAnimNotifyState
{
public:
	EFortMantisNotifyWindow                       MantisNotifyWindow;                                // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           MantisNotifyTag;                                   // 0x0034(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAnimNotifyState_Mantis")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAnimNotifyState_Mantis")
	}
	static class UFortAnimNotifyState_Mantis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAnimNotifyState_Mantis>();
	}
};
DUMPER7_ASSERTS_UFortAnimNotifyState_Mantis;

// Class MantisRuntime.FortGameplayAbility_Mantis
// 0x0020 (0x0AC8 - 0x0AA8)
class UFortGameplayAbility_Mantis : public UFortGameplayAbility
{
public:
	class UFortMantisPawnComponent*               MantisPawnComponent;                               // 0x0AA8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAbilityTask_PlayMontageAndWait*        MontageTask;                                       // 0x0AB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortAbilityTask_ApplyRootMotionMantisForce* RootMotionTask;                               // 0x0AB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AC0[0x8];                                      // 0x0AC0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnMantisTechniqueHit(const struct FGameplayAbilityTargetDataHandle& TargetDataHandle, const struct FGameplayTag& ApplicationTag);
	void OnMontageCancelled();
	void OnMontageFinished();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortGameplayAbility_Mantis")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortGameplayAbility_Mantis")
	}
	static class UFortGameplayAbility_Mantis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortGameplayAbility_Mantis>();
	}
};
DUMPER7_ASSERTS_UFortGameplayAbility_Mantis;

// Class MantisRuntime.FortMantisData
// 0x0050 (0x0080 - 0x0030)
class UFortMantisData final : public UDataAsset
{
public:
	bool                                          bDetachCharacterRotationFromCamera;                // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReattachCharacterRotationBlendTime;                // 0x0034(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReattachCharacterRotationBlendExponent;            // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindupCharacterRotationRate;                       // 0x003C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExecutionCharacterRotationRate;                    // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RecoveryCharacterRotationRate;                     // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortGameplayAbility_Mantis> TechniqueAbility;                                 // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortGameplayEffectContainer>   TechniqueAdditionEffectContainers;                 // 0x0050(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortMantisTechniqueData>       Techniques;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFortMantisTechniqueBranch>     Branches;                                          // 0x0070(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMantisData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMantisData")
	}
	static class UFortMantisData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMantisData>();
	}
};
DUMPER7_ASSERTS_UFortMantisData;

// Class MantisRuntime.UncleBrollyWeaponAnimInstance
// 0x0030 (0x02F0 - 0x02C0)
class UUncleBrollyWeaponAnimInstance final : public UAnimInstance
{
public:
	TSubclassOf<class UAnimInstance>              UncleBrollyItemLayer;                              // 0x02B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               UmbrellaRotation;                                  // 0x02C0(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         UmbrellaSpinSpeed;                                 // 0x02CC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlockDeployEndPlayrate;                            // 0x02D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlockDeployEndStartPosition;                       // 0x02D4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDodging;                                        // 0x02D8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPlayingMeleeAnim;                               // 0x02D9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUmbrellaFailing;                                // 0x02DA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMeleeGuarding;                                  // 0x02DB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInAir;                                          // 0x02DC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashing;                                        // 0x02DD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSprinting;                                      // 0x02DE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPredictingEnd;                                  // 0x02DF(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashCharging;                                   // 0x02E0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDashPredictingEnd;                              // 0x02E1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInAirAndMeleeGuarding;                            // 0x02E2(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Default_to_DeployStart;                // 0x02E3(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_DeployStart_to_Default;                // 0x02E4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_Fail_to_FailToDeploy;                  // 0x02E5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTransition_FailLoop_to_DeployEnd;                 // 0x02E6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E7[0x9];                                      // 0x02E7(0x0009)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UncleBrollyWeaponAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UncleBrollyWeaponAnimInstance")
	}
	static class UUncleBrollyWeaponAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUncleBrollyWeaponAnimInstance>();
	}
};
DUMPER7_ASSERTS_UUncleBrollyWeaponAnimInstance;

SDK_NAMESPACE_END
