#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshNetwork

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "ReplicationGraph_structs.hpp"
#include "ReplicationGraph_classes.hpp"
#include "MeshNetwork_structs.hpp"


SDK_NAMESPACE_START

// Class MeshNetwork.MeshBeaconClient
// 0x0070 (0x0320 - 0x02B0)
class AMeshBeaconClient : public AOnlineBeaconClient
{
public:
	uint8                                         Pad_2B0[0x40];                                     // 0x02B0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bConnectedToRoot;                                  // 0x02F0(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              MeshPingTime;                                      // 0x02F8(0x0008)(Net, ZeroConstructor, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FString>                         ParentIds;                                         // 0x0300(0x0010)(Net, ZeroConstructor, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x10];                                     // 0x0310(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_ConnectedToRoot();
	void OnRep_MeshPingTime();
	void OnRep_ParentIds();
	void ServerUpdateLevelVisibility(const struct FUpdateLevelVisibilityLevelInfo& LevelVisibility);
	void ServerUpdateMultipleLevelsVisibility(const TArray<struct FUpdateLevelVisibilityLevelInfo>& LevelVisibilities);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshBeaconClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshBeaconClient")
	}
	static class AMeshBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMeshBeaconClient>();
	}
};
DUMPER7_ASSERTS_AMeshBeaconClient;

// Class MeshNetwork.MeshBeaconHost
// 0x0008 (0x0310 - 0x0308)
class AMeshBeaconHost : public AOnlineBeaconHost
{
public:
	int32                                         MaxConnections;                                    // 0x0308(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshBeaconHost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshBeaconHost")
	}
	static class AMeshBeaconHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMeshBeaconHost>();
	}
};
DUMPER7_ASSERTS_AMeshBeaconHost;

// Class MeshNetwork.MeshReplicationGraphNode_AlwaysRelevant_ForConnection
// 0x0020 (0x00F0 - 0x00D0)
class UMeshReplicationGraphNode_AlwaysRelevant_ForConnection final : public UReplicationGraphNode_ActorList
{
public:
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAlwaysRelevantActorInfo>       PastRelevantActors;                                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshReplicationGraphNode_AlwaysRelevant_ForConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshReplicationGraphNode_AlwaysRelevant_ForConnection")
	}
	static class UMeshReplicationGraphNode_AlwaysRelevant_ForConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshReplicationGraphNode_AlwaysRelevant_ForConnection>();
	}
};
DUMPER7_ASSERTS_UMeshReplicationGraphNode_AlwaysRelevant_ForConnection;

// Class MeshNetwork.MeshBeaconHostObject
// 0x0018 (0x0260 - 0x0248)
class AMeshBeaconHostObject : public AOnlineBeaconHostObject
{
public:
	uint8                                         Pad_248[0x18];                                     // 0x0248(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshBeaconHostObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshBeaconHostObject")
	}
	static class AMeshBeaconHostObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMeshBeaconHostObject>();
	}
};
DUMPER7_ASSERTS_AMeshBeaconHostObject;

// Class MeshNetwork.MeshConnection
// 0x0000 (0x1B50 - 0x1B50)
class UMeshConnection final : public UIpConnection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshConnection")
	}
	static class UMeshConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshConnection>();
	}
};
DUMPER7_ASSERTS_UMeshConnection;

// Class MeshNetwork.MeshNetDriver
// 0x0008 (0x07C0 - 0x07B8)
class UMeshNetDriver final : public UIpNetDriver
{
public:
	uint8                                         Pad_7B8[0x8];                                      // 0x07B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshNetDriver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshNetDriver")
	}
	static class UMeshNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshNetDriver>();
	}
};
DUMPER7_ASSERTS_UMeshNetDriver;

// Class MeshNetwork.MeshNetworkComponent
// 0x0150 (0x0200 - 0x00B0)
class UMeshNetworkComponent : public UActorComponent
{
public:
	EMeshNetworkRelevancy                         MeshRelevancy;                                     // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, double>                     AggregationTimeouts;                               // 0x00B8(0x0050)(Edit, NativeAccessSpecifierPublic)
	TSet<class FName>                             NoAggregationFunctions;                            // 0x0108(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FName, struct FNoAggregationParameters> NoAggregationParameters;                      // 0x0158(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FString, struct FAggregatedFunction> AggregatedFunctions;                             // 0x01A8(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	EMeshNetworkNodeType GetMeshNetworkNodeType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshNetworkComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshNetworkComponent")
	}
	static class UMeshNetworkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshNetworkComponent>();
	}
};
DUMPER7_ASSERTS_UMeshNetworkComponent;

// Class MeshNetwork.MeshNetworkSubsystem
// 0x00D8 (0x0108 - 0x0030)
class UMeshNetworkSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(EMeshNetworkNodeType NodeType)> OnMeshNodeTypeChanged;             // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bConnected)> OnConnectedToRootChanged;                        // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EMeshNetworkNodeType NodeType)> OnGameServerNodeTypeChanged;       // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnMeshMetaDataUpdated;                             // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class APlayerController* Player, class FName Tag)> OnMeshPlayerRequested; // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x30];                                      // 0x0080(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	EMeshNetworkNodeType                          NodeType;                                          // 0x00B0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMeshNetworkNodeType                          GameServerNodeType;                                // 0x00B1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bConnectedToRoot;                                  // 0x00B2(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMetadataReceived;                                 // 0x00B3(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0x54];                                      // 0x00B4(0x0054)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisableMeshReplication(class AActor* Actor);
	void EnableMeshReplication(class AActor* Actor, TSubclassOf<class UMeshNetworkComponent> MeshComponentClass);
	void GetMetadata(struct FMeshMetaDataStruct& MetaData);
	bool GetMetaDataWithKey(class FName Key, struct FMeshMetaDataStruct& MetaData);
	void SetMetaData(const struct FMeshMetaDataStruct& MetaData);
	void SetMetaDataWithKey(class FName Key, const struct FMeshMetaDataStruct& MetaData);

	bool GetConnectedToRoot() const;
	EMeshNetworkNodeType GetGameServerNodeType() const;
	EMeshNetworkNodeType GetMeshNetworkNodeType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshNetworkSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshNetworkSubsystem")
	}
	static class UMeshNetworkSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshNetworkSubsystem>();
	}
};
DUMPER7_ASSERTS_UMeshNetworkSubsystem;

// Class MeshNetwork.MeshReplicationGraphConnection
// 0x0000 (0x0238 - 0x0238)
class UMeshReplicationGraphConnection final : public UNetReplicationGraphConnection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshReplicationGraphConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshReplicationGraphConnection")
	}
	static class UMeshReplicationGraphConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshReplicationGraphConnection>();
	}
};
DUMPER7_ASSERTS_UMeshReplicationGraphConnection;

// Class MeshNetwork.MeshReplicationGraph
// 0x0000 (0x04A0 - 0x04A0)
class UMeshReplicationGraph : public UReplicationGraph
{
public:
	class UReplicationGraphNode_ActorList*        AlwaysRelevantNode;                                // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshReplicationGraph")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshReplicationGraph")
	}
	static class UMeshReplicationGraph* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshReplicationGraph>();
	}
};
DUMPER7_ASSERTS_UMeshReplicationGraph;

SDK_NAMESPACE_END
