#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MIDIDevice

#include "Basic.hpp"

#include "MIDIDevice_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function MIDIDevice.MIDIDeviceManager.CreateMIDIDeviceController
// 0x0010 (0x0010 - 0x0000)
struct MIDIDeviceManager_CreateMIDIDeviceController final
{
public:
	int32                                         DeviceID;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MIDIBufferSize;                                    // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMIDIDeviceController*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceManager_CreateMIDIDeviceController;

// Function MIDIDevice.MIDIDeviceManager.CreateMIDIDeviceInputController
// 0x0010 (0x0010 - 0x0000)
struct MIDIDeviceManager_CreateMIDIDeviceInputController final
{
public:
	int32                                         DeviceID;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MIDIBufferSize;                                    // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMIDIDeviceInputController*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceManager_CreateMIDIDeviceInputController;

// Function MIDIDevice.MIDIDeviceManager.CreateMIDIDeviceOutputController
// 0x0010 (0x0010 - 0x0000)
struct MIDIDeviceManager_CreateMIDIDeviceOutputController final
{
public:
	int32                                         DeviceID;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMIDIDeviceOutputController*            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceManager_CreateMIDIDeviceOutputController;

// Function MIDIDevice.MIDIDeviceManager.FindAllMIDIDeviceInfo
// 0x0020 (0x0020 - 0x0000)
struct MIDIDeviceManager_FindAllMIDIDeviceInfo final
{
public:
	TArray<struct FMIDIDeviceInfo>                OutMIDIInputDevices;                               // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMIDIDeviceInfo>                OutMIDIOutputDevices;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceManager_FindAllMIDIDeviceInfo;

// Function MIDIDevice.MIDIDeviceManager.FindMIDIDevices
// 0x0010 (0x0010 - 0x0000)
struct MIDIDeviceManager_FindMIDIDevices final
{
public:
	TArray<struct FFoundMIDIDevice>               OutMIDIDevices;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceManager_FindMIDIDevices;

// Function MIDIDevice.MIDIDeviceManager.GetDefaultIMIDIInputDeviceID
// 0x0004 (0x0004 - 0x0000)
struct MIDIDeviceManager_GetDefaultIMIDIInputDeviceID final
{
public:
	int32                                         DeviceID;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceManager_GetDefaultIMIDIInputDeviceID;

// Function MIDIDevice.MIDIDeviceManager.GetDefaultIMIDIOutputDeviceID
// 0x0004 (0x0004 - 0x0000)
struct MIDIDeviceManager_GetDefaultIMIDIOutputDeviceID final
{
public:
	int32                                         DeviceID;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceManager_GetDefaultIMIDIOutputDeviceID;

// Function MIDIDevice.MIDIDeviceManager.GetMIDIInputDeviceIDByName
// 0x0018 (0x0018 - 0x0000)
struct MIDIDeviceManager_GetMIDIInputDeviceIDByName final
{
public:
	class FString                                 DeviceName;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeviceID;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MIDIDeviceManager_GetMIDIInputDeviceIDByName;

// Function MIDIDevice.MIDIDeviceManager.GetMIDIOutputDeviceIDByName
// 0x0018 (0x0018 - 0x0000)
struct MIDIDeviceManager_GetMIDIOutputDeviceIDByName final
{
public:
	class FString                                 DeviceName;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeviceID;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MIDIDeviceManager_GetMIDIOutputDeviceIDByName;

// Function MIDIDevice.MIDIDeviceOutputController.SendMIDIChannelAftertouch
// 0x0008 (0x0008 - 0x0000)
struct MIDIDeviceOutputController_SendMIDIChannelAftertouch final
{
public:
	int32                                         Channel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Amount;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceOutputController_SendMIDIChannelAftertouch;

// Function MIDIDevice.MIDIDeviceOutputController.SendMIDIControlChange
// 0x000C (0x000C - 0x0000)
struct MIDIDeviceOutputController_SendMIDIControlChange final
{
public:
	int32                                         Channel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceOutputController_SendMIDIControlChange;

// Function MIDIDevice.MIDIDeviceOutputController.SendMIDIEvent
// 0x0010 (0x0010 - 0x0000)
struct MIDIDeviceOutputController_SendMIDIEvent final
{
public:
	EMIDIEventType                                EventType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Channel;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         data1;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         data2;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceOutputController_SendMIDIEvent;

// Function MIDIDevice.MIDIDeviceOutputController.SendMIDINoteAftertouch
// 0x000C (0x000C - 0x0000)
struct MIDIDeviceOutputController_SendMIDINoteAftertouch final
{
public:
	int32                                         Channel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceOutputController_SendMIDINoteAftertouch;

// Function MIDIDevice.MIDIDeviceOutputController.SendMIDINoteOff
// 0x000C (0x000C - 0x0000)
struct MIDIDeviceOutputController_SendMIDINoteOff final
{
public:
	int32                                         Channel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Velocity;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceOutputController_SendMIDINoteOff;

// Function MIDIDevice.MIDIDeviceOutputController.SendMIDINoteOn
// 0x000C (0x000C - 0x0000)
struct MIDIDeviceOutputController_SendMIDINoteOn final
{
public:
	int32                                         Channel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Note;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Velocity;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceOutputController_SendMIDINoteOn;

// Function MIDIDevice.MIDIDeviceOutputController.SendMIDIPitchBend
// 0x0008 (0x0008 - 0x0000)
struct MIDIDeviceOutputController_SendMIDIPitchBend final
{
public:
	int32                                         Channel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Pitch;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceOutputController_SendMIDIPitchBend;

// Function MIDIDevice.MIDIDeviceOutputController.SendMIDIProgramChange
// 0x0008 (0x0008 - 0x0000)
struct MIDIDeviceOutputController_SendMIDIProgramChange final
{
public:
	int32                                         Channel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProgramNumber;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MIDIDeviceOutputController_SendMIDIProgramChange;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
