#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NetUI

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function NetUI.BadNetworkIndicator.GetPacketLoss
// 0x0004 (0x0004 - 0x0000)
struct BadNetworkIndicator_GetPacketLoss final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BadNetworkIndicator_GetPacketLoss;

// Function NetUI.BadNetworkIndicator.GetPing
// 0x0004 (0x0004 - 0x0000)
struct BadNetworkIndicator_GetPing final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BadNetworkIndicator_GetPing;

// Function NetUI.BadNetworkIndicator.HasBadPacketLoss
// 0x0001 (0x0001 - 0x0000)
struct BadNetworkIndicator_HasBadPacketLoss final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BadNetworkIndicator_HasBadPacketLoss;

// Function NetUI.BadNetworkIndicator.HasBadPing
// 0x0001 (0x0001 - 0x0000)
struct BadNetworkIndicator_HasBadPing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BadNetworkIndicator_HasBadPing;

// Function NetUI.BadNetworkIndicator.HasSeverePacketLoss
// 0x0001 (0x0001 - 0x0000)
struct BadNetworkIndicator_HasSeverePacketLoss final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BadNetworkIndicator_HasSeverePacketLoss;

// Function NetUI.BadNetworkIndicator.HasSeverePing
// 0x0001 (0x0001 - 0x0000)
struct BadNetworkIndicator_HasSeverePing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BadNetworkIndicator_HasSeverePing;

// Function NetUI.BadNetworkIndicator.ShouldDisplay
// 0x0001 (0x0001 - 0x0000)
struct BadNetworkIndicator_ShouldDisplay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BadNetworkIndicator_ShouldDisplay;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
