#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "MovieScene_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NiagaraCore_classes.hpp"


SDK_NAMESPACE_START

// Class Niagara.MovieSceneNiagaraTrack
// 0x0010 (0x0068 - 0x0058)
class UMovieSceneNiagaraTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0058(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraTrack")
	}
	static class UMovieSceneNiagaraTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraTrack;

// Class Niagara.MovieSceneNiagaraParameterTrack
// 0x0030 (0x0098 - 0x0068)
class UMovieSceneNiagaraParameterTrack : public UMovieSceneNiagaraTrack
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x0068(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraParameterTrack")
	}
	static class UMovieSceneNiagaraParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraParameterTrack;

// Class Niagara.MovieSceneNiagaraBoolParameterTrack
// 0x0000 (0x0098 - 0x0098)
class UMovieSceneNiagaraBoolParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraBoolParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraBoolParameterTrack")
	}
	static class UMovieSceneNiagaraBoolParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraBoolParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraBoolParameterTrack;

// Class Niagara.MovieSceneNiagaraColorParameterTrack
// 0x0000 (0x0098 - 0x0098)
class UMovieSceneNiagaraColorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraColorParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraColorParameterTrack")
	}
	static class UMovieSceneNiagaraColorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraColorParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraColorParameterTrack;

// Class Niagara.MovieSceneNiagaraFloatParameterTrack
// 0x0000 (0x0098 - 0x0098)
class UMovieSceneNiagaraFloatParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraFloatParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraFloatParameterTrack")
	}
	static class UMovieSceneNiagaraFloatParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraFloatParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraFloatParameterTrack;

// Class Niagara.MovieSceneNiagaraIntegerParameterTrack
// 0x0000 (0x0098 - 0x0098)
class UMovieSceneNiagaraIntegerParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraIntegerParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraIntegerParameterTrack")
	}
	static class UMovieSceneNiagaraIntegerParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraIntegerParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraIntegerParameterTrack;

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
// 0x0000 (0x00E0 - 0x00E0)
class UMovieSceneNiagaraSystemSpawnSection final : public UMovieSceneSection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraSystemSpawnSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraSystemSpawnSection")
	}
	static class UMovieSceneNiagaraSystemSpawnSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemSpawnSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraSystemSpawnSection;

// Class Niagara.MovieSceneNiagaraSystemTrack
// 0x0000 (0x0068 - 0x0068)
class UMovieSceneNiagaraSystemTrack final : public UMovieSceneNiagaraTrack
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraSystemTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraSystemTrack")
	}
	static class UMovieSceneNiagaraSystemTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraSystemTrack;

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
// 0x0008 (0x00A0 - 0x0098)
class UMovieSceneNiagaraVectorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	int32                                         ChannelsUsed;                                      // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneNiagaraVectorParameterTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneNiagaraVectorParameterTrack")
	}
	static class UMovieSceneNiagaraVectorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraVectorParameterTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneNiagaraVectorParameterTrack;

// Class Niagara.NiagaraActor
// 0x0008 (0x0338 - 0x0330)
class ANiagaraActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0330(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraActor")
	}
	static class ANiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActor>();
	}
};
DUMPER7_ASSERTS_ANiagaraActor;

// Class Niagara.NiagaraComponent
// 0x01D0 (0x0740 - 0x0570)
class UNiagaraComponent final : public UPrimitiveComponent
{
public:
	class UNiagaraSystem*                         Asset;                                             // 0x0570(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FNiagaraUserRedirectionParameterStore  OverrideParameters;                                // 0x0578(0x0138)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         bForceSolo : 1;                                    // 0x06B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_6B0_1 : 7;                                  // 0x06B0(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_6B1[0x27];                                     // 0x06B1(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAutoDestroy : 1;                                  // 0x06D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bRenderingEnabled : 1;                             // 0x06D8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bAutoManageAttachment : 1;                         // 0x06D8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnSystemFinished;                                  // 0x06E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         AutoAttachParent;                                  // 0x06F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AutoAttachSocketName;                              // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachLocationRule;                            // 0x0700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachRotationRule;                            // 0x0701(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachScaleRule;                               // 0x0702(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_703[0x3D];                                     // 0x0703(0x003D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AdvanceSimulation(int32 TickCount, float TickDeltaSeconds);
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds);
	TArray<struct FVector> GetNiagaraParticlePositions_DebugOnly(const class FString& InEmitterName);
	TArray<float> GetNiagaraParticleValues_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	TArray<struct FVector> GetNiagaraParticleValueVec3_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	void ReinitializeSystem();
	void ResetSystem();
	void SeekToDesiredAge(float InDesiredAge);
	void SetAgeUpdateMode(ENiagaraAgeUpdateMode InAgeUpdateMode);
	void SetAsset(class UNiagaraSystem* InAsset);
	void SetAutoAttachmentParameters(class USceneComponent* Parent, class FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule);
	void SetAutoDestroy(bool bInAutoDestroy);
	void SetCanRenderWhileSeeking(bool bInCanRenderWhileSeeking);
	void SetDesiredAge(float InDesiredAge);
	void SetForceSolo(bool bInForceSolo);
	void SetMaxSimTime(float InMaxTime);
	void SetNiagaraVariableActor(const class FString& InVariableName, class AActor* Actor);
	void SetNiagaraVariableBool(const class FString& InVariableName, bool InValue);
	void SetNiagaraVariableFloat(const class FString& InVariableName, float InValue);
	void SetNiagaraVariableInt(const class FString& InVariableName, int32 InValue);
	void SetNiagaraVariableLinearColor(const class FString& InVariableName, const struct FLinearColor& InValue);
	void SetNiagaraVariableQuat(const class FString& InVariableName, const struct FQuat& InValue);
	void SetNiagaraVariableVec2(const class FString& InVariableName, const struct FVector2D& InValue);
	void SetNiagaraVariableVec3(const class FString& InVariableName, const struct FVector& InValue);
	void SetNiagaraVariableVec4(const class FString& InVariableName, const struct FVector4& InValue);
	void SetPaused(bool bInPaused);
	void SetRenderingEnabled(bool bInRenderingEnabled);
	void SetSeekDelta(float InSeekDelta);

	ENiagaraAgeUpdateMode GetAgeUpdateMode() const;
	class UNiagaraSystem* GetAsset() const;
	float GetDesiredAge() const;
	bool GetForceSolo() const;
	float GetMaxSimTime() const;
	float GetSeekDelta() const;
	bool IsPaused() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraComponent")
	}
	static class UNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponent>();
	}
};
DUMPER7_ASSERTS_UNiagaraComponent;

// Class Niagara.NiagaraDataInterface
// 0x0000 (0x0028 - 0x0028)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterface")
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterface;

// Class Niagara.NiagaraDataInterfaceCurveBase
// 0x0040 (0x0068 - 0x0028)
class UNiagaraDataInterfaceCurveBase : public UNiagaraDataInterface
{
public:
	bool                                          GPUBufferDirty;                                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ShaderLUT;                                         // 0x0030(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         LUTMinTime;                                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTMaxTime;                                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LUTInvTimeRange;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUseLUT : 1;                                       // 0x004C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4D[0x1B];                                      // 0x004D(0x001B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceCurveBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceCurveBase")
	}
	static class UNiagaraDataInterfaceCurveBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurveBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceCurveBase;

// Class Niagara.NiagaraDataInterfaceCollisionQuery
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterfaceCollisionQuery final : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceCollisionQuery")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceCollisionQuery")
	}
	static class UNiagaraDataInterfaceCollisionQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCollisionQuery>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceCollisionQuery;

// Class Niagara.NiagaraDataInterfaceColorCurve
// 0x0200 (0x0268 - 0x0068)
class UNiagaraDataInterfaceColorCurve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             RedCurve;                                          // 0x0068(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             GreenCurve;                                        // 0x00E8(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             BlueCurve;                                         // 0x0168(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             AlphaCurve;                                        // 0x01E8(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceColorCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceColorCurve")
	}
	static class UNiagaraDataInterfaceColorCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceColorCurve>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceColorCurve;

// Class Niagara.NiagaraDataInterfaceCurlNoise
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterfaceCurlNoise final : public UNiagaraDataInterface
{
public:
	uint32                                        Seed;                                              // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0xC];                                       // 0x002C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceCurlNoise")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceCurlNoise")
	}
	static class UNiagaraDataInterfaceCurlNoise* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurlNoise>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceCurlNoise;

// Class Niagara.NiagaraDataInterfaceCurve
// 0x0080 (0x00E8 - 0x0068)
class UNiagaraDataInterfaceCurve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             Curve;                                             // 0x0068(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceCurve")
	}
	static class UNiagaraDataInterfaceCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCurve>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceCurve;

// Class Niagara.NiagaraDataInterfaceSimpleCounter
// 0x0000 (0x0028 - 0x0028)
class UNiagaraDataInterfaceSimpleCounter final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceSimpleCounter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceSimpleCounter")
	}
	static class UNiagaraDataInterfaceSimpleCounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceSimpleCounter>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceSimpleCounter;

// Class Niagara.NiagaraDataInterfaceSkeletalMesh
// 0x0058 (0x0080 - 0x0028)
class UNiagaraDataInterfaceSkeletalMesh final : public UNiagaraDataInterface
{
public:
	class USkeletalMesh*                          DefaultMesh;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Source;                                            // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENDISkeletalMesh_SkinningMode                 SkinningMode;                                      // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SamplingRegions;                                   // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         WholeMeshLOD;                                      // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SpecificBones;                                     // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           SpecificSockets;                                   // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseTriangleSampling;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseVertexSampling;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSkeletonSampling;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceSkeletalMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceSkeletalMesh")
	}
	static class UNiagaraDataInterfaceSkeletalMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceSkeletalMesh>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceSkeletalMesh;

// Class Niagara.NiagaraDataInterfaceSpline
// 0x0008 (0x0030 - 0x0028)
class UNiagaraDataInterfaceSpline final : public UNiagaraDataInterface
{
public:
	class AActor*                                 Source;                                            // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceSpline")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceSpline")
	}
	static class UNiagaraDataInterfaceSpline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceSpline>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceSpline;

// Class Niagara.NiagaraDataInterfaceStaticMesh
// 0x0028 (0x0050 - 0x0028)
class UNiagaraDataInterfaceStaticMesh final : public UNiagaraDataInterface
{
public:
	class UStaticMesh*                            DefaultMesh;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Source;                                            // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNDIStaticMeshSectionFilter            SectionFilter;                                     // 0x0038(0x0010)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceStaticMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceStaticMesh")
	}
	static class UNiagaraDataInterfaceStaticMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceStaticMesh>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceStaticMesh;

// Class Niagara.NiagaraDataInterfaceTexture
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterfaceTexture final : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Texture;                                           // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceTexture")
	}
	static class UNiagaraDataInterfaceTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceTexture>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceTexture;

// Class Niagara.NiagaraDataInterfaceVector2DCurve
// 0x0100 (0x0168 - 0x0068)
class UNiagaraDataInterfaceVector2DCurve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             XCurve;                                            // 0x0068(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             YCurve;                                            // 0x00E8(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceVector2DCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceVector2DCurve")
	}
	static class UNiagaraDataInterfaceVector2DCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceVector2DCurve>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceVector2DCurve;

// Class Niagara.NiagaraDataInterfaceVector4Curve
// 0x0200 (0x0268 - 0x0068)
class UNiagaraDataInterfaceVector4Curve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             XCurve;                                            // 0x0068(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             YCurve;                                            // 0x00E8(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             ZCurve;                                            // 0x0168(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             WCurve;                                            // 0x01E8(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceVector4Curve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceVector4Curve")
	}
	static class UNiagaraDataInterfaceVector4Curve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceVector4Curve>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceVector4Curve;

// Class Niagara.NiagaraDataInterfaceVectorCurve
// 0x0180 (0x01E8 - 0x0068)
class UNiagaraDataInterfaceVectorCurve final : public UNiagaraDataInterfaceCurveBase
{
public:
	struct FRichCurve                             XCurve;                                            // 0x0068(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             YCurve;                                            // 0x00E8(0x0080)(Edit, NativeAccessSpecifierPublic)
	struct FRichCurve                             ZCurve;                                            // 0x0168(0x0080)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceVectorCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceVectorCurve")
	}
	static class UNiagaraDataInterfaceVectorCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceVectorCurve>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceVectorCurve;

// Class Niagara.NiagaraDataInterfaceVectorField
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterfaceVectorField final : public UNiagaraDataInterface
{
public:
	class UVectorField*                           Field;                                             // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTileX;                                            // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTileY;                                            // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTileZ;                                            // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraDataInterfaceVectorField")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraDataInterfaceVectorField")
	}
	static class UNiagaraDataInterfaceVectorField* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceVectorField>();
	}
};
DUMPER7_ASSERTS_UNiagaraDataInterfaceVectorField;

// Class Niagara.NiagaraEditorDataBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraEditorDataBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraEditorDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraEditorDataBase")
	}
	static class UNiagaraEditorDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEditorDataBase>();
	}
};
DUMPER7_ASSERTS_UNiagaraEditorDataBase;

// Class Niagara.NiagaraEmitter
// 0x0128 (0x0150 - 0x0028)
class UNiagaraEmitter final : public UObject
{
public:
	bool                                          bLocalSpace;                                       // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeterminism;                                      // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomSeed;                                        // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraEmitterScriptProperties        UpdateScriptProps;                                 // 0x0030(0x0028)(NativeAccessSpecifierPublic)
	struct FNiagaraEmitterScriptProperties        SpawnScriptProps;                                  // 0x0058(0x0028)(NativeAccessSpecifierPublic)
	struct FNiagaraEmitterScriptProperties        EmitterSpawnScriptProps;                           // 0x0080(0x0028)(NativeAccessSpecifierPublic)
	struct FNiagaraEmitterScriptProperties        EmitterUpdateScriptProps;                          // 0x00A8(0x0028)(NativeAccessSpecifierPublic)
	ENiagaraSimTarget                             SimTarget;                                         // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   FixedBounds;                                       // 0x00D4(0x001C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         MinDetailLevel;                                    // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxDetailLevel;                                    // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bInterpolatedSpawning : 1;                         // 0x00F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFixedBounds : 1;                                  // 0x00F8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMinDetailLevel : 1;                            // 0x00F8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseMaxDetailLevel : 1;                            // 0x00F8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRequiresPersistentIDs : 1;                        // 0x00F8(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDeltaTimePerTick;                               // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bLimitDeltaTime : 1;                               // 0x0100(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UniqueEmitterName;                                 // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UNiagaraRendererProperties*>     RendererProperties;                                // 0x0118(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FNiagaraEventScriptProperties>  EventHandlerScriptProps;                           // 0x0128(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UNiagaraScript*                         GPUComputeScript;                                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                           SharedEventGeneratorIds;                           // 0x0140(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraEmitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraEmitter")
	}
	static class UNiagaraEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEmitter>();
	}
};
DUMPER7_ASSERTS_UNiagaraEmitter;

// Class Niagara.NiagaraEventReceiverEmitterAction
// 0x0000 (0x0028 - 0x0028)
class UNiagaraEventReceiverEmitterAction : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraEventReceiverEmitterAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraEventReceiverEmitterAction")
	}
	static class UNiagaraEventReceiverEmitterAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEventReceiverEmitterAction>();
	}
};
DUMPER7_ASSERTS_UNiagaraEventReceiverEmitterAction;

// Class Niagara.NiagaraEventReceiverEmitterAction_SpawnParticles
// 0x0008 (0x0030 - 0x0028)
class UNiagaraEventReceiverEmitterAction_SpawnParticles final : public UNiagaraEventReceiverEmitterAction
{
public:
	uint32                                        NumParticles;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraEventReceiverEmitterAction_SpawnParticles")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraEventReceiverEmitterAction_SpawnParticles")
	}
	static class UNiagaraEventReceiverEmitterAction_SpawnParticles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEventReceiverEmitterAction_SpawnParticles>();
	}
};
DUMPER7_ASSERTS_UNiagaraEventReceiverEmitterAction_SpawnParticles;

// Class Niagara.NiagaraFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNiagaraFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UNiagaraParameterCollectionInstance* GetNiagaraParameterCollection(class UObject* WorldContextObject, class UNiagaraParameterCollection* Collection);
	static class UNiagaraComponent* SpawnSystemAtLocation(class UObject* WorldContextObject, class UNiagaraSystem* SystemTemplate, const struct FVector& Location, const struct FRotator& Rotation, bool bAutoDestroy);
	static class UNiagaraComponent* SpawnSystemAttached(class UNiagaraSystem* SystemTemplate, class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation, EAttachLocation LocationType, bool bAutoDestroy);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraFunctionLibrary")
	}
	static class UNiagaraFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UNiagaraFunctionLibrary;

// Class Niagara.NiagaraRendererProperties
// 0x0008 (0x0030 - 0x0028)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	int32                                         SortOrderHint;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraRendererProperties")
	}
	static class UNiagaraRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraRendererProperties;

// Class Niagara.NiagaraLightRendererProperties
// 0x0378 (0x03A8 - 0x0030)
class UNiagaraLightRendererProperties final : public UNiagaraRendererProperties
{
public:
	uint8                                         bUseInverseSquaredFalloff : 1;                     // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectsTranslucency : 1;                          // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideRenderingEnabled : 1;                     // 0x0030(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RadiusScale;                                       // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ColorAdd;                                          // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       LightRenderingEnabledBinding;                      // 0x0048(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       LightExponentBinding;                              // 0x00D8(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       PositionBinding;                                   // 0x0168(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       ColorBinding;                                      // 0x01F8(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RadiusBinding;                                     // 0x0288(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       VolumetricScatteringBinding;                       // 0x0318(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraLightRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraLightRendererProperties")
	}
	static class UNiagaraLightRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraLightRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraLightRendererProperties;

// Class Niagara.NiagaraMeshRendererProperties
// 0x06F0 (0x0720 - 0x0030)
class UNiagaraMeshRendererProperties final : public UNiagaraRendererProperties
{
public:
	class UStaticMesh*                            ParticleMesh;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraSortMode                              SortMode;                                          // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverrideMaterials : 1;                            // 0x003C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSortOnlyWhenTranslucent : 1;                      // 0x003C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             OverrideMaterials;                                 // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ENiagaraMeshFacingMode                        FacingMode;                                        // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       PositionBinding;                                   // 0x0058(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       ColorBinding;                                      // 0x00E8(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       VelocityBinding;                                   // 0x0178(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       MeshOrientationBinding;                            // 0x0208(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       ScaleBinding;                                      // 0x0298(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterialBinding;                            // 0x0328(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial1Binding;                           // 0x03B8(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial2Binding;                           // 0x0448(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial3Binding;                           // 0x04D8(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       MaterialRandomBinding;                             // 0x0568(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       CustomSortingBinding;                              // 0x05F8(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       NormalizedAgeBinding;                              // 0x0688(0x0090)(Edit, NativeAccessSpecifierPublic)
	int32                                         SyncId;                                            // 0x0718(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraMeshRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraMeshRendererProperties")
	}
	static class UNiagaraMeshRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraMeshRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraMeshRendererProperties;

// Class Niagara.NiagaraParameterCollectionInstance
// 0x0100 (0x0128 - 0x0028)
class UNiagaraParameterCollectionInstance final : public UObject
{
public:
	class UNiagaraParameterCollection*            Collection;                                        // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariable>               OverridenParameters;                               // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNiagaraParameterStore                 ParameterStorage;                                  // 0x0040(0x00E8)(NativeAccessSpecifierPrivate)

public:
	bool GetBoolParameter(const class FString& InVariableName);
	struct FLinearColor GetColorParameter(const class FString& InVariableName);
	float GetFloatParameter(const class FString& InVariableName);
	int32 GetIntParameter(const class FString& InVariableName);
	struct FQuat GetQuatParameter(const class FString& InVariableName);
	struct FVector2D GetVector2DParameter(const class FString& InVariableName);
	struct FVector4 GetVector4Parameter(const class FString& InVariableName);
	struct FVector GetVectorParameter(const class FString& InVariableName);
	void SetBoolParameter(const class FString& InVariableName, bool InValue);
	void SetColorParameter(const class FString& InVariableName, const struct FLinearColor& InValue);
	void SetFloatParameter(const class FString& InVariableName, float InValue);
	void SetIntParameter(const class FString& InVariableName, int32 InValue);
	void SetQuatParameter(const class FString& InVariableName, const struct FQuat& InValue);
	void SetVector2DParameter(const class FString& InVariableName, const struct FVector2D& InValue);
	void SetVector4Parameter(const class FString& InVariableName, const struct FVector4& InValue);
	void SetVectorParameter(const class FString& InVariableName, const struct FVector& InValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraParameterCollectionInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraParameterCollectionInstance")
	}
	static class UNiagaraParameterCollectionInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraParameterCollectionInstance>();
	}
};
DUMPER7_ASSERTS_UNiagaraParameterCollectionInstance;

// Class Niagara.NiagaraParameterCollection
// 0x0030 (0x0058 - 0x0028)
class UNiagaraParameterCollection final : public UObject
{
public:
	class FName                                   Namespace;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FNiagaraVariable>               Parameters;                                        // 0x0030(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UNiagaraParameterCollectionInstance*    DefaultInstance;                                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  CompileId;                                         // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraParameterCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraParameterCollection")
	}
	static class UNiagaraParameterCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraParameterCollection>();
	}
};
DUMPER7_ASSERTS_UNiagaraParameterCollection;

// Class Niagara.NiagaraRibbonRendererProperties
// 0x0828 (0x0858 - 0x0030)
class UNiagaraRibbonRendererProperties final : public UNiagaraRendererProperties
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonFacingMode                      FacingMode;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UV0TilingDistance;                                 // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV0Scale;                                          // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV0Offset;                                         // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonAgeOffsetMode                   UV0AgeOffsetMode;                                  // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UV1TilingDistance;                                 // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV1Scale;                                          // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV1Offset;                                         // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonAgeOffsetMode                   UV1AgeOffsetMode;                                  // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonDrawDirection                   DrawDirection;                                     // 0x0069(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       PositionBinding;                                   // 0x0070(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       ColorBinding;                                      // 0x0100(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       VelocityBinding;                                   // 0x0190(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       NormalizedAgeBinding;                              // 0x0220(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonTwistBinding;                                // 0x02B0(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonWidthBinding;                                // 0x0340(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonFacingBinding;                               // 0x03D0(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonIdBinding;                                   // 0x0460(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonLinkOrderBinding;                            // 0x04F0(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       MaterialRandomBinding;                             // 0x0580(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterialBinding;                            // 0x0610(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial1Binding;                           // 0x06A0(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial2Binding;                           // 0x0730(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial3Binding;                           // 0x07C0(0x0090)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	int32                                         SyncId;                                            // 0x0850(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_854[0x4];                                      // 0x0854(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NiagaraRibbonRendererProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NiagaraRibbonRendererProperties")
	}
	static class UNiagaraRibbonRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRibbonRendererProperties>();
	}
};
DUMPER7_ASSERTS_UNiagaraRibbonRendererProperties;

// Class Niagara.NiagaraScript
// 0x06C0 (0x06E8 - 0x0028)
class UNiagaraScript final : public UObject
{
public:
	ENiagaraScriptUsage                           Usage;                                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UsageIndex;                                        // 0x002C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  UsageId;                                           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ModuleUsageBitmask;                                // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraParameterStore                 RapidIterationParameters;                          // 0x0048(0x00E8)(NativeAccessSpecifierPublic)
	ENiagaraNumericOutputTypeSelectionMode        NumericOutputTypeSelectionMode;                    // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
