#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitrogenRuntime

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "NitrogenRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class NitrogenRuntime.FortAthenaMutator_Nitrogen
// 0x0CE0 (0x1060 - 0x0380)
class AFortAthenaMutator_Nitrogen final : public AFortAthenaMutator_GameModeBase
{
public:
	uint8                                         Pad_380[0x88];                                     // 0x0380(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFareEventWidgetAvailable;                        // 0x0408(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PlayerSpecialActorTag;                             // 0x0418(0x0008)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PassengerSpecialActorTag;                          // 0x0420(0x0008)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VehicleSpecialActorTag;                            // 0x0428(0x0008)(Edit, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNitrogenPOICombinationMap>     NitrogenPOICombinationList;                        // 0x0430(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  MatchStartVehicleCleanupTags;                      // 0x0440(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MatchNearEndScoreRatio;                            // 0x0460(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UNitrogenPlayerComponent>   NitrogenPlayerComponentClass;                      // 0x0480(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FNitrogenPlayerGameplayAbilityOption> PlayerGameplayAbilityOptionList;             // 0x0488(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FNitrogenPickupItemToDropOnDeath> PickupItemsToDropOnDeath;                        // 0x0498(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  VehicleInteractionAbilityTags;                     // 0x04A8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DisallowedDamageTagsInSameVehicle;                 // 0x04C8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAllowRedeployGliders;                             // 0x04E8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StormShieldRadiusCalculationMultiplier;            // 0x0508(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         StormShieldRadiusOffset;                           // 0x0528(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FVector>     OverridePOILocationsByTagMap;                      // 0x0548(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FPrimaryAssetId                        NitrogenVehicleAssetId;                            // 0x0598(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         VehicleSpawnZOffset;                               // 0x05A8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class ANavArrow>                  NavArrowClass;                                     // 0x05C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumOfExtraVehiclesToMaintain;                      // 0x05D0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayEffect>            ExplosionDamageMultiplierGE;                       // 0x05F0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortSquadStartSearchParamData         SquadStartSearchParam;                             // 0x05F8(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RemoveLoadingScreenFailsafeTimerDuration;          // 0x0698(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortSquadStartSearchParamData         RespawnPointSearchParam;                           // 0x06B8(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         RespawnPointCooldownDuration;                      // 0x0758(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                VehicleOverlapCheckBoxExtent;                      // 0x0778(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_784[0x4];                                      // 0x0784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         MinTeleportHeightAboveGround;                      // 0x0788(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FText                                   TeleportingPlayersText;                            // 0x07A8(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class ANitrogenFare>              NitrogenFareClass;                                 // 0x07C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ANitrogenTraversePoint>     PickUpTraversePointClass;                          // 0x07C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ANitrogenTraversePoint>     DropOffTraversePointClass;                         // 0x07D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAllowSharedDropOffs;                              // 0x07D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumDistanceBetweenPickupPoints;                // 0x07F8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bUseFarePortraitTextures;                          // 0x0818(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumOfTopTeamsToShowOnMap;                          // 0x0838(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FNitrogenMapPlacementIcon>      PlacementBasedMapIcons;                            // 0x0858(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNitrogenMapIcon                       PickUpPointMapIcon;                                // 0x0868(0x00A8)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNitrogenMapIcon                       DropOffPointMapIcon;                               // 0x0910(0x00A8)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNitrogenMapIcon                       VehicleMapIcon;                                    // 0x09B8(0x00A8)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumOfFaresToShowOnCompass;                         // 0x0A60(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NumOfVehiclesToShowOnCompass;                      // 0x0A80(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortAthenaCompassIcon                 FareCompassIcon;                                   // 0x0AA0(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortAthenaCompassIcon                 DropOffPointCompassIcon;                           // 0x0B40(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FFortAthenaCompassIcon                 VehicleCompassIcon;                                // 0x0BE0(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     DropOffWidgetActorClass;                           // 0x0C80(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     NearbyVehicleWidgetActorClass;                     // 0x0C88(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFortSquadStartSearchParamData         PickupCashbagSearchParam;                          // 0x0C90(0x00A0)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         CashbagSelectedPercentage;                         // 0x0D30(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FNitrogenPickupCashbagData> CashbagDataMap;                     // 0x0D50(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PassengerDespawnDelay;                             // 0x0DA0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         PlayerSpecialActorRepInterval;                     // 0x0DC0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           NitrogenVehicleTag;                                // 0x0DE0(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DE8[0x4];                                      // 0x0DE8(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	ENitrogenGamePhase                            NitrogenGamePhase;                                 // 0x0DEC(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_DED[0x13];                                     // 0x0DED(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNitrogenTeamData>              SortedTeamDataByScore;                             // 0x0E00(0x0010)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortPlayerStateAthena*>         CacheLeadingReplicatedPlayerStates;                // 0x0E10(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UClass*                                 NitrogenVehicleClass;                              // 0x0E20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FNitrogenVehicle>               NitrogenVehiclesList;                              // 0x0E28(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AFortSquadStart*>                NitrogenSquadStarts;                               // 0x0E38(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E48[0x28];                                     // 0x0E48(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaMutator_SynchronizedTeleport* TeleportMutator;                                  // 0x0E70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_GameStartCountdown*  GameStartCountdownMutator;                         // 0x0E78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortAthenaMutator_InventoryOverride*   InventoryMutator;                                  // 0x0E80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E88[0x98];                                     // 0x0E88(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FNitrogenPOITraversePoints> UnassignedPickupPointsPerPOIMap;    // 0x0F20(0x0050)(NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FNitrogenPOITraversePoints> UnassignedPOIBasedDropoffPointsMap; // 0x0F70(0x0050)(NativeAccessSpecifierPrivate)
	TArray<class ANitrogenTraversePoint*>         UnassignedDistanceBasedDropoffPointsArray;         // 0x0FC0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FD0[0x10];                                     // 0x0FD0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ANavArrow*                              ClientNavArrow;                                    // 0x0FE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FE8[0x18];                                     // 0x0FE8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ANitrogenFare*>                  CurrentFares;                                      // 0x1000(0x0010)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ANitrogenFare*>                  CurrentActiveFares;                                // 0x1010(0x0010)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1020[0x40];                                    // 0x1020(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleGameStartCountdownEnd();
	void HandleGroupTeleportComplete();
	void HandlePlayerTeleportComplete(class AFortPlayerStateAthena* PlayerState);
	void OnNitrogenVehicleDestroyed(class AActor* VehicleDestroyed);
	void OnNitrogenVehicleDriverChanged(const class AFortPlayerControllerAthena* NewController, class AFortAthenaVehicle* Vehicle);
	void OnNitrogenVehiclePlayerExit(const class AFortPlayerControllerAthena* PlayerController, class AFortAthenaVehicle* Vehicle);
	void OnRep_CurrentFares();
	void OnRep_NitrogenGamePhase();
	void OnRep_SortedTeamDataByScore();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortAthenaMutator_Nitrogen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortAthenaMutator_Nitrogen")
	}
	static class AFortAthenaMutator_Nitrogen* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortAthenaMutator_Nitrogen>();
	}
};
DUMPER7_ASSERTS_AFortAthenaMutator_Nitrogen;

// Class NitrogenRuntime.FortCheatManager_Nitrogen
// 0x0000 (0x0038 - 0x0038)
class UFortCheatManager_Nitrogen final : public UFortCheatManager_Coupled
{
public:
	void CompleteNitrogenFare();
	void SetNitrogenNavDestinationToCurrentLocation();
	void SetNitrogenScore(const int32 Score, const uint8 ScoreReason);
	void SpawnNitrogenFare(const float PickUpDistance, const float DropOffDistance);
	void TeleportToNitrogenRespawnActor(const int32 Index_0);
	void TeleportToNitrogenSpawnActor(const int32 Index_0);
	void TeleportToSquadStartAtIndex(const int32 Index_0, const struct FFortSquadStartSearchParamData& SearchParam, class FString* TeleportReasonString);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortCheatManager_Nitrogen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortCheatManager_Nitrogen")
	}
	static class UFortCheatManager_Nitrogen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortCheatManager_Nitrogen>();
	}
};
DUMPER7_ASSERTS_UFortCheatManager_Nitrogen;

// Class NitrogenRuntime.NitrogenPickup
// 0x0018 (0x0630 - 0x0618)
class ANitrogenPickup final : public AFortGameModePickup
{
public:
	ENitrogenScoreReason                          ScoreReason;                                       // 0x0618(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       AutoPickupTouchComponent;                          // 0x0620(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENitrogenPickupType                           NitrogenPickupType;                                // 0x0628(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoAllowInteraction;                             // 0x0629(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         TeamHidden;                                        // 0x062A(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_62B[0x5];                                      // 0x062B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNitrogenPickupOverlapped(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnRep_TeamHidden();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NitrogenPickup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NitrogenPickup")
	}
	static class ANitrogenPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenPickup>();
	}
};
DUMPER7_ASSERTS_ANitrogenPickup;

// Class NitrogenRuntime.NitrogenFare
// 0x0910 (0x0B30 - 0x0220)
class ANitrogenFare final : public AActor
{
public:
	class AFortPlayerPawnAthena*                  Passenger;                                         // 0x0220(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANitrogenTraversePoint*                 PickUpPoint;                                       // 0x0228(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ANitrogenTraversePoint*                 DropOffPoint;                                      // 0x0230(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DropOffPointLocation;                              // 0x0238(0x000C)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNitrogenBonusStats                    BonusStats;                                        // 0x0248(0x0738)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         FastDeliveryKmph;                                  // 0x0980(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A0[0x30];                                     // 0x09A0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortAthenaAISpawnerData>   PassengerSpawnerDataClass;                         // 0x09D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UNitrogenPassengerPawnComponent> NitrogenPassengerPawnComponentClass;          // 0x09D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PassengerSeatIndex;                                // 0x09E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9E4[0x4];                                      // 0x09E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PassengerSpawnRetryRate;                           // 0x09E8(0x0020)(Edit, DisableEditOnInstance, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	int32                                         RewardValue;                                       // 0x0A08(0x0004)(Edit, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FastDeliveryTime;                                  // 0x0A0C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FastDeliveryBonusPoints;                           // 0x0A10(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A14[0x4];                                      // 0x0A14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         FastDeliveryMargin;                                // 0x0A18(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	int32                                         DistanceThresholdIndex;                            // 0x0A38(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A3C[0x4];                                      // 0x0A3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PickupTime;                                        // 0x0A40(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DropoffTime;                                       // 0x0A60(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EFareGenerationMethod                         FareGenerationMethod;                              // 0x0A80(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A81[0x7];                                      // 0x0A81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bDisablePassengerCollision;                        // 0x0A88(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortPlayerStateAthena*                 AssignedPlayerState;                               // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortPlayerStateAthena*                 PreviousPlayerState;                               // 0x0AB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPassengerPickedUp;                                // 0x0AB8(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AB9[0x1F];                                     // 0x0AB9(0x001F)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class AFortPlayerStateAthena*, struct FTimerHandle> PickupTimerHandles;                     // 0x0AD8(0x0050)(NativeAccessSpecifierPrivate)
	struct FTimerHandle                           DropOffTimerHandle;                                // 0x0B28(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DropOffPointExited(class AAthenaTraversePoint* TraversePoint, class AFortPlayerStateAthena* PlayerState);
	void DropOffPointOverlapped(class AAthenaTraversePoint* TraversePoint, class AFortPlayerStateAthena* PlayerState);
	void OnRep_PassengerPickedUp();
	void OnVehicleDestroyed(class AFortDagwoodVehicle* DestroyedVehicle);
	void OnVehicleDriverChanged(const class AFortPlayerControllerAthena* NewDriver, class AFortAthenaVehicle* Vehicle);
	void OnVehicleEndPlay(class AActor* DestroyedVehicle, EEndPlayReason EndPlayReason);
	void PickUpPointExited(class AAthenaTraversePoint* TraversePoint, class AFortPlayerStateAthena* PlayerState);
	void PickUpPointOverlapped(class AAthenaTraversePoint* TraversePoint, class AFortPlayerStateAthena* PlayerState);

	const int32 GetRewardValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NitrogenFare")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NitrogenFare")
	}
	static class ANitrogenFare* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenFare>();
	}
};
DUMPER7_ASSERTS_ANitrogenFare;

// Class NitrogenRuntime.NitrogenFareDataRepActor
// 0x0028 (0x0248 - 0x0220)
class ANitrogenFareDataRepActor final : public AActor
{
public:
	struct FNitrogenFareRepData                   FareRepData;                                       // 0x0220(0x0018)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_238[0x10];                                     // 0x0238(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_FareRepData();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NitrogenFareDataRepActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NitrogenFareDataRepActor")
	}
	static class ANitrogenFareDataRepActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenFareDataRepActor>();
	}
};
DUMPER7_ASSERTS_ANitrogenFareDataRepActor;

// Class NitrogenRuntime.NitrogenFareValueIndicator
// 0x0028 (0x0248 - 0x0220)
class ANitrogenFareValueIndicator final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedMeshComp;                                 // 0x0220(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FNitrogenFareValueMeshTransformInfo> FareValueMeshTransformInfo;                   // 0x0228(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         IndicatorValue;                                    // 0x0238(0x0001)(Edit, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldActorRotateOnTickToFacePlayerCamera;        // 0x0239(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   LocalPlayerCameraManager;                          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnFareIndicatorValueChanged(const uint8 NewIndicatorValue);
	void OnRep_IndicatorValue();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NitrogenFareValueIndicator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NitrogenFareValueIndicator")
	}
	static class ANitrogenFareValueIndicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenFareValueIndicator>();
	}
};
DUMPER7_ASSERTS_ANitrogenFareValueIndicator;

// Class NitrogenRuntime.NitrogenNavArrow
// 0x0338 (0x0560 - 0x0228)
class alignas(0x10) ANitrogenNavArrow final : public ANavArrow
{
public:
	struct FVector                                LocationRelativeToOwner;                           // 0x0228(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFollowCamera;                                     // 0x0234(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationRelativeToCamera;                          // 0x0238(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         PitchRelativeToCamera;                             // 0x0248(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ArrowSizeRelativeToScreen;                         // 0x0268(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         ArrowPlacementHeightRelativeToScreen;              // 0x0288(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FVector                                LocationRelativeToDestination;                     // 0x02A8(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bThrowingEnabled;                                  // 0x02B4(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ApproachRadius;                                    // 0x02B8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DepartRadius;                                      // 0x02D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UCurveFloat*                            ThrowTranslationCurve;                             // 0x02F8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            ThrowRotationCurve;                                // 0x0300(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PrimaryColorParameterName;                         // 0x0308(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveLinearColor*                      ArrowColorCurve;                                   // 0x0310(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ColorFadeOuterRadius;                              // 0x0318(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ColorFadeInnerRadius;                              // 0x031C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   PulseParameterName;                                // 0x0320(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            PulseParameterCurve;                               // 0x0328(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            PulseSpeedCurve;                                   // 0x0330(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PulseAccelOuterRadius;                             // 0x0338(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PulseAccelInnerRadius;                             // 0x033C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            ScaleCurve;                                        // 0x0340(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   ArrowComponent;                                    // 0x0348(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_350[0x208];                                    // 0x0350(0x0208)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ArrowDynamicMaterial;                              // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void RecallArrowToOwner();
	void ThrowArrowToDestination();
	void UpdatePrimaryColorForDistance();
	void UpdatePulseSpeedForDistance();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NitrogenNavArrow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NitrogenNavArrow")
	}
	static class ANitrogenNavArrow* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenNavArrow>();
	}
};
DUMPER7_ASSERTS_ANitrogenNavArrow;

// Class NitrogenRuntime.NitrogenPassengerPawnComponent
// 0x00E8 (0x0198 - 0x00B0)
class UNitrogenPassengerPawnComponent final : public UFortPawnComponent
{
public:
	TMap<ENitrogenPassengerState, class UAnimationAsset*> MalePassengerStateAnimationMap;            // 0x00B0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ENitrogenPassengerState, class UAnimationAsset*> FemalePassengerStateAnimationMap;          // 0x0100(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bDestroyFareValueIndicatorOnDisable;               // 0x0150(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class ANitrogenFareValueIndicator> FareValueIndicatorClass;                          // 0x0170(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                FareValueIndicatorOffset;                          // 0x0178(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANitrogenFareValueIndicator*            FareValueIndicator;                                // 0x0188(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENitrogenPassengerState                       PassengerState;                                    // 0x0190(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientHandleFinishedCharacterCustomization(class AFortPlayerPawn* PlayerPawn);
	void ClientPlayDeathEffects();
	void OnRep_FareValueIndicator();
	void OnRep_PassengerState();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NitrogenPassengerPawnComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NitrogenPassengerPawnComponent")
	}
	static class UNitrogenPassengerPawnComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitrogenPassengerPawnComponent>();
	}
};
DUMPER7_ASSERTS_UNitrogenPassengerPawnComponent;

// Class NitrogenRuntime.NitrogenPlayerComponent
// 0x0250 (0x0300 - 0x00B0)
class UNitrogenPlayerComponent final : public UFortControllerComponent
{
public:
	class AActor*                                 CurrentFareWidgetActor;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnClientBeginFare;                                 // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool FareCompleted)> OnClientEndFare;                              // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x40];                                      // 0x00D8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AFortAthenaMutator_Nitrogen> CachedMutator;                                 // 0x0118(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         NearbyVehicleUpdateRate;                           // 0x0120(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumVehicleAirTimeBeforeStatTracking;           // 0x0140(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class USoundMix*                              LoadingScreenSoundSuppressionSoundMix;             // 0x0160(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bAllowHighlightNearbyLeadingPlayers;               // 0x0168(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bHighlightLeadingPlayers_UseStencilHighlight;      // 0x0188(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_UpdateRate;                // 0x01A8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_MinTeamScore;              // 0x01C8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_MaxDistance;               // 0x01E8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_HighlightDuration;         // 0x0208(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bHighlightLeadingPlayers_IndicatorClampToScreen;   // 0x0228(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HighlightLeadingPlayers_IndicatorZOffset;          // 0x0248(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EIndicatorStateImage                          OverrideIndicatorImage;                            // 0x0268(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   HighlightLeadingPlayers_StencilName;               // 0x026C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_274[0xC];                                      // 0x0274(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawnAthena*>          CurrentlyHighlightedLeadingPlayers;                // 0x0280(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNitrogenFareInteractionData           FareInteractionData;                               // 0x0290(0x0018)(Net, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABuildingActor*>                 DestroyedBuildingActors;                           // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0[0x10];                                     // 0x02C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 NearestVehicleWidget;                              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AFortSquadStart*                        CurrentRespawnSquadStart;                          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x10];                                     // 0x02E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class ANitrogenFare*                          PreviousFare;                                      // 0x02F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ANitrogenFareDataRepActor*              FareDataRepActor;                                  // 0x02F8(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ClientHandleLoadingScreenStateChanged(class AFortPlayerControllerAthena* PlayerController, bool bEnableLoadScreen, const class FText& HUDReasonText);
	void HandleVehicleDestroyedBuildingActor(class AFortAthenaVehicle* Vehicle, class ABuildingActor* BuildingActor);
	void OnEnterVehicleDriver();
	void OnEnterVehiclePassenger();
	void OnExitVehicle();
	void OnGameStarted();
	void OnNitrogenGamePhaseChanged(ENitrogenGamePhase NewGamePhase);
	void OnRep_CachedMutator();
	void OnRep_FareDataRepActor();
	void OnRep_FareInteractionData();

	float GetDistanceFromClosestPassenger() const;
	float GetDistanceFromDropOff() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NitrogenPlayerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NitrogenPlayerComponent")
	}
	static class UNitrogenPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitrogenPlayerComponent>();
	}
};
DUMPER7_ASSERTS_UNitrogenPlayerComponent;

// Class NitrogenRuntime.NitrogenTraversePoint
// 0x0050 (0x0970 - 0x0920)
class ANitrogenTraversePoint final : public AAthenaLTMTraversePoint
{
public:
	ENitrogenTraversePointMode                    CurrentNitrogenTraversePointMode;                  // 0x0920(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_921[0x7];                                      // 0x0921(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneRoot;                                         // 0x0928(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystemComponent*               FareRadiusParticleSystemComponent;                 // 0x0930(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCapsuleComponent*                      TriggerCapsule;                                    // 0x0938(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HideActorDelay;                                    // 0x0940(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_944[0x2C];                                     // 0x0944(0x002C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnClientInteracted(bool bOwnedByClient);
	void OnClientVisibiltyUpdated(bool bNewHidden);
	void OnEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NitrogenTraversePoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NitrogenTraversePoint")
	}
	static class ANitrogenTraversePoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANitrogenTraversePoint>();
	}
};
DUMPER7_ASSERTS_ANitrogenTraversePoint;

// Class NitrogenRuntime.NitrogenVehicleComponent
// 0x01A0 (0x0250 - 0x00B0)
class UNitrogenVehicleComponent final : public UActorComponent
{
public:
	class UTimelineComponent*                     TimelineBoostFX;                                   // 0x00B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            JetFlamesHeightCurve;                              // 0x00B8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            JetSparksCountsCurve;                              // 0x00C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimelineBoostFXLength;                             // 0x00C8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         BoostVFXSystem;                                    // 0x00D0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BoostAttachSocketName;                             // 0x00D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               BoostAttachRotation;                               // 0x00E0(0x000C)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNitrogenVehicleBoostFXVariable        JetFlameRandomMin;                                 // 0x00F0(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNitrogenVehicleBoostFXVariable        JetFlameLocationOffsetZ;                           // 0x0108(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FNitrogenVehicleBoostFXVariable        JetFlameLocationOffsetX;                           // 0x0120(0x0018)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FString                                 JetFlameHeightParamName;                           // 0x0138(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         JetFlameMinHeight;                                 // 0x0148(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         JetFlameMaxHeight;                                 // 0x014C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 JetSparksCountsParamName;                          // 0x0150(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      SpawnedBoostParticleSystem;                        // 0x0160(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         MinimumBumpBonusStatVelocityKmh;                   // 0x0168(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         CooldownBetweenBumps;                              // 0x0188(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         bCleanupUnreachableVehicleInWater;                 // 0x0190(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                         VehicleWaterDepthCheckTickDelay;                   // 0x01B0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         VehicleWaterDepthForCleanup;                       // 0x01B8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         bCleanupUnreachableVehiclesSilently;               // 0x01D8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         VehicleInWaterCleanupDelay;                        // 0x01F8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class AFortAthenaVehicle*                     OwningVehicle;                                     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortWaterBodyActor*>            WaterBodies;                                       // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_238[0x18];                                     // 0x0238(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleVehicleOnHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void SetBoostFXActive(const bool bActive);
	void TimelineBoostFXUpdate_JetFlamesHeight(float Value);
	void TimelineBoostFXUpdate_JetSparksCounts(float Value);

	bool IsVehicleUnderCleanupWaterDepth() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NitrogenVehicleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NitrogenVehicleComponent")
	}
	static class UNitrogenVehicleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNitrogenVehicleComponent>();
	}
};
DUMPER7_ASSERTS_UNitrogenVehicleComponent;

SDK_NAMESPACE_END
