#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NitrogenRuntime

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum NitrogenRuntime.ENitrogenGamePhase
// NumValues: 0x0005
enum class ENitrogenGamePhase : uint8
{
	None                                     = 0,
	TeleportingPlayers                       = 1,
	Active                                   = 2,
	Finish                                   = 3,
	MAX                                      = 4,
};

// Enum NitrogenRuntime.ENitrogenScoreReason
// NumValues: 0x000C
enum class ENitrogenScoreReason : uint8
{
	None                                     = 0,
	WorldPickup                              = 1,
	EnemyDeathPickup                         = 2,
	FareReward_Base                          = 3,
	FareReward_Bonus_FastDelivery            = 4,
	FareReward_Bonus_Bulldozer               = 5,
	FareReward_Bonus_StuntDriving            = 6,
	FareReward_Bonus_SafeDriver              = 7,
	FareReward_Bonus_BumperCars              = 8,
	FareReward_Bonus_OffRoad                 = 9,
	FareReward_Bonus_SpeedDemon              = 10,
	ENitrogenScoreReason_MAX                 = 11,
};

// Enum NitrogenRuntime.EFareGenerationMethod
// NumValues: 0x0003
enum class EFareGenerationMethod : uint8
{
	Distance                                 = 0,
	POI                                      = 1,
	MAX                                      = 2,
};

// Enum NitrogenRuntime.ENitrogenBonusCondition
// NumValues: 0x0003
enum class ENitrogenBonusCondition : uint8
{
	MustMeetGoal                             = 0,
	MustNotExceedThreshold                   = 1,
	ENitrogenBonusCondition_MAX              = 2,
};

// Enum NitrogenRuntime.ENitrogenPassengerState
// NumValues: 0x0005
enum class ENitrogenPassengerState : uint8
{
	None                                     = 0,
	HailingCab                               = 1,
	VehicleSeated                            = 2,
	DroppedOff                               = 3,
	ENitrogenPassengerState_MAX              = 4,
};

// Enum NitrogenRuntime.ENitrogenPickupType
// NumValues: 0x0003
enum class ENitrogenPickupType : uint8
{
	None                                     = 0,
	Cashbag                                  = 1,
	MAX                                      = 2,
};

// Enum NitrogenRuntime.ENitrogenTraversePointMode
// NumValues: 0x0003
enum class ENitrogenTraversePointMode : uint8
{
	Pickup                                   = 0,
	DropOff                                  = 1,
	ENitrogenTraversePointMode_MAX           = 2,
};

// ScriptStruct NitrogenRuntime.NitrogenMapIcon
// 0x00A8 (0x00A8 - 0x0000)
struct FNitrogenMapIcon final
{
public:
	struct FSlateBrush                            MapIcon;                                           // 0x0000(0x0088)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MapIconScale;                                      // 0x0088(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenMapIcon;

// ScriptStruct NitrogenRuntime.NitrogenMapPlacementIcon
// 0x0170 (0x0170 - 0x0000)
struct FNitrogenMapPlacementIcon final
{
public:
	struct FNitrogenMapIcon                       PlacementMapIcon;                                  // 0x0000(0x00A8)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FNitrogenMapIcon                       SquadmatePlacementMapIcon;                         // 0x00A8(0x00A8)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinimumTeamScoreToShow;                            // 0x0150(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenMapPlacementIcon;

// ScriptStruct NitrogenRuntime.NitrogenVehicle
// 0x0010 (0x0010 - 0x0000)
struct FNitrogenVehicle final
{
public:
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayerlessStartServerTime;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNitrogenVehicle;

// ScriptStruct NitrogenRuntime.NitrogenPOITraversePoints
// 0x0010 (0x0010 - 0x0000)
struct FNitrogenPOITraversePoints final
{
public:
	TArray<class ANitrogenTraversePoint*>         TraversePoints;                                    // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenPOITraversePoints;

// ScriptStruct NitrogenRuntime.NitrogenPickupItemToDropOnDeath
// 0x00C0 (0x00C0 - 0x0000)
struct FNitrogenPickupItemToDropOnDeath final
{
public:
	struct FScalableFloat                         bEnabled;                                          // 0x0000(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UFortWorldItemDefinition*               PickupItemDef;                                     // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ANitrogenPickup>            PickupClass;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         TimeBeforeDespawn;                                 // 0x0030(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bHidePickupForDyingPlayerTeam;                     // 0x0050(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FScalableFloat>                 PlacementBasedPickupDropCount;                     // 0x0070(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         TossDistance;                                      // 0x0080(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinTeamScoreRequiredToDrop;                        // 0x00A0(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenPickupItemToDropOnDeath;

// ScriptStruct NitrogenRuntime.NitrogenPickupCashbagData
// 0x0078 (0x0078 - 0x0000)
struct FNitrogenPickupCashbagData final
{
public:
	EFortRarity                                   ItemRarity;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         SelectionWeight;                                   // 0x0008(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinValue;                                          // 0x0028(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxValue;                                          // 0x0048(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSubclassOf<class ANitrogenPickup>            PickupClass;                                       // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWorldItemDefinition*               PickupItemDef;                                     // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenPickupCashbagData;

// ScriptStruct NitrogenRuntime.NitrogenPOIConnectionData
// 0x0068 (0x0068 - 0x0000)
struct FNitrogenPOIConnectionData final
{
public:
	struct FGameplayTag                           POITag;                                            // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         FareValue;                                         // 0x0008(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bEnabled;                                          // 0x0028(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MaxFares;                                          // 0x0048(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenPOIConnectionData;

// ScriptStruct NitrogenRuntime.NitrogenFareDistanceValue
// 0x0060 (0x0060 - 0x0000)
struct FNitrogenFareDistanceValue final
{
public:
	struct FScalableFloat                         FareValue;                                         // 0x0000(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         MinimumDistance;                                   // 0x0020(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FScalableFloat                         NumFares;                                          // 0x0040(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenFareDistanceValue;

// ScriptStruct NitrogenRuntime.NitrogenPOICombinationData
// 0x0020 (0x0020 - 0x0000)
struct FNitrogenPOICombinationData final
{
public:
	TArray<struct FNitrogenPOIConnectionData>     POIConnections;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNitrogenFareDistanceValue>     FareDistanceValues;                                // 0x0010(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenPOICombinationData;

// ScriptStruct NitrogenRuntime.NitrogenPOICombinationMap
// 0x0078 (0x0078 - 0x0000)
struct FNitrogenPOICombinationMap final
{
public:
	struct FScalableFloat                         bEnabled;                                          // 0x0000(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FNitrogenPOICombinationData> POICombinationMap;                 // 0x0020(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	EFareGenerationMethod                         FareGenerationMethod;                              // 0x0070(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNitrogenPOICombinationMap;

// ScriptStruct NitrogenRuntime.NitrogenTeamData
// 0x0098 (0x0098 - 0x0000)
struct FNitrogenTeamData final
{
public:
	uint32                                        UpdateId;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENitrogenScoreReason                          ScoreReason;                                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           ScoringPlayer;                                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         TeamId;                                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TeamPlacement;                                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TeamScore;                                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTeamInfoAthena*                    TeamInfoAthena;                                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<ENitrogenScoreReason, int32>             ReasonToScoreMap;                                  // 0x0028(0x0050)(RepSkip, NativeAccessSpecifierPublic)
	TArray<class AFortPlayerStateAthena*>         TeamPlayerStates;                                  // 0x0078(0x0010)(ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         TeamPlayerAccountIds;                              // 0x0088(0x0010)(ZeroConstructor, RepSkip, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenTeamData;

// ScriptStruct NitrogenRuntime.NitrogenRespawnData
// 0x0010 (0x0010 - 0x0000)
struct FNitrogenRespawnData final
{
public:
	class AFortSquadStart*                        RespawnSquadStart;                                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNitrogenRespawnData;

// ScriptStruct NitrogenRuntime.NitrogenSpawnData
// 0x0018 (0x0018 - 0x0000)
struct FNitrogenSpawnData final
{
public:
	uint8                                         SquadId;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AdditionalViewpointLocation;                       // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortSquadStart*                        SpawnSquadStart;                                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenSpawnData;

// ScriptStruct NitrogenRuntime.NitrogenPlayerGameplayAbilityOption
// 0x0028 (0x0028 - 0x0000)
struct FNitrogenPlayerGameplayAbilityOption final
{
public:
	TSubclassOf<class UFortGameplayAbility>       GameplayAbility;                                   // 0x0000(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         bEnabled;                                          // 0x0008(0x0020)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenPlayerGameplayAbilityOption;

// ScriptStruct NitrogenRuntime.NitrogenBonusStat
// 0x0130 (0x0130 - 0x0000)
struct FNitrogenBonusStat final
{
public:
	struct FScalableFloat                         bEnabled;                                          // 0x0000(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         AwardPoints;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENitrogenBonusCondition                       AwardCondition;                                    // 0x0024(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENitrogenScoreReason                          ScoreReason;                                       // 0x0025(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Name;                                              // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   MustMeetGoal_BonusCompleteDescription;             // 0x0058(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   MustNotExceedThreshold_BonusFailureDescription;    // 0x0070(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortAthenaAISpawnerDataComponent_CosmeticLoadout> CosmeticLoadoutData;        // 0x0088(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             TipEmojiTexture;                                   // 0x0090(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             FarePortraitTexture;                               // 0x0098(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FScalableFloat                         Goal;                                              // 0x00A0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         Threshold;                                         // 0x00C0(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<class AFortPlayerState*, float>          Values;                                            // 0x00E0(0x0050)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FNitrogenBonusStat;

// ScriptStruct NitrogenRuntime.NitrogenBonusStats
// 0x0738 (0x0738 - 0x0000)
struct FNitrogenBonusStats final
{
public:
	struct FNitrogenBonusStat                     VehicleBumpIntoVehicles;                           // 0x0000(0x0130)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FNitrogenBonusStat                     VehicleBuildingDestruction;                        // 0x0130(0x0130)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FNitrogenBonusStat                     VehicleDamageTaken;                                // 0x0260(0x0130)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FNitrogenBonusStat                     VehicleAirTime;                                    // 0x0390(0x0130)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FNitrogenBonusStat                     VehicleBoostDrivingTime;                           // 0x04C0(0x0130)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FNitrogenBonusStat                     VehicleOffRoadTime;                                // 0x05F0(0x0130)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_720[0x18];                                     // 0x0720(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNitrogenBonusStats;

// ScriptStruct NitrogenRuntime.NitrogenFareInteractionData
// 0x0018 (0x0018 - 0x0000)
struct FNitrogenFareInteractionData final
{
public:
	class ANitrogenFare*                          Fare;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TotalTime;                                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentBonusIndex;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDropoff;                                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNitrogenFareInteractionData;

// ScriptStruct NitrogenRuntime.NitrogenFareValueMeshTransformInfo
// 0x0010 (0x0010 - 0x0000)
struct FNitrogenFareValueMeshTransformInfo final
{
public:
	TArray<struct FTransform>                     MeshTransforms;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenFareValueMeshTransformInfo;

// ScriptStruct NitrogenRuntime.NitrogenFareRepData
// 0x0018 (0x0018 - 0x0000)
struct FNitrogenFareRepData final
{
public:
	class ANitrogenFare*                          CurrentFare;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AwardedPoints;                                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentBonusIndex;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentBonusValue;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNitrogenFareRepData;

// ScriptStruct NitrogenRuntime.NitrogenVehicleBoostFXVariable
// 0x0018 (0x0018 - 0x0000)
struct FNitrogenVehicleBoostFXVariable final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNitrogenVehicleBoostFXVariable;

SDK_NAMESPACE_END
