#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkTierWidgetNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass PerkTierWidgetNew.PerkTierWidgetNew_C
// 0x0030 (0x02B8 - 0x0288)
class UPerkTierWidgetNew_C final : public UFortPerkTierWidget_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           PerkList;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkWidget_C*                          PerkWidget;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkWidget_C*                          PerkWidget_0;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkWidget_C*                          PerkWidget_1;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIncludeName;                                      // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bFirstPerkDone;                                    // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIncludeDescription;                               // 0x02B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bUseLegacyFixedSizeIcons;                          // 0x02B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortBrushSize                                IconSize;                                          // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PerkTierWidgetNew(int32 EntryPoint);
	void OnGeneratePerk(const struct FFortUIPerk& Perk, class UFortPerkWidget_NUI* PerkWidget_0);
	void Construct();
	void InitializeSettings(bool bIncludeName_0, bool bIncludeDescription_0, bool bUseLegacyFixedSizeIcons_0, EFortBrushSize IconSize_0, const struct FFortUIPerkTier& FortPerkTier_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PerkTierWidgetNew_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PerkTierWidgetNew_C")
	}
	static class UPerkTierWidgetNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkTierWidgetNew_C>();
	}
};
DUMPER7_ASSERTS_UPerkTierWidgetNew_C;

SDK_NAMESPACE_END
