#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanelContentsAnswerRatingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass PlayerSurveyPanelContentsAnswerRatingWidget.PlayerSurveyPanelContentsAnswerRatingWidget_C
// 0x0060 (0x03E0 - 0x0380)
class UPlayerSurveyPanelContentsAnswerRatingWidget_C final : public UFortSurveyNumericalChoiceWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    CommonActionWidget_0;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_1;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_2;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_3;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_4;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RatingButton_5;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCommonButton*>                  RatingButtons;                                     // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class FText                                   Text_Subtitle;                                     // 0x03C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_PlayerSurveyPanelContentsAnswerRatingWidget(int32 EntryPoint);
	void HandleQuestionChanged();
	void HandleCommitCurrentAnswer();
	void HandleButtonFocused(int32 ButtonIndex);
	void HandleButtonClicked(int32 ButtonIndex);
	void OnInitialized();
	class UWidget* GetDefaultFocusedWidgetPostDummy(EUINavigation Navigation_0);

	class UWidget* GetDefaultFocusedWidget() const;
	class FText GetSubtitleText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlayerSurveyPanelContentsAnswerRatingWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerSurveyPanelContentsAnswerRatingWidget_C")
	}
	static class UPlayerSurveyPanelContentsAnswerRatingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelContentsAnswerRatingWidget_C>();
	}
};
DUMPER7_ASSERTS_UPlayerSurveyPanelContentsAnswerRatingWidget_C;

SDK_NAMESPACE_END
