#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayspaceSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "PlayspaceSystem_structs.hpp"
#include "ModularGameplay_classes.hpp"


SDK_NAMESPACE_START

// Class PlayspaceSystem.PlayspaceComponent
// 0x0000 (0x00B0 - 0x00B0)
class UPlayspaceComponent : public UGameFrameworkComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceComponent")
	}
	static class UPlayspaceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent>();
	}
};
DUMPER7_ASSERTS_UPlayspaceComponent;

// Class PlayspaceSystem.PlayspacePlayerController
// 0x0028 (0x0598 - 0x0570)
class APlayspacePlayerController : public APlayerController
{
public:
	uint8                                         Pad_570[0x18];                                     // 0x0570(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUsePlayerSpawningComponent;                       // 0x0588(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UPlayspaceControllerComponent_PlayerSpawning> ControllerSpawningComponent;     // 0x0590(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspacePlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspacePlayerController")
	}
	static class APlayspacePlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayspacePlayerController>();
	}
};
DUMPER7_ASSERTS_APlayspacePlayerController;

// Class PlayspaceSystem.PlayspaceGameMode
// 0x0018 (0x0320 - 0x0308)
class APlayspaceGameMode : public AGameMode
{
public:
	uint8                                         Pad_308[0x18];                                     // 0x0308(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceGameMode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceGameMode")
	}
	static class APlayspaceGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayspaceGameMode>();
	}
};
DUMPER7_ASSERTS_APlayspaceGameMode;

// Class PlayspaceSystem.GameplayVolume
// 0x0080 (0x02A0 - 0x0220)
class AGameplayVolume : public AActor
{
public:
	TSoftClassPtr<class UClass>                   PlayspaceClassTemplate;                            // 0x0220(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class APlayspace>                 PlayspaceClass;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayspace*                             Playspace;                                         // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  VolumeTags;                                        // 0x0258(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	class UOverlapComponent*                      BoundsComponent;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_280[0x20];                                     // 0x0280(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void UpdateSize(const struct FVector& NewScale);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameplayVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameplayVolume")
	}
	static class AGameplayVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGameplayVolume>();
	}
};
DUMPER7_ASSERTS_AGameplayVolume;

// Class PlayspaceSystem.OverlapComponent
// 0x0020 (0x04F0 - 0x04D0)
class UOverlapComponent : public UStaticMeshComponent
{
public:
	uint8                                         Pad_4D0[0x20];                                     // 0x04D0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeginActorOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnEndActorOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OverlapComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OverlapComponent")
	}
	static class UOverlapComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOverlapComponent>();
	}
};
DUMPER7_ASSERTS_UOverlapComponent;

// Class PlayspaceSystem.Playspace
// 0x0270 (0x0490 - 0x0220)
class APlayspace : public AInfo
{
public:
	TMulticastInlineDelegate<void(const struct FPlayspaceUser& AddedUser)> NotifyPlayspaceUserAdded; // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_230[0x18];                                     // 0x0230(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FPlayspaceUser& RemovedUser)> NotifyPlayspaceUserRemoved; // 0x0248(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x18];                                     // 0x0258(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class APlayspace* Playspace)> NotifyPlayspaceInitialized;          // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_280[0x18];                                     // 0x0280(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              NotifyStartMatch;                                  // 0x0298(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x18];                                     // 0x02A8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              NotifyEndMatch;                                    // 0x02C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D0[0x18];                                     // 0x02D0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x02E8(0x0020)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           RequestedPlayspaceParentTag;                       // 0x0308(0x0008)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class APlayspace>>         ChildPlayspaceClasses;                             // 0x0310(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPlayspaceUserList                     PlayspaceUsers;                                    // 0x0320(0x0128)(Net, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<class APlayspace*>                     ChildPlayspaces;                                   // 0x0448(0x0010)(Net, ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FUniqueNetIdRepl>               PendingUsers;                                      // 0x0458(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoStartMatchOnServerStart;                      // 0x0468(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayspaceManagerComponent*             PlayspaceManagerCached;                            // 0x0470(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AGameplayVolume*                        BoundGameplayVolume;                               // 0x0478(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInitialized;                                    // 0x0480(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_481[0x1];                                      // 0x0481(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bMatchHasEnded;                                    // 0x0482(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_483[0x1];                                      // 0x0483(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MatchStartTime;                                    // 0x0484(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_bIsInitialized();
	void OnRep_bMatchHasEnded();
	void OnRep_MatchStartTime();
	void OnRep_PlayspaceUsers();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Playspace")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Playspace")
	}
	static class APlayspace* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayspace>();
	}
};
DUMPER7_ASSERTS_APlayspace;

// Class PlayspaceSystem.PlayspaceComponent_PlayerSpawning
// 0x0010 (0x00C0 - 0x00B0)
class UPlayspaceComponent_PlayerSpawning : public UPlayspaceComponent
{
public:
	bool                                          bQueueUserForSpawnWhenAdded;                       // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnDelayMin;                                     // 0x00B4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpawnDelayMax;                                     // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceComponent_PlayerSpawning")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceComponent_PlayerSpawning")
	}
	static class UPlayspaceComponent_PlayerSpawning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceComponent_PlayerSpawning>();
	}
};
DUMPER7_ASSERTS_UPlayspaceComponent_PlayerSpawning;

// Class PlayspaceSystem.PlayspaceControllerComponent_PlayerSpawning
// 0x0048 (0x00F8 - 0x00B0)
class UPlayspaceControllerComponent_PlayerSpawning final : public UControllerComponent
{
public:
	TMulticastInlineDelegate<void(class APlayerController* Controller, const struct FReplicatedSpawnInfo& SpawnInfo)> OnPlayerQueuedToSpawn; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class ACameraActor*                           SpawnCameraActor;                                  // 0x00C0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bClientReadyForSpawning;                           // 0x00C8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReplicatedSpawnInfo                   ReplicatedSpawnInfo;                               // 0x00CC(0x002C)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)

public:
	void OnRep_ReplicatedSpawnInfo();
	void ServerMarkReadyForSpawning();

	const struct FReplicatedSpawnInfo GetSpawnInfo() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceControllerComponent_PlayerSpawning")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceControllerComponent_PlayerSpawning")
	}
	static class UPlayspaceControllerComponent_PlayerSpawning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceControllerComponent_PlayerSpawning>();
	}
};
DUMPER7_ASSERTS_UPlayspaceControllerComponent_PlayerSpawning;

// Class PlayspaceSystem.PlayspaceGameState
// 0x0020 (0x02B0 - 0x0290)
class APlayspaceGameState : public AGameState
{
public:
	TSubclassOf<class APlayspace>                 RootPlayspaceClass;                                // 0x0290(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsePlayspaceSystem;                               // 0x0298(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUsePlayerSpawningComponent;                       // 0x0299(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayspaceManagerComponent*             PlayspaceManagerComponentCached;                   // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayspaceGameStateComponent_PlayerSpawningManager* PlayerSpawningManagerCached;           // 0x02A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceGameState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceGameState")
	}
	static class APlayspaceGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayspaceGameState>();
	}
};
DUMPER7_ASSERTS_APlayspaceGameState;

// Class PlayspaceSystem.PlayspaceGameStateComponent
// 0x0000 (0x00B0 - 0x00B0)
class UPlayspaceGameStateComponent : public UGameStateComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceGameStateComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceGameStateComponent")
	}
	static class UPlayspaceGameStateComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceGameStateComponent>();
	}
};
DUMPER7_ASSERTS_UPlayspaceGameStateComponent;

// Class PlayspaceSystem.PlayspaceGameStateComponent_PlayerSpawningManager
// 0x0040 (0x00F0 - 0x00B0)
class UPlayspaceGameStateComponent_PlayerSpawningManager final : public UPlayspaceGameStateComponent
{
public:
	uint8                                         Pad_B0[0x30];                                      // 0x00B0(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPlayspaceSpawningInfo>         SpawningUsersArray;                                // 0x00E0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceGameStateComponent_PlayerSpawningManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceGameStateComponent_PlayerSpawningManager")
	}
	static class UPlayspaceGameStateComponent_PlayerSpawningManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceGameStateComponent_PlayerSpawningManager>();
	}
};
DUMPER7_ASSERTS_UPlayspaceGameStateComponent_PlayerSpawningManager;

// Class PlayspaceSystem.PlayspaceLibrary
// 0x0000 (0x0028 - 0x0028)
class UPlayspaceLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceLibrary")
	}
	static class UPlayspaceLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceLibrary>();
	}
};
DUMPER7_ASSERTS_UPlayspaceLibrary;

// Class PlayspaceSystem.PlayspaceManagerComponent
// 0x0030 (0x00E0 - 0x00B0)
class UPlayspaceManagerComponent final : public UGameStateComponent
{
public:
	class APlayspace*                             RootPlayspace;                                     // 0x00B0(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActorOverlapEvent>             UnhandledEnterEvents;                              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FActorOverlapEvent>             UnhandledExitEvents;                               // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnPlayerBeginOverlapGameplayVolume(class APlayerState* PlayerState, class AGameplayVolume* Volume);
	void OnPlayerEndOverlapGameplayVolume(class APlayerState* PlayerState, class AGameplayVolume* Volume);
	bool ProcessOverlapEvents(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspaceManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspaceManagerComponent")
	}
	static class UPlayspaceManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspaceManagerComponent>();
	}
};
DUMPER7_ASSERTS_UPlayspaceManagerComponent;

// Class PlayspaceSystem.PlayspacePlayerManagerComponent
// 0x00C0 (0x0170 - 0x00B0)
class UPlayspacePlayerManagerComponent final : public UPlayspaceComponent
{
public:
	TArray<TSubclassOf<class UControllerComponent>> ControllerComponents;                            // 0x00B0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UPlayerStateComponent>> PlayerStateComponents;                          // 0x00C0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D0[0xA0];                                      // 0x00D0(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlayspacePlayerManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayspacePlayerManagerComponent")
	}
	static class UPlayspacePlayerManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayspacePlayerManagerComponent>();
	}
};
DUMPER7_ASSERTS_UPlayspacePlayerManagerComponent;

SDK_NAMESPACE_END
