#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSurveyPanelContentsAnswerFreeFormTextWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass PlayerSurveyPanelContentsAnswerFreeFormTextWidget.PlayerSurveyPanelContentsAnswerFreeFormTextWidget_C
// 0x0048 (0x0380 - 0x0338)
class UPlayerSurveyPanelContentsAnswerFreeFormTextWidget_C final : public UFortPlayerSurveyFreeFormTextAnswerWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMultiLineEditableTextBox*              EntryTextBox;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LimitsTextBlock;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIgnoreAnswerChange;                               // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_Subtitle;                                     // 0x0358(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 LimitsStyle_Normal;                                // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LimitsStyle_Overflow;                              // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerSurveyPanelContentsAnswerFreeFormTextWidget(int32 EntryPoint);
	void HandleQuestionChanged();
	void HandleCommitCurrentAnswer();
	void HandleAnswerChanged(const struct FFortPlayerSurveyAnswerContainerChangeEventInfo& EventInfo);
	void BndEvt__EntryTextBox_K2Node_ComponentBoundEvent_1_OnMultiLineEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__EntryTextBox_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void Construct();
	void UpdateEntryText();
	void UpdateHintText();
	void HandlePlayerEnterAnswer(const class FString& AnswerString);
	void UpdateLimitsText();

	class UWidget* GetDefaultFocusedWidget() const;
	class FText GetSubtitleText() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PlayerSurveyPanelContentsAnswerFreeFormTextWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlayerSurveyPanelContentsAnswerFreeFormTextWidget_C")
	}
	static class UPlayerSurveyPanelContentsAnswerFreeFormTextWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelContentsAnswerFreeFormTextWidget_C>();
	}
};
DUMPER7_ASSERTS_UPlayerSurveyPanelContentsAnswerFreeFormTextWidget_C;

SDK_NAMESPACE_END
