#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_Bucket_Old

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Prj_ThrownConsumable_classes.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass Prj_Athena_Bucket_Old.Prj_Athena_Bucket_Old_C
// 0x0038 (0x0950 - 0x0918)
class APrj_Athena_Bucket_Old_C : public AB_Prj_ThrownConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_Athena_Bucket_Old_C;            // 0x0918(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               ItemToSpawn;                                       // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TurnOffFX;                                         // 0x0928(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             HitMarkerSound;                                    // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ThrowIndicator_SoundRef;                           // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldSpawnItem;                                   // 0x0940(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_941[0x7];                                      // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Splash_Sound_0;                                    // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_Athena_Bucket_Old(int32 EntryPoint);
	void Held_Water_Impact();
	void ReceiveBeginPlay();
	void PlayHitSound();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_2_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnRep_TurnOffFX();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Prj_Athena_Bucket_Old_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Prj_Athena_Bucket_Old_C")
	}
	static class APrj_Athena_Bucket_Old_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_Bucket_Old_C>();
	}
};
DUMPER7_ASSERTS_APrj_Athena_Bucket_Old_C;

SDK_NAMESPACE_END
