#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProgressWidget

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass ProgressWidget.ProgressWidget_C
// 0x0030 (0x0268 - 0x0238)
class UProgressWidget_C final : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                       Description;                                       // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainIcon;                                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ProgressSizeBox;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ProgressVBox;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetTitle(const class FText& Title_0);
	void SetDescription(const class FText& Description_0);
	void SetIcon(const struct FSlateBrush& IconBrush);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ProgressWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProgressWidget_C")
	}
	static class UProgressWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProgressWidget_C>();
	}
};
DUMPER7_ASSERTS_UProgressWidget_C;

SDK_NAMESPACE_END
