#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestMapLayoutNode

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function QuestMapLayoutNode.QuestMapLayoutNode_C.ExecuteUbergraph_QuestMapLayoutNode
// 0x0008 (0x0008 - 0x0000)
struct QuestMapLayoutNode_C_ExecuteUbergraph_QuestMapLayoutNode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_QuestMapLayoutNode_C_ExecuteUbergraph_QuestMapLayoutNode;

// Function QuestMapLayoutNode.QuestMapLayoutNode_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct QuestMapLayoutNode_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_QuestMapLayoutNode_C_PreConstruct;

// Function QuestMapLayoutNode.QuestMapLayoutNode_C.SetQuestTileProps
// 0x0010 (0x0010 - 0x0000)
struct QuestMapLayoutNode_C_SetQuestTileProps final
{
public:
	class UQuestMiniTile2_C*                      K2Node_DynamicCast_AsQuest_Mini_Tile_2;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_QuestMapLayoutNode_C_SetQuestTileProps;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
