#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RefundTicket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass RefundTicket.RefundTicket_C
// 0x0028 (0x0258 - 0x0230)
class URefundTicket_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pending;                                           // 0x0238(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Consumed;                                          // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Consume;                                           // 0x0248(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImageTicket;                                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RefundTicket(int32 EntryPoint);
	void PendingEvent(bool isPending);
	void ConsumeEvent();
	void IsConsumed();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RefundTicket_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RefundTicket_C")
	}
	static class URefundTicket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URefundTicket_C>();
	}
};
DUMPER7_ASSERTS_URefundTicket_C;

SDK_NAMESPACE_END
