#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReportablePlayerReasonEntry

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ReportablePlayerReasonEntry.ReportablePlayerReasonEntry_C.ExecuteUbergraph_ReportablePlayerReasonEntry
// 0x0008 (0x0008 - 0x0000)
struct ReportablePlayerReasonEntry_C_ExecuteUbergraph_ReportablePlayerReasonEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bAnimateOnSelect;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ReportablePlayerReasonEntry_C_ExecuteUbergraph_ReportablePlayerReasonEntry;

// Function ReportablePlayerReasonEntry.ReportablePlayerReasonEntry_C.SetSelectionState
// 0x0002 (0x0002 - 0x0000)
struct ReportablePlayerReasonEntry_C_SetSelectionState final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAnimateOnSelect;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_ReportablePlayerReasonEntry_C_SetSelectionState;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
