#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RewardInfoSimpleMediumWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass RewardInfoSimpleMediumWidget.RewardInfoSimpleMediumWidget_C
// 0x0028 (0x0B78 - 0x0B50)
class URewardInfoSimpleMediumWidget_C final : public UFortRewardInfoButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       ItemCount;                                         // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                LeftSpacer;                                        // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                RightSpacer;                                       // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_RewardInfoSimpleMediumWidget(int32 EntryPoint);
	void HandleDifferentItemOrQuantitySetBP();
	void GetDisplayName(class FText* DisplayName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RewardInfoSimpleMediumWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RewardInfoSimpleMediumWidget_C")
	}
	static class URewardInfoSimpleMediumWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URewardInfoSimpleMediumWidget_C>();
	}
};
DUMPER7_ASSERTS_URewardInfoSimpleMediumWidget_C;

SDK_NAMESPACE_END
