#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RootLayout_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass RootLayout_Athena.RootLayout_Athena_C
// 0x0050 (0x03E8 - 0x0398)
class URootLayout_Athena_C final : public UFortRootViewportLayout_Athena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UConfirmationWindow_C*                  ConfirmationWindow;                                // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 ControllerDisconnectedModal;                       // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bClosingErrorDialog;                               // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   QuitTitle;                                         // 0x03B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   QuitMessage;                                       // 0x03D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	bool IsConsole();
	void DialogResult_0099D78247C40A9775C753A2024EA419(EFortDialogResult Result, class FName ResultName);
	void Construct();
	void OnGameWindowCloseButtonClicked();
	void OnModalQueueEmptied_1();
	void ExecuteUbergraph_RootLayout_Athena(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RootLayout_Athena_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RootLayout_Athena_C")
	}
	static class URootLayout_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URootLayout_Athena_C>();
	}
};
DUMPER7_ASSERTS_URootLayout_Athena_C;

SDK_NAMESPACE_END
