#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scoreboard_Team_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass Scoreboard_Team_Widget.Scoreboard_Team_Widget_C
// 0x0048 (0x0278 - 0x0230)
class UScoreboard_Team_Widget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           RightSideBox;                                      // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TeamBox;                                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TeamScore;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             VictoryRoyale;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsWinningTeam;                                    // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bShowVictoryScore;                                 // 0x0259(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   VictoryScore;                                      // 0x0260(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_Scoreboard_Team_Widget(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetVictoryColors(class UMaterialInstanceDynamic* DynamicMaterialInstance);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Scoreboard_Team_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Scoreboard_Team_Widget_C")
	}
	static class UScoreboard_Team_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoreboard_Team_Widget_C>();
	}
};
DUMPER7_ASSERTS_UScoreboard_Team_Widget_C;

SDK_NAMESPACE_END
