#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidecarSys

#include "Basic.hpp"

#include "SidecarSys_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class SidecarSys.SidecarDss
// 0x00A0 (0x00C8 - 0x0028)
class USidecarDss final : public UObject
{
public:
	TMap<class FString, struct FSidecarFileInfo>  FileInfoMap;                                       // 0x0028(0x0050)(NativeAccessSpecifierPrivate)
	class FString                                 DssDownloadUrl;                                    // 0x0078(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DssCheckoutUrl;                                    // 0x0088(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DssUploadUrl;                                      // 0x0098(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DssRestoreUrl;                                     // 0x00A8(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DssCheckinUrl;                                     // 0x00B8(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SidecarDss")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SidecarDss")
	}
	static class USidecarDss* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidecarDss>();
	}
};
DUMPER7_ASSERTS_USidecarDss;

// Class SidecarSys.SidecarInventorySys
// 0x00B8 (0x00E0 - 0x0028)
class alignas(0x10) USidecarInventorySys final : public UObject
{
public:
	class FString                                 InventoryDownloadUrl;                              // 0x0028(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 InventoryLockUrl;                                  // 0x0038(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ItemUpdateUrl;                                     // 0x0048(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 ReleaseAllUrl;                                     // 0x0058(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x78];                                      // 0x0068(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SidecarInventorySys")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SidecarInventorySys")
	}
	static class USidecarInventorySys* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidecarInventorySys>();
	}
};
DUMPER7_ASSERTS_USidecarInventorySys;

// Class SidecarSys.SidecarSys
// 0x0030 (0x0058 - 0x0028)
class USidecarSys final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USidecarDss*                            SidecarDss;                                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USidecarInventorySys*                   SidecarInventory;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SidecarSys")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SidecarSys")
	}
	static class USidecarSys* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidecarSys>();
	}
};
DUMPER7_ASSERTS_USidecarSys;

SDK_NAMESPACE_END
