#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SidekickInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass SidekickInstance.SidekickInstance_C
// 0x0028 (0x0310 - 0x02E8)
class USidekickInstance_C final : public USidekickDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_VideoSuspended;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Widget_VideoDisabled;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Widget_VideoSuspended;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CachedDisabled;                                    // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CachedPaused;                                      // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SidekickInstance(int32 EntryPoint);
	void OnVideoPaused(bool bPaused);
	void OnVideoDisabled(bool bDisabled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SidekickInstance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SidekickInstance_C")
	}
	static class USidekickInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USidekickInstance_C>();
	}
};
DUMPER7_ASSERTS_USidekickInstance_C;

SDK_NAMESPACE_END
