#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleMTXDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function SimpleMTXDisplay.SimpleMTXDisplay_C.OnUpdateAvailableMTX
// 0x0004 (0x0004 - 0x0000)
struct SimpleMTXDisplay_C_OnUpdateAvailableMTX final
{
public:
	int32                                         AvailableBalance;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SimpleMTXDisplay_C_OnUpdateAvailableMTX;

// Function SimpleMTXDisplay.SimpleMTXDisplay_C.ExecuteUbergraph_SimpleMTXDisplay
// 0x0070 (0x0070 - 0x0000)
struct SimpleMTXDisplay_C_ExecuteUbergraph_SimpleMTXDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AvailableBalance;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
};
DUMPER7_ASSERTS_SimpleMTXDisplay_C_ExecuteUbergraph_SimpleMTXDisplay;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
