#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_InfantryRifle_Dyn_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass SK_InfantryRifle_Dyn_AnimBP.SK_InfantryRifle_Dyn_AnimBP_C
// 0x03E8 (0x0650 - 0x0268)
class USK_InfantryRifle_Dyn_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_0FA95B8A4791B0B87C1E30982CD3A00F; // 0x0278(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_7F73F31E49181732275D2C9C7A189F22; // 0x0298(0x0018)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_ABC261A741753443EA4E2888A6100072; // 0x02B0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_330CB41D48BD49CAED30F3A8B0076C91; // 0x02D0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_C527464948342EDD9910C59EFA1250ED; // 0x02F0(0x0310)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3D21E5FD4F92A0ABF3C298B01952D813; // 0x0600(0x0048)()

public:
	void ExecuteUbergraph_SK_InfantryRifle_Dyn_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SK_InfantryRifle_Dyn_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SK_InfantryRifle_Dyn_AnimBP_C")
	}
	static class USK_InfantryRifle_Dyn_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_InfantryRifle_Dyn_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_USK_InfantryRifle_Dyn_AnimBP_C;

SDK_NAMESPACE_END
