#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmartObjectsModule

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "SmartObjectsModule_structs.hpp"


SDK_NAMESPACE_START

// Class SmartObjectsModule.SmartObjectComponent
// 0x0058 (0x0108 - 0x00B0)
class USmartObjectComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USmartObjectConfig>      Config;                                            // 0x00B8(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSmartObjectID                         RegisteredID;                                      // 0x00E0(0x0004)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        ExecutionPriorityOverride;                         // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IGameplayTagAssetInterface> GameplayTagAssetInterfaceImplementation;      // 0x00E8(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         bRichSmartObjectOwner : 1;                         // 0x00F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bRichSmartObjectComponent : 1;                     // 0x00F8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_F9[0xF];                                       // 0x00F9(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmartObjectComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmartObjectComponent")
	}
	static class USmartObjectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectComponent>();
	}
};
DUMPER7_ASSERTS_USmartObjectComponent;

// Class SmartObjectsModule.AITask_UseSmartObject
// 0x0040 (0x00B0 - 0x0070)
class UAITask_UseSmartObject final : public UAITask
{
public:
	class USmartObjectComponent*                  SOComponent;                                       // 0x0070(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnFinished;                                        // 0x0078(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UAITask_MoveTo*                         MoveToTask;                                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAITask_UseSmartObject* UseSmartObject(class AAIController* Controller, class AActor* SmartObjectActor, class USmartObjectComponent* SmartObjectComponent, bool bLockAILogic);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITask_UseSmartObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITask_UseSmartObject")
	}
	static class UAITask_UseSmartObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITask_UseSmartObject>();
	}
};
DUMPER7_ASSERTS_UAITask_UseSmartObject;

// Class SmartObjectsModule.BTTask_FindAndUseSmartObject
// 0x0050 (0x00C0 - 0x0070)
class UBTTask_FindAndUseSmartObject final : public UBTTaskNode
{
public:
	struct FGameplayTagQuery                      ActivityRequirements;                              // 0x0070(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         Radius;                                            // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_FindAndUseSmartObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_FindAndUseSmartObject")
	}
	static class UBTTask_FindAndUseSmartObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_FindAndUseSmartObject>();
	}
};
DUMPER7_ASSERTS_UBTTask_FindAndUseSmartObject;

// Class SmartObjectsModule.BTTask_UseSmartObject
// 0x0000 (0x0098 - 0x0098)
class UBTTask_UseSmartObject final : public UBTTask_BlackboardBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTTask_UseSmartObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_UseSmartObject")
	}
	static class UBTTask_UseSmartObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_UseSmartObject>();
	}
};
DUMPER7_ASSERTS_UBTTask_UseSmartObject;

// Class SmartObjectsModule.GenericSmartObject
// 0x0020 (0x0240 - 0x0220)
class AGenericSmartObject final : public AActor
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectComponent*                  SOComponent;                                       // 0x0228(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         ReferenceActors;                                   // 0x0230(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GenericSmartObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GenericSmartObject")
	}
	static class AGenericSmartObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGenericSmartObject>();
	}
};
DUMPER7_ASSERTS_AGenericSmartObject;

// Class SmartObjectsModule.RichSmartObjectInterface
// 0x0000 (0x0000 - 0x0000)
class IRichSmartObjectInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RichSmartObjectInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RichSmartObjectInterface")
	}
	static class IRichSmartObjectInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IRichSmartObjectInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IRichSmartObjectInterface;

// Class SmartObjectsModule.SmartObjectBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class USmartObjectBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool K2_AddLooseGameplayTags(class AActor* Actor, const struct FGameplayTagContainer& GameplayTags);
	static bool K2_RemoveLooseGameplayTags(class AActor* Actor, const struct FGameplayTagContainer& GameplayTags);
	static bool K2_SetSmartObjectEnabled(class AActor* SmartObject, const bool bEnabled);
	static bool K2_UseSmartObject(class AActor* Avatar, class AActor* SmartObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmartObjectBlueprintFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmartObjectBlueprintFunctionLibrary")
	}
	static class USmartObjectBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectBlueprintFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_USmartObjectBlueprintFunctionLibrary;

// Class SmartObjectsModule.SmartObjectConfig
// 0x0038 (0x0068 - 0x0030)
class USmartObjectConfig final : public UDataAsset
{
public:
	TArray<struct FSmartObjectUseConfig>          Uses;                                              // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DescriptionTags;                                   // 0x0040(0x0020)(Protected, NativeAccessSpecifierProtected)
	uint32                                        MaxConcurrentUsers;                                // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmartObjectConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmartObjectConfig")
	}
	static class USmartObjectConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectConfig>();
	}
};
DUMPER7_ASSERTS_USmartObjectConfig;

// Class SmartObjectsModule.SmartObjectManager
// 0x0108 (0x0130 - 0x0028)
class alignas(0x10) USmartObjectManager final : public UObject
{
public:
	TMap<struct FSmartObjectID, struct FSmartObjectRuntime> RuntimeSmartObjects;                     // 0x0028(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0xA8];                                      // 0x0078(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         BitPad_120_0 : 1;                                  // 0x0120(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bCreateIfMissing : 1;                              // 0x0120(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultUnusedSmartObjectLifespan;                  // 0x0124(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmartObjectManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmartObjectManager")
	}
	static class USmartObjectManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectManager>();
	}
};
DUMPER7_ASSERTS_USmartObjectManager;

// Class SmartObjectsModule.SmartObjectRenderingComponent
// 0x0010 (0x0450 - 0x0440)
class USmartObjectRenderingComponent final : public UPrimitiveComponent
{
public:
	ESOReferenceDrawingMode                       ReferenceDrawingMode;                              // 0x0440(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_441[0xF];                                      // 0x0441(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmartObjectRenderingComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmartObjectRenderingComponent")
	}
	static class USmartObjectRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectRenderingComponent>();
	}
};
DUMPER7_ASSERTS_USmartObjectRenderingComponent;

SDK_NAMESPACE_END
