#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Party_classes.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SocialUMG_structs.hpp"


SDK_NAMESPACE_START

// Class SocialUMG.SocialChatChannelTab
// 0x0010 (0x0B40 - 0x0B30)
class USocialChatChannelTab : public UCommonButton
{
public:
	class USocialChatChannel*                     ChatChannel;                                       // 0x0B30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       CommonText_ChannelName;                            // 0x0B38(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatChannelTab")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatChannelTab")
	}
	static class USocialChatChannelTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChannelTab>();
	}
};
DUMPER7_ASSERTS_USocialChatChannelTab;

// Class SocialUMG.SocialChatContainer
// 0x0058 (0x0288 - 0x0230)
class USocialChatContainer : public UUserWidget
{
public:
	class USocialChatManager*                     ChatManager;                                       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USocialChatChannel*>             JoinedChannels;                                    // 0x0238(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class USocialChatChannel*                     ActiveChannel;                                     // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroup*                     TabButtonGroup;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatMessageList*                 ChatList_Messages;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialChatEditableText*                ChatEditableText_MessageEntry;                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_SendMessage;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_JoinedChannels;                           // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_Channels;                                // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DynamicHandleMessageTextCommitted(const class FText& MessageText, ETextCommit CommitMethod);
	void FocusEditableText();
	void HandleLeftTabPressed();
	void HandleRightTabPressed();
	void OnChatOpenChanged(bool bShouldBeOpen);
	void SendCurrentMessage();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatContainer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatContainer")
	}
	static class USocialChatContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatContainer>();
	}
};
DUMPER7_ASSERTS_USocialChatContainer;

// Class SocialUMG.SocialChatEditableText
// 0x04E0 (0x05E8 - 0x0108)
class USocialChatEditableText final : public UWidget
{
public:
	uint8                                         Pad_108[0x20];                                     // 0x0108(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEditableTextStyle                     EditableTextStyle;                                 // 0x0128(0x0218)(Edit, NativeAccessSpecifierPrivate)
	struct FTextBlockStyle                        AutoCompleteStyle;                                 // 0x0340(0x0268)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A8[0x40];                                     // 0x05A8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatEditableText")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatEditableText")
	}
	static class USocialChatEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatEditableText>();
	}
};
DUMPER7_ASSERTS_USocialChatEditableText;

// Class SocialUMG.SocialChatMessageEntry
// 0x0168 (0x0398 - 0x0230)
class USocialChatMessageEntry : public UUserWidget
{
public:
	uint8                                         Pad_230[0x18];                                     // 0x0230(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSocialChatMessageEntryStyle           DefaultStyle;                                      // 0x0248(0x0120)(Edit, Protected, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_Message;                                      // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_SenderName;                                   // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_ChannelName;                                  // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_Timestamp;                                    // 0x0380(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHorizontalBox*                         HorizontalBox_Header;                              // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                                Button_MessageButton;                              // 0x0390(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMessageSet();

	bool CanInteract() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatMessageEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatMessageEntry")
	}
	static class USocialChatMessageEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageEntry>();
	}
};
DUMPER7_ASSERTS_USocialChatMessageEntry;

// Class SocialUMG.SocialChatMessageList
// 0x00D8 (0x02E8 - 0x0210)
class USocialChatMessageList final : public UListViewBase
{
public:
	uint8                                         Pad_210[0xA8];                                     // 0x0210(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsFocusable;                                      // 0x02B8(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialChatChannel*                     ActiveChannel;                                     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x20];                                     // 0x02C8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialChatMessageList")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialChatMessageList")
	}
	static class USocialChatMessageList* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageList>();
	}
};
DUMPER7_ASSERTS_USocialChatMessageList;

// Class SocialUMG.SocialInteractionButton
// 0x0060 (0x0B90 - 0x0B30)
class USocialInteractionButton : public UCommonButton
{
public:
	struct FLinearColor                           DefaultIndicatorColor;                             // 0x0B30(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           AlertingIndicatorColor;                            // 0x0B40(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B50[0x30];                                     // 0x0B50(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_InteractionName;                              // 0x0B80(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBorder*                                Border_InteractionIndicator;                       // 0x0B88(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnInteractionSet();

	class FName GetInteractionName() const;
	bool IsPlatformOnlyFriend() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialInteractionButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialInteractionButton")
	}
	static class USocialInteractionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionButton>();
	}
};
DUMPER7_ASSERTS_USocialInteractionButton;

// Class SocialUMG.SocialInteractionMenu
// 0x0080 (0x02B0 - 0x0230)
class USocialInteractionMenu : public UUserWidget
{
public:
	class UObject*                                SocialContext;                                     // 0x0230(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_238[0x40];                                     // 0x0238(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UDynamicEntryBox*                       EntryBox_PositiveInteractions;                     // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_NegativeInteractions;                     // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpacer*                                Spacer_InteractionSeparator;                       // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonWidgetSwitcher*                  Switcher_Confirmation;                             // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_ConfirmationLabel;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Confirm;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButton*                          Button_Decline;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSocialContextSet();
	void OnToggleConfirmation(bool bIsVisible);

	class UWidget* GetFirstEntryToCenter() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialInteractionMenu")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialInteractionMenu")
	}
	static class USocialInteractionMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionMenu>();
	}
};
DUMPER7_ASSERTS_USocialInteractionMenu;

// Class SocialUMG.DesignerPreviewChatChannel
// 0x0068 (0x0150 - 0x00E8)
class UDesignerPreviewChatChannel final : public USocialChatChannel
{
public:
	uint8                                         Pad_E8[0x68];                                      // 0x00E8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DesignerPreviewChatChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DesignerPreviewChatChannel")
	}
	static class UDesignerPreviewChatChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerPreviewChatChannel>();
	}
};
DUMPER7_ASSERTS_UDesignerPreviewChatChannel;

// Class SocialUMG.SocialListEntry
// 0x0018 (0x0B48 - 0x0B30)
class USocialListEntry : public UCommonButton
{
public:
	uint8                                         Pad_B30[0x8];                                      // 0x0B30(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             Text_UserName;                                     // 0x0B38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0B40(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWidget* HandleGetMenuContent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialListEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialListEntry")
	}
	static class USocialListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListEntry>();
	}
};
DUMPER7_ASSERTS_USocialListEntry;

// Class SocialUMG.SocialUserListEntry
// 0x0010 (0x0B58 - 0x0B48)
class USocialUserListEntry : public USocialListEntry
{
public:
	class USocialUser*                            SocialUser;                                        // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_RichPresence;                                 // 0x0B50(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnUserPresenceChanged(EOnlineStatus OnlineStatus);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialUserListEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialUserListEntry")
	}
	static class USocialUserListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListEntry>();
	}
};
DUMPER7_ASSERTS_USocialUserListEntry;

// Class SocialUMG.SocialInviteListEntry
// 0x0008 (0x0B50 - 0x0B48)
class USocialInviteListEntry : public USocialListEntry
{
public:
	class USocialInvite*                          SocialInvite;                                      // 0x0B48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialInviteListEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialInviteListEntry")
	}
	static class USocialInviteListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInviteListEntry>();
	}
};
DUMPER7_ASSERTS_USocialInviteListEntry;

// Class SocialUMG.SocialUserListHeader
// 0x0040 (0x0068 - 0x0028)
class USocialUserListHeader : public UObject
{
public:
	uint8                                         Pad_28[0x40];                                      // 0x0028(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialUserListHeader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialUserListHeader")
	}
	static class USocialUserListHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListHeader>();
	}
};
DUMPER7_ASSERTS_USocialUserListHeader;

// Class SocialUMG.SocialInviteListHeader
// 0x0018 (0x0080 - 0x0068)
class USocialInviteListHeader final : public USocialUserListHeader
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USocialInvite*>                  SocialInvites;                                     // 0x0070(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialInviteListHeader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialInviteListHeader")
	}
	static class USocialInviteListHeader* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInviteListHeader>();
	}
};
DUMPER7_ASSERTS_USocialInviteListHeader;

// Class SocialUMG.SocialInvite
// 0x0008 (0x0030 - 0x0028)
class USocialInvite : public UObject
{
public:
	class USocialUser*                            OtherUser;                                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialInvite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialInvite")
	}
	static class USocialInvite* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInvite>();
	}
};
DUMPER7_ASSERTS_USocialInvite;

// Class SocialUMG.SocialFriendInvite
// 0x0000 (0x0030 - 0x0030)
class USocialFriendInvite final : public USocialInvite
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialFriendInvite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialFriendInvite")
	}
	static class USocialFriendInvite* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialFriendInvite>();
	}
};
DUMPER7_ASSERTS_USocialFriendInvite;

// Class SocialUMG.SocialPartyInvite
// 0x0000 (0x0030 - 0x0030)
class USocialPartyInvite final : public USocialInvite
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialPartyInvite")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialPartyInvite")
	}
	static class USocialPartyInvite* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialPartyInvite>();
	}
};
DUMPER7_ASSERTS_USocialPartyInvite;

// Class SocialUMG.SocialUserListHeaderEntry
// 0x0020 (0x0B50 - 0x0B30)
class USocialUserListHeaderEntry : public UCommonButton
{
public:
	uint8                                         Pad_B30[0x8];                                      // 0x0B30(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USocialUserListHeader*                  ListHeader;                                        // 0x0B38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_ListName;                                     // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_NumEntries;                                   // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialUserListHeaderEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialUserListHeaderEntry")
	}
	static class USocialUserListHeaderEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListHeaderEntry>();
	}
};
DUMPER7_ASSERTS_USocialUserListHeaderEntry;

// Class SocialUMG.SocialUserTreeView
// 0x0030 (0x03C0 - 0x0390)
class USocialUserTreeView final : public UTreeView
{
public:
	TSubclassOf<class USocialUserListEntry>       UserEntryWidgetClass;                              // 0x0390(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialInviteListEntry>     InviteEntryWidgetClass;                            // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialInteractionMenu>     ActionMenuClass;                                   // 0x03A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialInteractionMenu*                 ActionMenu;                                        // 0x03A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B0[0x10];                                     // 0x03B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SocialUserTreeView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SocialUserTreeView")
	}
	static class USocialUserTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserTreeView>();
	}
};
DUMPER7_ASSERTS_USocialUserTreeView;

SDK_NAMESPACE_END
