#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SquadSlotItemPicker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass SquadSlotItemPicker.SquadSlotItemPicker_C
// 0x0030 (0x0408 - 0x03D8)
class USquadSlotItemPicker_C final : public UFortSquadSlotItemPicker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideSort;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowSort;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show_Items;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hide_Items;                                        // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       SortText;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SquadSlotItemPicker(int32 EntryPoint);
	void HandleSortChanged(ESquadSlotSortType CurrentSortType, ESquadSlotType NewParam);
	void Construct();
	void HandleChangeSort();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SquadSlotItemPicker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SquadSlotItemPicker_C")
	}
	static class USquadSlotItemPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USquadSlotItemPicker_C>();
	}
};
DUMPER7_ASSERTS_USquadSlotItemPicker_C;

SDK_NAMESPACE_END
