#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanch

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function SrirachaRanch.StreamingRadioPlayerComponent.AuthPlayIndex
// 0x0004 (0x0004 - 0x0000)
struct StreamingRadioPlayerComponent_AuthPlayIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_AuthPlayIndex;

// Function SrirachaRanch.StreamingRadioPlayerComponent.AuthSaveAutoStart
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_AuthSaveAutoStart final
{
public:
	bool                                          bAutoStart;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_AuthSaveAutoStart;

// Function SrirachaRanch.StreamingRadioPlayerComponent.AuthSavedSource
// 0x0008 (0x0008 - 0x0000)
struct StreamingRadioPlayerComponent_AuthSavedSource final
{
public:
	class URadioContentSourceItemDefinition*      Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_AuthSavedSource;

// Function SrirachaRanch.StreamingRadioPlayerComponent.AuthSaveFadeOutTime
// 0x0004 (0x0004 - 0x0000)
struct StreamingRadioPlayerComponent_AuthSaveFadeOutTime final
{
public:
	float                                         FadeoutSeconds;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_AuthSaveFadeOutTime;

// Function SrirachaRanch.StreamingRadioPlayerComponent.AuthSetDisabledForCurrentPlayerState
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_AuthSetDisabledForCurrentPlayerState final
{
public:
	bool                                          bShouldDisableForCurrentPlayerState;               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_AuthSetDisabledForCurrentPlayerState;

// Function SrirachaRanch.StreamingRadioPlayerComponent.MediaExplicitClose
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_MediaExplicitClose final
{
public:
	bool                                          bReallyExplicit;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_MediaExplicitClose;

// Function SrirachaRanch.StreamingRadioPlayerComponent.MediaFailedToOpen
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_MediaFailedToOpen final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_MediaFailedToOpen;

// Function SrirachaRanch.StreamingRadioPlayerComponent.MediaReady
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_MediaReady final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_MediaReady;

// Function SrirachaRanch.StreamingRadioPlayerComponent.NativeOnPawnEnterSeat
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_NativeOnPawnEnterSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_NativeOnPawnEnterSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.NativeOnPawnEnterVehicle
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_NativeOnPawnEnterVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_NativeOnPawnEnterVehicle;

// Function SrirachaRanch.StreamingRadioPlayerComponent.NativeOnPawnExitSeat
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_NativeOnPawnExitSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_NativeOnPawnExitSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.NativeOnPawnExitVehicle
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_NativeOnPawnExitVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_NativeOnPawnExitVehicle;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnFailedURL
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_OnFailedURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnFailedURL;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnOwningVehicleDied
// 0x0038 (0x0038 - 0x0000)
struct StreamingRadioPlayerComponent_OnOwningVehicleDied final
{
public:
	class AFortAthenaVehicle*                     DeadVehicle;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  InTags;                                            // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AController*                            EventInstigator;                                   // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DamageCauser;                                      // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnOwningVehicleDied;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPawnEnterSeat
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_OnPawnEnterSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPawnEnterSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPawnEnterVehicle
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_OnPawnEnterVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPawnEnterVehicle;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPawnExitSeat
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_OnPawnExitSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPawnExitSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPawnExitVehicle
// 0x0020 (0x0020 - 0x0000)
struct StreamingRadioPlayerComponent_OnPawnExitVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPawnExitVehicle;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnPiPPlayerBlockedChanged
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_OnPiPPlayerBlockedChanged final
{
public:
	bool                                          bPiPPlayerBlocking;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnPiPPlayerBlockedChanged;

// Function SrirachaRanch.StreamingRadioPlayerComponent.OnSuccessfulURL
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_OnSuccessfulURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_OnSuccessfulURL;

// Function SrirachaRanch.StreamingRadioPlayerComponent.SetExteriorVolume
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_SetExteriorVolume final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_SetExteriorVolume;

// Function SrirachaRanch.StreamingRadioPlayerComponent.SetInteriorVolume
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_SetInteriorVolume final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_SetInteriorVolume;

// Function SrirachaRanch.StreamingRadioPlayerComponent.SoundMixUpdateTargetingState
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_SoundMixUpdateTargetingState final
{
public:
	bool                                          bNewIsTargeting;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_SoundMixUpdateTargetingState;

// Function SrirachaRanch.StreamingRadioPlayerComponent.SoundMixUpdateWeaponState
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_SoundMixUpdateWeaponState final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortWeapon*                            PrevWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_SoundMixUpdateWeaponState;

// Function SrirachaRanch.StreamingRadioPlayerComponent.StartRadio
// 0x0008 (0x0008 - 0x0000)
struct StreamingRadioPlayerComponent_StartRadio final
{
public:
	int32                                         IdxToPlay;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFallbackOverride;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_StartRadio;

// Function SrirachaRanch.StreamingRadioPlayerComponent.StopIfNoDriver
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_StopIfNoDriver final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_StopIfNoDriver;

// Function SrirachaRanch.StreamingRadioPlayerComponent.StopRadioWithFadeout
// 0x0004 (0x0004 - 0x0000)
struct StreamingRadioPlayerComponent_StopRadioWithFadeout final
{
public:
	int32                                         Milliseconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_StopRadioWithFadeout;

// Function SrirachaRanch.StreamingRadioPlayerComponent.GetOptionAt
// 0x0010 (0x0010 - 0x0000)
struct StreamingRadioPlayerComponent_GetOptionAt final
{
public:
	int32                                         idx;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URadioContentSourceItemDefinition*      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_GetOptionAt;

// Function SrirachaRanch.StreamingRadioPlayerComponent.IsExternalSeat
// 0x0008 (0x0008 - 0x0000)
struct StreamingRadioPlayerComponent_IsExternalSeat final
{
public:
	int32                                         SeatIdx;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_IsExternalSeat;

// Function SrirachaRanch.StreamingRadioPlayerComponent.IsPlayingLiveFeed
// 0x0001 (0x0001 - 0x0000)
struct StreamingRadioPlayerComponent_IsPlayingLiveFeed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StreamingRadioPlayerComponent_IsPlayingLiveFeed;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
