#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanch

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_classes.hpp"
#include "SrirachaRanch_structs.hpp"


SDK_NAMESPACE_START

// Class SrirachaRanch.RadioContentSourceItemDefinition
// 0x0018 (0x03A0 - 0x0388)
class URadioContentSourceItemDefinition final : public UFortAccountItemDefinition
{
public:
	class FString                                 ResourceID;                                        // 0x0388(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortStreamMediaSource*                 MediaSource;                                       // 0x0398(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RadioContentSourceItemDefinition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RadioContentSourceItemDefinition")
	}
	static class URadioContentSourceItemDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadioContentSourceItemDefinition>();
	}
};
DUMPER7_ASSERTS_URadioContentSourceItemDefinition;

// Class SrirachaRanch.StreamingRadioAudioShapeComponent
// 0x0038 (0x0168 - 0x0130)
class UStreamingRadioAudioShapeComponent final : public UFortAudioShapeComponent
{
public:
	float                                         Radius;                                            // 0x0130(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStreamingRadioPlayerComponent*         RadioPlayer;                                       // 0x0138(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_140[0x28];                                     // 0x0140(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StreamingRadioAudioShapeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StreamingRadioAudioShapeComponent")
	}
	static class UStreamingRadioAudioShapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamingRadioAudioShapeComponent>();
	}
};
DUMPER7_ASSERTS_UStreamingRadioAudioShapeComponent;

// Class SrirachaRanch.SrirachaRanchComponentTemplateWrapper
// 0x0008 (0x0038 - 0x0030)
class USrirachaRanchComponentTemplateWrapper final : public UDataAsset
{
public:
	class UMediaSoundComponent*                   MediaSoundPlayerTemplate;                          // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SrirachaRanchComponentTemplateWrapper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SrirachaRanchComponentTemplateWrapper")
	}
	static class USrirachaRanchComponentTemplateWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<USrirachaRanchComponentTemplateWrapper>();
	}
};
DUMPER7_ASSERTS_USrirachaRanchComponentTemplateWrapper;

// Class SrirachaRanch.StreamingRadioPlayerComponent
// 0x02D0 (0x0380 - 0x00B0)
class UStreamingRadioPlayerComponent : public UFortPawnComponent
{
public:
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSrirachaInputMappingData> InputMappingData;                            // 0x00C0(0x0050)(Edit, EditFixedSize, DisableEditOnInstance, NoClear, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, class URadioContentSourceItemDefinition* AffectedSource)> OnSourceLoading; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, class URadioContentSourceItemDefinition* AffectedSource)> OnSourcePlayed; // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, class URadioContentSourceItemDefinition* AffectedSource)> OnSourceStopped; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, class URadioContentSourceItemDefinition* AffectedSource)> OnSourceFailed; // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UStreamingRadioPlayerComponent* Component, class URadioContentSourceItemDefinition* AffectedSource)> OnRadioExplicitStop; // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                         PercentAutostartRadio;                             // 0x0160(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DisabledVehicleList;                               // 0x0168(0x0010)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, float>                      ExteriorVolumeMultiplierMap;                       // 0x0178(0x0050)(Config, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, float>                      InteriorVolumeMultiplierMap;                       // 0x01C8(0x0050)(Config, Protected, NativeAccessSpecifierProtected)
	bool                                          bMinimalStateOnPlatform;                           // 0x0218(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DisabledStationList;                               // 0x0220(0x0010)(ZeroConstructor, Config, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutostartOnEntry;                                 // 0x0230(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisabledForCurrentPlayerState;                    // 0x0231(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamingRadioSourceData              ReplicatedRadioSourceData;                         // 0x0238(0x0018)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UMediaSoundComponent*                   SoundComponent;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStreamingRadioAudioShapeComponent*     AudioShape;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USrirachaRanchComponentTemplateWrapper* SoundCompTemplateSource;                           // 0x0260(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URadioContentSourceItemDefinition*      LastSource;                                        // 0x0268(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class URadioContentSourceItemDefinition*> Sources;                                        // 0x0270(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URadioContentSourceItemDefinition*      FallbackSource;                                    // 0x0280(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FSrirachaPerClassSpecialSeats> SpecialSeatList;                         // 0x0288(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMediaPlayerCtrl*                   MediaController;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortStreamMediaSource*                 LastMediaSource;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortStreamMediaSource*                 IncomingMediaSource;                               // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ERadioSource                                  CurrentMode;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaximumRetries;                                    // 0x02FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FadeoutWhenUnpoweredInMS;                          // 0x0300(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         FadeoutWhenOwnerBeingDestroyedInMS;                // 0x0304(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxFadeoutTimeMS;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DefaultPlayingIndex;                               // 0x030C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundMix*                              SoundMixInside;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundMix*                              SoundMixOutside;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_320[0x4];                                      // 0x0320(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActivationRadius;                                  // 0x0324(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ComponentToAttachTo;                               // 0x0328(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ComponentSocketAttachTo;                           // 0x0330(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                DelegateContextObject;                             // 0x0338(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MediaStartTimeFromInit;                            // 0x0340(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_344[0x3C];                                     // 0x0344(0x003C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AuthPlayIndex(int32 Index_0);
	void AuthSaveAutoStart(bool bAutoStart);
	void AuthSavedSource(class URadioContentSourceItemDefinition* Source);
	void AuthSaveFadeOutTime(float FadeoutSeconds);
	void AuthSetDisabledForCurrentPlayerState(bool bShouldDisableForCurrentPlayerState);
	void AuthStopRadio();
	void MediaExplicitClose(bool bReallyExplicit);
	void MediaFailedToOpen(const class FString& String);
	void MediaFinishedOrClosed();
	void MediaLoad();
	void MediaPlayed();
	void MediaReady(const class FString& String);
	void NativeOnPawnEnterSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void NativeOnPawnEnterVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void NativeOnPawnExitSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void NativeOnPawnExitVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnFailedURL(const class FString& URL);
	void OnOwnerExploded();
	void OnOwnerOutOfFuel();
	void OnOwnerReFueled();
	void OnOwnerUnpowered();
	void OnOwningVehicleDied(class AFortAthenaVehicle* DeadVehicle, const struct FGameplayTagContainer& InTags, class AController* EventInstigator, class AActor* DamageCauser);
	void OnPawnEnterSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnPawnEnterVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnPawnExitSeat(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnPawnExitVehicle(const TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex);
	void OnPiPPlayerBlockedChanged(bool bPiPPlayerBlocking);
	void OnRep_RadioSourceData();
	void OnSuccessfulURL(const class FString& URL);
	void PlayDefaultIndex();
	void PlayNextIndex();
	void PlayPrevIndex();
	void SetExteriorVolume(const TScriptInterface<class IFortVehicleInterface>& Vehicle);
	void SetInteriorVolume(const TScriptInterface<class IFortVehicleInterface>& Vehicle);
	void SoundMixUpdateTargetingState(bool bNewIsTargeting);
	void SoundMixUpdateWeaponState(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void StartRadio(int32 IdxToPlay, bool bFallbackOverride);
	void StopIfNoDriver(const TScriptInterface<class IFortVehicleInterface>& Vehicle);
	void StopRadio();
	void StopRadioWithFadeout(int32 Milliseconds);
	void ToggleRadioActive();

	class URadioContentSourceItemDefinition* GetOptionAt(int32 idx) const;
	bool IsExternalSeat(int32 SeatIdx) const;
	bool IsPlayingLiveFeed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StreamingRadioPlayerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StreamingRadioPlayerComponent")
	}
	static class UStreamingRadioPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStreamingRadioPlayerComponent>();
	}
};
DUMPER7_ASSERTS_UStreamingRadioPlayerComponent;

SDK_NAMESPACE_END
