#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SrirachaRanchUI

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// Class SrirachaRanchUI.FortMobileActionButtonBehavior_ToggleRadio
// 0x0010 (0x00C0 - 0x00B0)
class UFortMobileActionButtonBehavior_ToggleRadio : public UFortMobileActionButtonBehavior
{
public:
	class UPaperSprite*                           ToggleRadioOffSprite;                              // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleRadioPlaying(class UStreamingRadioPlayerComponent* Radio, class URadioContentSourceItemDefinition* Source);
	void HandleRadioStopped(class UStreamingRadioPlayerComponent* Radio, class URadioContentSourceItemDefinition* Source);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FortMobileActionButtonBehavior_ToggleRadio")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FortMobileActionButtonBehavior_ToggleRadio")
	}
	static class UFortMobileActionButtonBehavior_ToggleRadio* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortMobileActionButtonBehavior_ToggleRadio>();
	}
};
DUMPER7_ASSERTS_UFortMobileActionButtonBehavior_ToggleRadio;

// Class SrirachaRanchUI.RadioPlayerWidgetBase
// 0x0050 (0x0318 - 0x02C8)
class URadioPlayerWidgetBase final : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_2C8[0x40];                                     // 0x02C8(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortPrioritizedWidgetData             PriorityData;                                      // 0x0308(0x0002)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStreamingRadioPlayerComponent*         LastValidComp;                                     // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void NativeEnteredVehicle();
	void NativeExitedVehicle();
	void OnDisconnectFromComp();
	void OnFailedToOpenSource(class UStreamingRadioPlayerComponent* Radio, class URadioContentSourceItemDefinition* Source);
	void OnLoadingNewSource(class UStreamingRadioPlayerComponent* Radio, class URadioContentSourceItemDefinition* Source);
	void OnRadioStopped(class UStreamingRadioPlayerComponent* Radio, class URadioContentSourceItemDefinition* LastSource);
	void OnShouldShowDueToEntrance();
	void OnSourceFinished(class UStreamingRadioPlayerComponent* Radio, class URadioContentSourceItemDefinition* Source);
	void OnSourcePlaying(class UStreamingRadioPlayerComponent* Radio, class URadioContentSourceItemDefinition* Source);
	void SetControllable(bool bCanControl);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RadioPlayerWidgetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RadioPlayerWidgetBase")
	}
	static class URadioPlayerWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadioPlayerWidgetBase>();
	}
};
DUMPER7_ASSERTS_URadioPlayerWidgetBase;

SDK_NAMESPACE_END
