#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StormCameraModifier

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function StormCameraModifier.StormCameraModifier_C.BlueprintModifyPostProcess
// 0x0AB0 (0x0AB0 - 0x0000)
struct StormCameraModifier_C_BlueprintModifyPostProcess final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendWeight;                            // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PostProcessSettings;                               // 0x0010(0x0550)(Parm, OutParm)
	struct FPostProcessSettings                   K2Node_MakeStruct_PostProcessSettings;             // 0x0560(0x0550)()
};
DUMPER7_ASSERTS_StormCameraModifier_C_BlueprintModifyPostProcess;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
