#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreItemCardFront

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass StoreItemCardFront.StoreItemCardFront_C
// 0x0050 (0x0280 - 0x0230)
class UStoreItemCardFront_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              Card_ScaleBox;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCard;                                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Mask;                                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FCard                                  CardData;                                          // 0x0250(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	EFortRarity                                   CurrentRarity;                                     // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SpacingText;                                       // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StoreItemCardFront(int32 EntryPoint);
	void InitFromObject(class UObject* InitObject);
	void OnFortStoreStateChanged(EFortStoreState NewStoreState);
	void Construct();
	void Initialize_Card(const struct FCard& inCard);
	void Draw_Card();
	class FText Get_Card_Name_Text();
	void Get_Type_Text(class FText* OutText);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("StoreItemCardFront_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StoreItemCardFront_C")
	}
	static class UStoreItemCardFront_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreItemCardFront_C>();
	}
};
DUMPER7_ASSERTS_UStoreItemCardFront_C;

SDK_NAMESPACE_END
