#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwimmingAnimLayerInterface

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function SwimmingAnimLayerInterface.SwimmingAnimLayerInterface_C.SwimmingLayer
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimLayerInterface_C_SwimmingLayer final
{
public:
	struct FPoseLink                              MainPlayerAnimBP;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SwimmingLayer_0;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SwimmingAnimLayerInterface_C_SwimmingLayer;

// Function SwimmingAnimLayerInterface.SwimmingAnimLayerInterface_C.SwimmingMovementAdditiveLayerPose
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimLayerInterface_C_SwimmingMovementAdditiveLayerPose final
{
public:
	struct FPoseLink                              PassThroughSwimmingMovementAdditive;               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SwimmingMovementAdditiveLayerPose_0;               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SwimmingAnimLayerInterface_C_SwimmingMovementAdditiveLayerPose;

// Function SwimmingAnimLayerInterface.SwimmingAnimLayerInterface_C.SwimmingSprintLayer
// 0x0028 (0x0028 - 0x0000)
struct SwimmingAnimLayerInterface_C_SwimmingSprintLayer final
{
public:
	struct FPoseLink                              PassThroughSwimmingSprint;                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          IsHidingInPropLayer;                               // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              SwimmingSprintLayer_0;                             // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SwimmingAnimLayerInterface_C_SwimmingSprintLayer;

// Function SwimmingAnimLayerInterface.SwimmingAnimLayerInterface_C.SwimmingUpperBodyPoseTargetingLayer
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimLayerInterface_C_SwimmingUpperBodyPoseTargetingLayer final
{
public:
	struct FPoseLink                              PassThroughSwimmingUpperBodyPoseTargeting;         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SwimmingUpperBodyPoseTargetingLayer_0;             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SwimmingAnimLayerInterface_C_SwimmingUpperBodyPoseTargetingLayer;

// Function SwimmingAnimLayerInterface.SwimmingAnimLayerInterface_C.SwimmingUpperBodyPoseNonTargetingLayer
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimLayerInterface_C_SwimmingUpperBodyPoseNonTargetingLayer final
{
public:
	struct FPoseLink                              PassThroughSwimmingUpperBodyPoseNonTargeting;      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SwimmingUpperBodyPoseNonTargetingLayer_0;          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SwimmingAnimLayerInterface_C_SwimmingUpperBodyPoseNonTargetingLayer;

// Function SwimmingAnimLayerInterface.SwimmingAnimLayerInterface_C.SwimmingLowerBodyLayer
// 0x0040 (0x0040 - 0x0000)
struct SwimmingAnimLayerInterface_C_SwimmingLowerBodyLayer final
{
public:
	struct FPoseLink                              UpperBody_Cache;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PreUpperBodySlot_Cache;                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PassThroughSwimmingLowerBody;                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SwimmingLowerBodyLayer_0;                          // 0x0030(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SwimmingAnimLayerInterface_C_SwimmingLowerBodyLayer;

// Function SwimmingAnimLayerInterface.SwimmingAnimLayerInterface_C.SwimmingAdditiveLayer
// 0x0078 (0x0078 - 0x0000)
struct SwimmingAnimLayerInterface_C_SwimmingAdditiveLayer final
{
public:
	struct FPoseLink                              IdleAdditive_Cache;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MovementAdditiveLayerPose_Cache;                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBody;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         PlayMeleeAttackAOLayer;                            // 0x0030(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisableArmsHeadAdditiveCurveAlphaLayer;            // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisableIKRootAdditiveCurveAlphaLayer;              // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocomotionAdditiveAlphaLayer;                      // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MainInstanceAdditiveLayerAlpha;                    // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              UpperAndLowerBody_Cache;                           // 0x0048(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SprintingPose_PostMask_Cache;                      // 0x0058(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SwimmingAdditiveLayer_0;                           // 0x0068(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SwimmingAnimLayerInterface_C_SwimmingAdditiveLayer;

// Function SwimmingAnimLayerInterface.SwimmingAnimLayerInterface_C.SwimmingFullBodyAdditiveLayer
// 0x0020 (0x0020 - 0x0000)
struct SwimmingAnimLayerInterface_C_SwimmingFullBodyAdditiveLayer final
{
public:
	struct FPoseLink                              PassThroughFullBodyAdditive;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SwimmingFullBodyAdditiveLayer_0;                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SwimmingAnimLayerInterface_C_SwimmingFullBodyAdditiveLayer;

// Function SwimmingAnimLayerInterface.SwimmingAnimLayerInterface_C.SwimmingDiveJumpingLayer
// 0x0030 (0x0030 - 0x0000)
struct SwimmingAnimLayerInterface_C_SwimmingDiveJumpingLayer final
{
public:
	struct FPoseLink                              PassThroughSwimmingDiveJumping;                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          IsHidingInPropLayer2;                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MainInstanceDiveJumpLayerAlpha;                    // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPlayerAnimBodyType                       AnimBodyTypePassThrough;                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              SwimmingDiveJumpingLayer_0;                        // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_SwimmingAnimLayerInterface_C_SwimmingDiveJumpingLayer;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
