#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamMicStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass TeamMicStack.TeamMicStack_C
// 0x0030 (0x0298 - 0x0268)
class UTeamMicStack_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           _Vertical_Box__Team_Members;                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderFrame;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UCinematic_TeamMics_C*>          TeamMembers;                                       // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          NewVar_0;                                          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TeamMicStack(int32 EntryPoint);
	void HandlePartyLeft();
	void Construct();
	void HandleTeamMemberRemoved(int32 Member_Index);
	void HandleTeamMemberChanged(const struct FFortTeamMemberInfo& Member_Info);
	void ShiftTeamMembers(struct FFortTeamMemberInfo& TeamMemberInfo, int32 Index_0);
	void AppendTeamMember(struct FFortTeamMemberInfo& TeamMemberInfo);
	void ClearContents();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TeamMicStack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TeamMicStack_C")
	}
	static class UTeamMicStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTeamMicStack_C>();
	}
};
DUMPER7_ASSERTS_UTeamMicStack_C;

SDK_NAMESPACE_END
