#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeSynth_TrackMixState

#include "Basic.hpp"

#include "TimeSynth_VolumeGroupState_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct TimeSynth_TrackMixState.TimeSynth_TrackMixState
// 0x0028 (0x0028 - 0x0000)
struct FTimeSynth_TrackMixState final
{
public:
	class FName                                   MixState_29_DE643ACB4D24E56B4BD5BEB15784E04D;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTimeSynth_VolumeGroupState>    VolumeGroupStates_3_6471FE684CEE53024935A3BF6175EB13; // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Enabled_14_D6C017694F7873486AE2D2A6AD3B1839;       // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime_38_90A9CE1C4D73A02B7CC1AE988D7CE73A;      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxVolumeDb_32_894FD1F0404801C1B358F1853CF2D9F2;   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentVolumeNormalized_37_7080ED634324AB286742248CFA169B6A; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FTimeSynth_TrackMixState;

SDK_NAMESPACE_END
