#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeSynthTrackComponent_LowTower

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "BP_TimeSynthTrackComponent_DataTracker_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass TimeSynthTrackComponent_LowTower.TimeSynthTrackComponent_LowTower_C
// 0x0020 (0x0230 - 0x0210)
class UTimeSynthTrackComponent_LowTower_C final : public UBP_TimeSynthTrackComponent_DataTracker_C
{
public:
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           UnawareTag;                                        // 0x020C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AlertedTag;                                        // 0x0214(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AggressiveTag;                                     // 0x021C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         UnawareInterp;                                     // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AlertedInterp;                                     // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AggressiveInterp;                                  // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnDataTrackerUpdate();
	void GetRemainingEventCooldown(float* Cooldown);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TimeSynthTrackComponent_LowTower_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TimeSynthTrackComponent_LowTower_C")
	}
	static class UTimeSynthTrackComponent_LowTower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimeSynthTrackComponent_LowTower_C>();
	}
};
DUMPER7_ASSERTS_UTimeSynthTrackComponent_LowTower_C;

SDK_NAMESPACE_END
