#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetRuntime

#include "Basic.hpp"

#include "ValetRuntime_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ValetRuntime.FortDagwoodVehicleManager.CustomHandleActorStreamedInEditor
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicleManager_CustomHandleActorStreamedInEditor final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicleManager_CustomHandleActorStreamedInEditor;

// Function ValetRuntime.FortDagwoodVehicleManager.OnVehicleSpawned
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicleManager_OnVehicleSpawned final
{
public:
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicleManager_OnVehicleSpawned;

// Function ValetRuntime.FortDagwoodVehicleManager.OnVehicleSpawnsUpdated
// 0x0020 (0x0020 - 0x0000)
struct FortDagwoodVehicleManager_OnVehicleSpawnsUpdated final
{
public:
	class UFortVehicleItemDefinition*             VehicleItemDef;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         SpawnedVehicles;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewVehicleCount;                                   // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicleManager_OnVehicleSpawnsUpdated;

// Function ValetRuntime.FortDagwoodVehicleManager.ServerSetVehicleFuel
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicleManager_ServerSetVehicleFuel final
{
public:
	float                                         NewFuel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicleManager_ServerSetVehicleFuel;

// Function ValetRuntime.FortDagwoodVehicleManager.SetVehicleFuel
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicleManager_SetVehicleFuel final
{
public:
	float                                         NewFuel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicleManager_SetVehicleFuel;

// Function ValetRuntime.FortContextualTutorial_VehicleValetLowFuel.HandleVehicleStateChanged
// 0x0018 (0x0018 - 0x0000)
struct FortContextualTutorial_VehicleValetLowFuel_HandleVehicleStateChanged final
{
public:
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewVehicle;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OldVehicle;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortContextualTutorial_VehicleValetLowFuel_HandleVehicleStateChanged;

// Function ValetRuntime.FortDagwoodVehicle.GetCurrentRuntimeProperties
// 0x0048 (0x0048 - 0x0000)
struct FortDagwoodVehicle_GetCurrentRuntimeProperties final
{
public:
	struct FVehicleRuntimeModifiers               ReturnValue;                                       // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetCurrentRuntimeProperties;

// Function ValetRuntime.FortDagwoodVehicle.MakeOperable
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_MakeOperable final
{
public:
	bool                                          bAddGas;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_MakeOperable;

// Function ValetRuntime.FortDagwoodVehicle.NativeOnFuelChanged
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_NativeOnFuelChanged final
{
public:
	float                                         NewFuelPercent;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OldFuelPercent;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_NativeOnFuelChanged;

// Function ValetRuntime.FortDagwoodVehicle.OnClientBeginAltInteract
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_OnClientBeginAltInteract final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnClientBeginAltInteract;

// Function ValetRuntime.FortDagwoodVehicle.OnDestroyedPropFromCollision
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_OnDestroyedPropFromCollision final
{
public:
	const class ABuildingActor*                   BuildingHitActor;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnDestroyedPropFromCollision;

// Function ValetRuntime.FortDagwoodVehicle.OnGainedFuel
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_OnGainedFuel final
{
public:
	float                                         NewPercent;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnGainedFuel;

// Function ValetRuntime.FortDagwoodVehicle.OnInoperableChanged
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_OnInoperableChanged final
{
public:
	bool                                          bInoperable;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnInoperableChanged;

// Function ValetRuntime.FortDagwoodVehicle.OnPoppedTire
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_OnPoppedTire final
{
public:
	int32                                         TireIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnPoppedTire;

// Function ValetRuntime.FortDagwoodVehicle.OnRep_Tires
// 0x0010 (0x0010 - 0x0000)
struct FortDagwoodVehicle_OnRep_Tires final
{
public:
	TArray<ETireStates>                           PrevTireStates;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnRep_Tires;

// Function ValetRuntime.FortDagwoodVehicle.OnRimScrapeDamage
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_OnRimScrapeDamage final
{
public:
	int32                                         TireIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnRimScrapeDamage;

// Function ValetRuntime.FortDagwoodVehicle.OnServerAltInteract
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_OnServerAltInteract final
{
public:
	class AFortPawn*                              Pawn;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnServerAltInteract;

// Function ValetRuntime.FortDagwoodVehicle.OnSpawnLeakProjectile
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_OnSpawnLeakProjectile final
{
public:
	class AFortProjectileBase*                    SpawnProjectile;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnSpawnLeakProjectile;

// Function ValetRuntime.FortDagwoodVehicle.OnTickAudioController
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_OnTickAudioController final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnTickAudioController;

// Function ValetRuntime.FortDagwoodVehicle.OnTickAudioFade
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_OnTickAudioFade final
{
public:
	float                                         FadeParam;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_OnTickAudioFade;

// Function ValetRuntime.FortDagwoodVehicle.ServerAddRuntimeGearsInfo
// 0x0010 (0x0010 - 0x0000)
struct FortDagwoodVehicle_ServerAddRuntimeGearsInfo final
{
public:
	struct FRuntimeGearInfo                       GearInfo;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerAddRuntimeGearsInfo;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeBoostInfo
// 0x0010 (0x0010 - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeBoostInfo final
{
public:
	struct FRuntimeBoostInfo                      BoostInfo;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeBoostInfo;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeDriveInfo
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeDriveInfo final
{
public:
	float                                         MaxIncline;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxTilt;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeDriveInfo;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeFuelInfo
// 0x000C (0x000C - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeFuelInfo final
{
public:
	struct FRuntimeFuelInfo                       FuelInfo;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeFuelInfo;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeGravity
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeGravity final
{
public:
	float                                         GravMult;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeGravity;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeProperties
// 0x0048 (0x0048 - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeProperties final
{
public:
	struct FVehicleRuntimeModifiers               RunTimeProps;                                      // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeProperties;

// Function ValetRuntime.FortDagwoodVehicle.ServerSetRuntimeSpringsInfo
// 0x000C (0x000C - 0x0000)
struct FortDagwoodVehicle_ServerSetRuntimeSpringsInfo final
{
public:
	struct FRuntimeSpringsInfo                    SpringsInfo;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ServerSetRuntimeSpringsInfo;

// Function ValetRuntime.FortDagwoodVehicle.SetFuel
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_SetFuel final
{
public:
	float                                         NewFuel;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_SetFuel;

// Function ValetRuntime.FortDagwoodVehicle.SetNormalizedAudioRPM
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_SetNormalizedAudioRPM final
{
public:
	float                                         InRPM;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_SetNormalizedAudioRPM;

// Function ValetRuntime.FortDagwoodVehicle.SetOnFire
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_SetOnFire final
{
public:
	bool                                          bNewFire;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_SetOnFire;

// Function ValetRuntime.FortDagwoodVehicle.AreAnyTiresPopped
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_AreAnyTiresPopped final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_AreAnyTiresPopped;

// Function ValetRuntime.FortDagwoodVehicle.ForwardOrReverseInputPressed
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_ForwardOrReverseInputPressed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_ForwardOrReverseInputPressed;

// Function ValetRuntime.FortDagwoodVehicle.GetBumpiness
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetBumpiness final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetBumpiness;

// Function ValetRuntime.FortDagwoodVehicle.GetFuel
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetFuel final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetFuel;

// Function ValetRuntime.FortDagwoodVehicle.GetFuelCapacity
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetFuelCapacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetFuelCapacity;

// Function ValetRuntime.FortDagwoodVehicle.GetHUDTopSpeed
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetHUDTopSpeed final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetHUDTopSpeed;

// Function ValetRuntime.FortDagwoodVehicle.GetNormalizedAudioRPM
// 0x0004 (0x0004 - 0x0000)
struct FortDagwoodVehicle_GetNormalizedAudioRPM final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetNormalizedAudioRPM;

// Function ValetRuntime.FortDagwoodVehicle.GetOnFire
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_GetOnFire final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetOnFire;

// Function ValetRuntime.FortDagwoodVehicle.GetPlayerFacingName
// 0x0010 (0x0010 - 0x0000)
struct FortDagwoodVehicle_GetPlayerFacingName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetPlayerFacingName;

// Function ValetRuntime.FortDagwoodVehicle.GetTireHealthPercent
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_GetTireHealthPercent final
{
public:
	ETireLocations                                TireIndex;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetTireHealthPercent;

// Function ValetRuntime.FortDagwoodVehicle.GetTireState
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_GetTireState final
{
public:
	int32                                         TireIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetTireState;

// Function ValetRuntime.FortDagwoodVehicle.GetTireSurface
// 0x0002 (0x0002 - 0x0000)
struct FortDagwoodVehicle_GetTireSurface final
{
public:
	ETireLocations                                TireIndex;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETireSurfaces                                 ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_GetTireSurface;

// Function ValetRuntime.FortDagwoodVehicle.IsInoperable
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsInoperable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsInoperable;

// Function ValetRuntime.FortDagwoodVehicle.IsNativeBPTickEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsNativeBPTickEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsNativeBPTickEnabled;

// Function ValetRuntime.FortDagwoodVehicle.IsOffroad
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsOffroad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsOffroad;

// Function ValetRuntime.FortDagwoodVehicle.IsOnDirt
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsOnDirt final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsOnDirt;

// Function ValetRuntime.FortDagwoodVehicle.IsOnLandscape
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsOnLandscape final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsOnLandscape;

// Function ValetRuntime.FortDagwoodVehicle.IsOnRoad
// 0x0001 (0x0001 - 0x0000)
struct FortDagwoodVehicle_IsOnRoad final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsOnRoad;

// Function ValetRuntime.FortDagwoodVehicle.IsTireSkidding
// 0x0014 (0x0014 - 0x0000)
struct FortDagwoodVehicle_IsTireSkidding final
{
public:
	float                                         MinSpeedForSkid;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngleForSkid;                                      // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedForPeelout;                                   // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedForBraking;                                   // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsTireSkidding;

// Function ValetRuntime.FortDagwoodVehicle.IsVehicleAcceleratingWithSpeedThreshold
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_IsVehicleAcceleratingWithSpeedThreshold final
{
public:
	float                                         SpeedThreshold;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FortDagwoodVehicle_IsVehicleAcceleratingWithSpeedThreshold;

// Function ValetRuntime.FortDagwoodVehicle.NativeCalculateAccelRumbleIntensity
// 0x0008 (0x0008 - 0x0000)
struct FortDagwoodVehicle_NativeCalculateAccelRumbleIntensity final
{
public:
	float                                         MaxIntensity;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortDagwoodVehicle_NativeCalculateAccelRumbleIntensity;

// Function ValetRuntime.FortValetAudioController.CacheValetVehicle
// 0x0008 (0x0008 - 0x0000)
struct FortValetAudioController_CacheValetVehicle final
{
public:
	class AFortDagwoodVehicle*                    InVehicle;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortValetAudioController_CacheValetVehicle;

// Function ValetRuntime.FortValetAudioController.OnSuspensionCollision_Native
// 0x0008 (0x0008 - 0x0000)
struct FortValetAudioController_OnSuspensionCollision_Native final
{
public:
	bool                                          OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutMagnitude;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FortValetAudioController_OnSuspensionCollision_Native;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
