#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultWorld

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VaultWorld.VaultWorld_C.GetVaultRotator
// 0x0018 (0x0018 - 0x0000)
struct VaultWorld_C_GetVaultRotator final
{
public:
	class AVaultRotator_C*                        VaultRotator;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVaultRotator_C*                        K2Node_DynamicCast_AsVault_Rotator;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_VaultWorld_C_GetVaultRotator;

// Function VaultWorld.VaultWorld_C.OnSetupBackground
// 0x0068 (0x0068 - 0x0000)
struct VaultWorld_C_OnSetupBackground final
{
public:
	const class UTexture2D*                       LoadedBackgroundTexture;                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTrackDynamicBackground                BackgroundInfo;                                    // 0x0008(0x0060)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_VaultWorld_C_OnSetupBackground;

// Function VaultWorld.VaultWorld_C.OnTransitionBackground
// 0x0001 (0x0001 - 0x0000)
struct VaultWorld_C_OnTransitionBackground final
{
public:
	bool                                          bPlayForward;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_VaultWorld_C_OnTransitionBackground;

// Function VaultWorld.VaultWorld_C.OnUpdateDisplay
// 0x0002 (0x0002 - 0x0000)
struct VaultWorld_C_OnUpdateDisplay final
{
public:
	bool                                          bShowFloor;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowEffects;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_VaultWorld_C_OnUpdateDisplay;

// Function VaultWorld.VaultWorld_C.ExecuteUbergraph_VaultWorld
// 0x0090 (0x0090 - 0x0000)
struct VaultWorld_C_ExecuteUbergraph_VaultWorld final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowFloor;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShowEffects;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortStaticMeshActor*                   K2Node_DynamicCast_AsFort_Static_Mesh_Actor;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UTexture2D*                       K2Node_Event_LoadedBackgroundTexture;              // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTrackDynamicBackground                K2Node_Event_BackgroundInfo;                       // 0x0028(0x0060)(ConstParm)
	bool                                          K2Node_Event_bPlayForward;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_VaultWorld_C_ExecuteUbergraph_VaultWorld;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
