#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VinderTech_GliderChute_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass VinderTech_GliderChute_AnimBP.VinderTech_GliderChute_AnimBP_C
// 0x1088 (0x1358 - 0x02D0)
class UVinderTech_GliderChute_AnimBP_C final : public UFortGliderAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_EBDA468D4AE5D250B2B622A7005664B6; // 0x02D8(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_928EDF8F48A9073F91162CAB58A14585; // 0x02F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_953326594E4978729F3C6F9E722F8648; // 0x0340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_326A11214546037B4E81ADB615DF6BEE; // 0x0368(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_713B895F48F2801365CB0CA497F43775; // 0x0390(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6AAED3AF491F53722B9FE2B1DDF77122; // 0x03B8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A98464EC49847793447025870BB3567D; // 0x03E0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2439A6B841320C06C4EE708432E4C44C; // 0x0458(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_82685898490AC32A95FE72A7CBA680F0; // 0x0478(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1A0CF0F94EBE65EEB459EB95790D705C; // 0x04F0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9B03F50C4862D2EF870290A1B8F5B8A1; // 0x05B8(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6AE640144CB81C507672BF998F0B11C2; // 0x0630(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_C66225BD4D65AF607D0B7F8F25118251; // 0x06F8(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3578C84F4BBF699C78120CB554B31BC8; // 0x07C0(0x0078)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3F76794F43898FF37C8183B1E9025ACA; // 0x0838(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_ECEA977D46C391A751D73BB4275664EB; // 0x0918(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57146B1C47C1FD75E2F118B6257501E2; // 0x0938(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_A068E2D4487924F5B0AC02A015FBE884; // 0x09B0(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_E240E3B34665377BFC6E60A4A32FB181; // 0x0A78(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_06400E5F4230121BA598E7AD89F2B5D0; // 0x0B40(0x0078)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6E2C22D14BAD8C4CE035DA8E77E6BB57; // 0x0BB8(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FD572ED741F2DDF85C3E83969BA5DAA1; // 0x0C98(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B9156DAE4FE14BBC3C91B2BFEE37264F; // 0x0CB8(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3D8BCF9B48C1F3F3C9D05F8193385532; // 0x0D68(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_71998DF347CE3E6D443727A7650BF726; // 0x0E30(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8E5835A84615F8EA0A7FA8A5B13CFC7C; // 0x0F10(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_75F5C8BE420D12DAF0A617942143A598; // 0x0F88(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_884B3665448529B7332295932D763E2E; // 0x1050(0x00E0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4FA0C0F04B0ADE7752BF3F96A5E976D2; // 0x1130(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3827D593419FCD9F81875E81571015D2; // 0x11F8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_072899E247AEB4D2997ABD855205AECE; // 0x1298(0x0078)()
	bool                                          IsParachuteOpen;                                   // 0x1310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1311[0x3];                                     // 0x1311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AimPitch;                                          // 0x1314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeployAnimRate;                                    // 0x1318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkydiveYaw;                                        // 0x131C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   DynamicsOK;                                        // 0x1320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         SpinnerRate;                                       // 0x1330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1334[0x4];                                     // 0x1334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   FE_IdleStart;                                      // 0x1338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   FE_End;                                            // 0x1348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_GliderChute_AnimBP_AnimGraphNode_TransitionResult_326A11214546037B4E81ADB615DF6BEE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_GliderChute_AnimBP_AnimGraphNode_BlendListByBool_3827D593419FCD9F81875E81571015D2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_GliderChute_AnimBP_AnimGraphNode_ApplyAdditive_E240E3B34665377BFC6E60A4A32FB181();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_GliderChute_AnimBP_AnimGraphNode_ApplyAdditive_C66225BD4D65AF607D0B7F8F25118251();
	void AnimNotify_DynamicsOK();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_FE_IdleStart();
	void AnimNotify_FE_ENd();
	void ExecuteUbergraph_VinderTech_GliderChute_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("VinderTech_GliderChute_AnimBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VinderTech_GliderChute_AnimBP_C")
	}
	static class UVinderTech_GliderChute_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVinderTech_GliderChute_AnimBP_C>();
	}
};
DUMPER7_ASSERTS_UVinderTech_GliderChute_AnimBP_C;

SDK_NAMESPACE_END
