#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Violator_ActiveFriends

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.ExecuteUbergraph_Violator_ActiveFriends
// 0x0008 (0x0008 - 0x0000)
struct Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Violator_ActiveFriends_C_ExecuteUbergraph_Violator_ActiveFriends;

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Violator_ActiveFriends_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Violator_ActiveFriends_C_PreConstruct;

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.CallOut Surface
// 0x0008 (0x0008 - 0x0000)
struct Violator_ActiveFriends_C_CallOut_Surface final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Violator_ActiveFriends_C_CallOut_Surface;

// Function Violator_ActiveFriends.Violator_ActiveFriends_C.CallOut Hide
// 0x0008 (0x0008 - 0x0000)
struct Violator_ActiveFriends_C_CallOut_Hide final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Violator_ActiveFriends_C_CallOut_Hide;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
