#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VotingFramework

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// Enum VotingFramework.EVoteSessionState
// NumValues: 0x0006
enum class EVoteSessionState : uint8
{
	None                                     = 0,
	Setup                                    = 1,
	Voting                                   = 2,
	Complete                                 = 3,
	Shutdown                                 = 4,
	EVoteSessionState_MAX                    = 5,
};

// Enum VotingFramework.EVoteSessionNetworkType
// NumValues: 0x0004
enum class EVoteSessionNetworkType : uint8
{
	NotDetermined                            = 0,
	DedicatedServer                          = 1,
	MeshNetwork                              = 2,
	EVoteSessionNetworkType_MAX              = 3,
};

// Enum VotingFramework.EVoteState
// NumValues: 0x0005
enum class EVoteState : uint8
{
	None                                     = 0,
	Setup                                    = 1,
	Active                                   = 2,
	Completed                                = 3,
	EVoteState_MAX                           = 4,
};

// ScriptStruct VotingFramework.VoteSessionRuntime
// 0x0024 (0x0030 - 0x000C)
struct FVoteSessionRuntime final : public FFastArraySerializerItem
{
public:
	class FName                                   VoteSessionId;                                     // 0x000C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVoteSessionNetworkType                       NetworkType;                                       // 0x0014(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVoteSessionState                             VoteSessionState;                                  // 0x0015(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentVoteId;                                     // 0x0018(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWorld*                                 WorldRef;                                          // 0x0020(0x0008)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVoteSessionState                             Shadow_VoteSessionState;                           // 0x0028(0x0001)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVoteSessionRuntime;

// ScriptStruct VotingFramework.VoteSessionRuntimeArray
// 0x0018 (0x0120 - 0x0108)
struct FVoteSessionRuntimeArray final : public FFastArraySerializer
{
public:
	class UWorld*                                 WorldRef;                                          // 0x0108(0x0008)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVoteSessionRuntime>            VotingSessions;                                    // 0x0110(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FVoteSessionRuntimeArray;

// ScriptStruct VotingFramework.VoteRuntime
// 0x0044 (0x0050 - 0x000C)
struct FVoteRuntime final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 WorldRef;                                          // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VoteSessionId;                                     // 0x0018(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   VoteId;                                            // 0x0020(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           VoteSelectionIds;                                  // 0x0028(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVoteState                                    VoteState;                                         // 0x0038(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VoteSelectionWinningResult;                        // 0x003C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   Shadow_VoteSelectionWinningResult;                 // 0x0044(0x0008)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EVoteState                                    Shadow_VoteState;                                  // 0x004C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVoteRuntime;

// ScriptStruct VotingFramework.VoteRuntimeArray
// 0x0018 (0x0120 - 0x0108)
struct FVoteRuntimeArray final : public FFastArraySerializer
{
public:
	class UWorld*                                 WorldRef;                                          // 0x0108(0x0008)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVoteRuntime>                   VotingResults;                                     // 0x0110(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FVoteRuntimeArray;

// ScriptStruct VotingFramework.VoteSelectionResults
// 0x0034 (0x0040 - 0x000C)
struct FVoteSelectionResults final : public FFastArraySerializerItem
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 WorldRef;                                          // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VoteSessionId;                                     // 0x0018(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   VoteId;                                            // 0x0020(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   VoteSelectionId;                                   // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ServerVoteTotal;                                   // 0x0030(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AllServersVoteTotal;                               // 0x0034(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Shadow_ServerVoteTotal;                            // 0x0038(0x0004)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Shadow_AllServersVoteTotal;                        // 0x003C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FVoteSelectionResults;

// ScriptStruct VotingFramework.VoteSelectionResultsArray
// 0x0018 (0x0120 - 0x0108)
struct FVoteSelectionResultsArray final : public FFastArraySerializer
{
public:
	class UWorld*                                 WorldRef;                                          // 0x0108(0x0008)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVoteSelectionResults>          VoteSelectionResults;                              // 0x0110(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FVoteSelectionResultsArray;

// ScriptStruct VotingFramework.VoteSelectionSettings
// 0x0020 (0x0020 - 0x0000)
struct FVoteSelectionSettings final
{
public:
	struct FGameplayTag                           VoteSelectionId;                                   // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   VoteSelectionText;                                 // 0x0008(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVoteSelectionSettings;

// ScriptStruct VotingFramework.VoteSettings
// 0x0038 (0x0038 - 0x0000)
struct FVoteSettings final
{
public:
	struct FGameplayTag                           VoteId;                                            // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocksSelection;                                   // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   VoteText;                                          // 0x0010(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVoteSelectionSettings>         VoteSelections;                                    // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVoteSettings;

// ScriptStruct VotingFramework.VoteSessionSettings
// 0x0038 (0x0038 - 0x0000)
struct FVoteSessionSettings final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   VoteSessionText;                                   // 0x0008(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FVoteSettings>                  VoteSettingsList;                                  // 0x0020(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoteSessionNetworkType                       NetworkType;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FVoteSessionSettings;

// ScriptStruct VotingFramework.VoteSelection
// 0x0018 (0x0018 - 0x0000)
struct FVoteSelection final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteId;                                            // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteSelectionId;                                   // 0x0010(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVoteSelection;

// ScriptStruct VotingFramework.CastedVote
// 0x0018 (0x0018 - 0x0000)
struct FCastedVote final
{
public:
	class FName                                   VoteSessionId;                                     // 0x0000(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VoteId;                                            // 0x0008(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VoteSelectionId;                                   // 0x0010(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCastedVote;

SDK_NAMESPACE_END
