#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VotingFramework

#include "Basic.hpp"

#include "VotingFramework_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MeshNetwork_classes.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// Class VotingFramework.VoteBroadcasterComponent
// 0x03C0 (0x05C0 - 0x0200)
class UVoteBroadcasterComponent final : public UMeshNetworkComponent
{
public:
	TArray<struct FVoteSessionSettings>           VoteSessionSettingsList;                           // 0x0200(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVoteSessionRuntimeArray               VoteSessionRuntimeList;                            // 0x0210(0x0120)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FVoteRuntimeArray                      VoteRuntimeList;                                   // 0x0330(0x0120)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FVoteSelectionResultsArray             VoteResultsList;                                   // 0x0450(0x0120)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	TMap<struct FUniqueNetIdRepl, struct FCastedVote> PlayerCastedVotesMap;                          // 0x0570(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	void OnVoteCasted(const struct FUniqueNetIdRepl& UserNetId, const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, const struct FGameplayTag& VoteSelectionId);
	void ServerSubmitVotesAggregated(class FName VoteSessionId, class FName VoteId, class FName VoteSelectionId, int32 VoteDelta);
	void VoteEnd(class FName VoteSessionId, class FName VoteId, class FName WinningVoteSelectionId);
	void VoteSessionComplete(class FName VoteSessionId);
	void VoteSessionSetup(class FName VoteSessionId, class FName StartingVoteId, EVoteSessionNetworkType NetworkType);
	void VoteSessionShutdown(class FName VoteSessionId);
	void VoteSetup(class FName VoteSessionId, class FName VoteId);
	void VoteStart(class FName VoteSessionId, class FName VoteId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoteBroadcasterComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoteBroadcasterComponent")
	}
	static class UVoteBroadcasterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteBroadcasterComponent>();
	}
};
DUMPER7_ASSERTS_UVoteBroadcasterComponent;

// Class VotingFramework.VoteDispatchSubsystem
// 0x00A0 (0x00D0 - 0x0030)
class UVoteDispatchSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x90];                                      // 0x0030(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVoteSelectionResults>          VotingResults;                                     // 0x00C0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoteDispatchSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoteDispatchSubsystem")
	}
	static class UVoteDispatchSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteDispatchSubsystem>();
	}
};
DUMPER7_ASSERTS_UVoteDispatchSubsystem;

// Class VotingFramework.VoteInitiationActor
// 0x0010 (0x0230 - 0x0220)
class AVoteInitiationActor final : public AInfo
{
public:
	uint8                                         Pad_220[0x8];                                      // 0x0220(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVoteBroadcasterComponent*              VoteBroadcasterComponent;                          // 0x0228(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoteInitiationActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoteInitiationActor")
	}
	static class AVoteInitiationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVoteInitiationActor>();
	}
};
DUMPER7_ASSERTS_AVoteInitiationActor;

// Class VotingFramework.VoteListenerComponent
// 0x00E0 (0x0190 - 0x00B0)
class UVoteListenerComponent : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& StartingVoteId, const EVoteSessionNetworkType NetworkType, EVoteSessionState SessionState)> OnVoteSessionSetupEvent; // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& StartingVoteId, EVoteSessionState SessionState)> OnVoteSessionVotingEvent; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, EVoteState VoteState)> OnVoteSetupEvent; // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, EVoteState VoteState)> OnVoteStartEvent; // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, const struct FGameplayTag& VoteSelectionId, int32 ServerVoteTotal, int32 AllServersVoteTotal)> OnVoteChangeEvent; // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, const struct FGameplayTag& WinningVoteSelectionId, EVoteState VoteState)> OnVoteEndEvent; // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& VoteSessionId)> OnVoteSessionCompleteEvent; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& VoteSessionId)> OnVoteSessionShutdownEvent; // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RequestedVoteSessionIds;                           // 0x0130(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RequestedVoteIds;                                  // 0x0150(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RequestedVoteSelectionIds;                         // 0x0170(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	void OnVoteChange(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, const struct FGameplayTag& VoteSelectionId, int32 ServerVoteTotal, int32 AllServersVoteTotal);
	void OnVoteEnd(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, const struct FGameplayTag& WinningVoteSelectionId, EVoteState VoteState);
	void OnVoteSessionComplete(const struct FGameplayTag& VoteSessionId);
	void OnVoteSessionSetup(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& StartingVoteId, EVoteSessionNetworkType NetworkType, EVoteSessionState SessionState);
	void OnVoteSessionShutdown(const struct FGameplayTag& VoteSessionId);
	void OnVoteSessionVoting(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& StartingVoteId, EVoteSessionState SessionState);
	void OnVoteSetup(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, EVoteState VoteState);
	void OnVoteStart(const struct FGameplayTag& VoteSessionId, const struct FGameplayTag& VoteId, EVoteState VoteState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoteListenerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoteListenerComponent")
	}
	static class UVoteListenerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteListenerComponent>();
	}
};
DUMPER7_ASSERTS_UVoteListenerComponent;

// Class VotingFramework.VoteResponderComponent
// 0x0078 (0x0208 - 0x0190)
class UVoteResponderComponent final : public UVoteListenerComponent
{
public:
	TArray<struct FVoteSelection>                 SupportedVoteSelections;                           // 0x0190(0x0010)(Edit, Net, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldLockVotingAfterCasted;                      // 0x01A0(0x0001)(Edit, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FUniqueNetIdRepl, struct FCastedVote> PlayerCastedVotesMap;                          // 0x01A8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class FName                                   ActiveVoteSessionId;                               // 0x01F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ActiveVoteId;                                      // 0x0200(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void CastDefaultVoteSelection(const class APlayerState* InPlayerState);
	void CastManualVoteSelection(const class APlayerState* InPlayerState, const struct FGameplayTag& VoteSelection);
	void CastManualVoteSelectionAtIndex(const class APlayerState* InPlayerState, const int32 SelectionIndex);
	void ServerCastVoteSelection(const struct FUniqueNetIdRepl& InUserId, const struct FCastedVote& CastedVote);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoteResponderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoteResponderComponent")
	}
	static class UVoteResponderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoteResponderComponent>();
	}
};
DUMPER7_ASSERTS_UVoteResponderComponent;

SDK_NAMESPACE_END
