#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VotingFramework

#include "Basic.hpp"

#include "VotingFramework_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function VotingFramework.VoteBroadcasterComponent.OnVoteCasted
// 0x0040 (0x0040 - 0x0000)
struct VoteBroadcasterComponent_OnVoteCasted final
{
public:
	struct FUniqueNetIdRepl                       UserNetId;                                         // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteSessionId;                                     // 0x0028(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteId;                                            // 0x0030(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteSelectionId;                                   // 0x0038(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteBroadcasterComponent_OnVoteCasted;

// Function VotingFramework.VoteBroadcasterComponent.ServerSubmitVotesAggregated
// 0x001C (0x001C - 0x0000)
struct VoteBroadcasterComponent_ServerSubmitVotesAggregated final
{
public:
	class FName                                   VoteSessionId;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VoteId;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VoteSelectionId;                                   // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VoteDelta;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteBroadcasterComponent_ServerSubmitVotesAggregated;

// Function VotingFramework.VoteBroadcasterComponent.VoteEnd
// 0x0018 (0x0018 - 0x0000)
struct VoteBroadcasterComponent_VoteEnd final
{
public:
	class FName                                   VoteSessionId;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VoteId;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WinningVoteSelectionId;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteBroadcasterComponent_VoteEnd;

// Function VotingFramework.VoteBroadcasterComponent.VoteSessionComplete
// 0x0008 (0x0008 - 0x0000)
struct VoteBroadcasterComponent_VoteSessionComplete final
{
public:
	class FName                                   VoteSessionId;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteBroadcasterComponent_VoteSessionComplete;

// Function VotingFramework.VoteBroadcasterComponent.VoteSessionSetup
// 0x0014 (0x0014 - 0x0000)
struct VoteBroadcasterComponent_VoteSessionSetup final
{
public:
	class FName                                   VoteSessionId;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartingVoteId;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoteSessionNetworkType                       NetworkType;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoteBroadcasterComponent_VoteSessionSetup;

// Function VotingFramework.VoteBroadcasterComponent.VoteSessionShutdown
// 0x0008 (0x0008 - 0x0000)
struct VoteBroadcasterComponent_VoteSessionShutdown final
{
public:
	class FName                                   VoteSessionId;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteBroadcasterComponent_VoteSessionShutdown;

// Function VotingFramework.VoteBroadcasterComponent.VoteSetup
// 0x0010 (0x0010 - 0x0000)
struct VoteBroadcasterComponent_VoteSetup final
{
public:
	class FName                                   VoteSessionId;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VoteId;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteBroadcasterComponent_VoteSetup;

// Function VotingFramework.VoteBroadcasterComponent.VoteStart
// 0x0010 (0x0010 - 0x0000)
struct VoteBroadcasterComponent_VoteStart final
{
public:
	class FName                                   VoteSessionId;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VoteId;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteBroadcasterComponent_VoteStart;

// Function VotingFramework.VoteListenerComponent.OnVoteChange
// 0x0020 (0x0020 - 0x0000)
struct VoteListenerComponent_OnVoteChange final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteId;                                            // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteSelectionId;                                   // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ServerVoteTotal;                                   // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AllServersVoteTotal;                               // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteListenerComponent_OnVoteChange;

// Function VotingFramework.VoteListenerComponent.OnVoteEnd
// 0x001C (0x001C - 0x0000)
struct VoteListenerComponent_OnVoteEnd final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteId;                                            // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           WinningVoteSelectionId;                            // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoteState                                    VoteState;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoteListenerComponent_OnVoteEnd;

// Function VotingFramework.VoteListenerComponent.OnVoteSessionComplete
// 0x0008 (0x0008 - 0x0000)
struct VoteListenerComponent_OnVoteSessionComplete final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteListenerComponent_OnVoteSessionComplete;

// Function VotingFramework.VoteListenerComponent.OnVoteSessionSetup
// 0x0014 (0x0014 - 0x0000)
struct VoteListenerComponent_OnVoteSessionSetup final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StartingVoteId;                                    // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoteSessionNetworkType                       NetworkType;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoteSessionState                             SessionState;                                      // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoteListenerComponent_OnVoteSessionSetup;

// Function VotingFramework.VoteListenerComponent.OnVoteSessionShutdown
// 0x0008 (0x0008 - 0x0000)
struct VoteListenerComponent_OnVoteSessionShutdown final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteListenerComponent_OnVoteSessionShutdown;

// Function VotingFramework.VoteListenerComponent.OnVoteSessionVoting
// 0x0014 (0x0014 - 0x0000)
struct VoteListenerComponent_OnVoteSessionVoting final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           StartingVoteId;                                    // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoteSessionState                             SessionState;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoteListenerComponent_OnVoteSessionVoting;

// Function VotingFramework.VoteListenerComponent.OnVoteSetup
// 0x0014 (0x0014 - 0x0000)
struct VoteListenerComponent_OnVoteSetup final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteId;                                            // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoteState                                    VoteState;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoteListenerComponent_OnVoteSetup;

// Function VotingFramework.VoteListenerComponent.OnVoteStart
// 0x0014 (0x0014 - 0x0000)
struct VoteListenerComponent_OnVoteStart final
{
public:
	struct FGameplayTag                           VoteSessionId;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteId;                                            // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVoteState                                    VoteState;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoteListenerComponent_OnVoteStart;

// Function VotingFramework.VoteResponderComponent.CastDefaultVoteSelection
// 0x0008 (0x0008 - 0x0000)
struct VoteResponderComponent_CastDefaultVoteSelection final
{
public:
	const class APlayerState*                     InPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteResponderComponent_CastDefaultVoteSelection;

// Function VotingFramework.VoteResponderComponent.CastManualVoteSelection
// 0x0010 (0x0010 - 0x0000)
struct VoteResponderComponent_CastManualVoteSelection final
{
public:
	const class APlayerState*                     InPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoteSelection;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteResponderComponent_CastManualVoteSelection;

// Function VotingFramework.VoteResponderComponent.CastManualVoteSelectionAtIndex
// 0x0010 (0x0010 - 0x0000)
struct VoteResponderComponent_CastManualVoteSelectionAtIndex final
{
public:
	const class APlayerState*                     InPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SelectionIndex;                                    // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VoteResponderComponent_CastManualVoteSelectionAtIndex;

// Function VotingFramework.VoteResponderComponent.ServerCastVoteSelection
// 0x0040 (0x0040 - 0x0000)
struct VoteResponderComponent_ServerCastVoteSelection final
{
public:
	struct FUniqueNetIdRepl                       InUserId;                                          // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCastedVote                            CastedVote;                                        // 0x0028(0x0018)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VoteResponderComponent_ServerCastVoteSelection;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
