#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinterQuestPresentTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WinterQuestPresentTag.WinterQuestPresentTag_C
// 0x0030 (0x02C8 - 0x0298)
class UWinterQuestPresentTag_C final : public UFortWinterQuestPresentTag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ContentHB;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tag;                                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CachedRandomInt;                                   // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           FromNamesStringArray;                              // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WinterQuestPresentTag(int32 EntryPoint);
	void OnSetupCharacterNameTag(const struct FLinearColor& CharacterName);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WinterQuestPresentTag_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WinterQuestPresentTag_C")
	}
	static class UWinterQuestPresentTag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinterQuestPresentTag_C>();
	}
};
DUMPER7_ASSERTS_UWinterQuestPresentTag_C;

SDK_NAMESPACE_END
