#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XpBarToolTip

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function XpBarToolTip.XpBarToolTip_C.GetHeaderText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetHeaderText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_XpBarToolTip_C_GetHeaderText;

// Function XpBarToolTip.XpBarToolTip_C.GetCommanderXPText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetCommanderXPText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_XpBarToolTip_C_GetCommanderXPText;

// Function XpBarToolTip.XpBarToolTip_C.GetBoostXPText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetBoostXPText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_XpBarToolTip_C_GetBoostXPText;

// Function XpBarToolTip.XpBarToolTip_C.GetRestedXPText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetRestedXPText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_XpBarToolTip_C_GetRestedXPText;

// Function XpBarToolTip.XpBarToolTip_C.GetBodyText
// 0x0018 (0x0018 - 0x0000)
struct XpBarToolTip_C_GetBodyText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_XpBarToolTip_C_GetBodyText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
